[{"TagName":"p","Data":"\n.mw-parser-output .breadcrumb{display:inline-block;margin-left:0.7em;margin-bottom:0.3em;padding:0.2em 0.4em;border-top:1px solid #C0C0C0;border-bottom:1px solid #C0C0C0}.mw-parser-output .breadcrumb ol{margin:0;padding:0;line-height:inherit;list-style:none}.mw-parser-output .breadcrumb li{display:inline-block;margin:0;white-space:nowrap}.mw-parser-output .breadcrumb li+li{padding-left:1.1em;background:no-repeat top -4px left 4px/12px url(\"https://upload.wikimedia.org/wikipedia/commons/d/df/Breadcrumb_separator.svg\")}\n"},{"TagName":"a","Data":""},{"TagName":"a","Data":"Help"},{"TagName":"a","Data":"FAQs"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Index of FAQs"},{"TagName":"a","Data":"Main FAQ"},{"TagName":"a","Data":"Overview"},{"TagName":"a","Data":"Readers"},{"TagName":"a","Data":"Schools"},{"TagName":"a","Data":"Organizations"},{"TagName":"a","Data":"Contributing"},{"TagName":"a","Data":"Editing"},{"TagName":"a","Data":"Featured articles"},{"TagName":"a","Data":"Administrators"},{"TagName":"a","Data":"Blocks"},{"TagName":"a","Data":"Technical"},{"TagName":"a","Data":"Problems"},{"TagName":"a","Data":"Article subjects"},{"TagName":"a","Data":"Categories"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Copyright"},{"TagName":"a","Data":"Forking"},{"TagName":"a","Data":"Templates"},{"TagName":"a","Data":"Main Page"},{"TagName":"a","Data":"Miscellaneous"},{"TagName":"p","Data":"\nThis page is addressed mainly to those editing Wikipedia. For information for readers, see Wikipedia:FAQ/Categories.\n"},{"TagName":"a","Data":"Wikipedia:FAQ/Categories"},{"TagName":"p","Data":"For more detailed guidelines on creating and organizing categories, see Help:Category. More technical information can be found at Wikipedia:Categorization.\n"},{"TagName":"a","Data":"Help:Category"},{"TagName":"a","Data":"Wikipedia:Categorization"},{"TagName":"h2","Data":"What are categories?"},{"TagName":"p","Data":"Categories allow articles to be placed in one or more groups, and allow those groups to be further categorized. An article belonging to a category should contain a link to a page that describes the category. Similarly, a sub-category belonging to a parent category should contain a link to the parent category's page.\n"},{"TagName":"p","Data":"Each category page contains an introduction that can be edited like an article, and an automatically generated list of links to sub-categories and articles that belong to the category.\n"},{"TagName":"p","Data":"Categories do not form a strict hierarchy or tree of categories, since each article can appear in more than one category, and each category can appear in more than one parent category. This allows multiple categorization schemes to co-exist.\n"},{"TagName":"h2","Data":"What is the purpose of categories?"},{"TagName":"p","Data":"See meta:Categorization requirements for the original purpose of the feature.\n"},{"TagName":"a","Data":"meta:Categorization requirements"},{"TagName":"h2","Data":"What categories already exist?"},{"TagName":"p","Data":"The best way to find out what exists is to browse. Either start at Wikipedia:Browse or Category:Articles, which shows the \"top\" level categories, to which all other categories should be connected. A list of all categories can be found at Special:Categories – there are many listed but you can use the search box. Category:Wikipedia categories is the standard top-level category provided by the MediaWiki software, but orphan categories (categories without any parent categories) can exist.\n"},{"TagName":"a","Data":"Wikipedia:Browse"},{"TagName":"a","Data":"Category:Articles"},{"TagName":"a","Data":"Special:Categories"},{"TagName":"a","Data":"Category:Wikipedia categories"},{"TagName":"h2","Data":"What is the difference between a list and a category?"},{"TagName":"p","Data":"Grouping articles into a category is not the same as making a list of articles. To edit a list of articles, you edit the list directly; but to place articles into a category, you edit an article and insert a category tag by placing [[Category:\u003ccategory name\u003e]] in the body of the text. This adds those articles as a list on the category's page.\n"},{"TagName":"p","Data":"While an article may be in multiple lists, the goal is that browsing downwards from a list parent category, e.g. Category:People, you should only arrive at articles that are about people, and not related articles.\n"},{"TagName":"a","Data":"Category:People"},{"TagName":"p","Data":"Further information on this topic can be found at Wikipedia:Categories, lists, and navigation templates.\n"},{"TagName":"a","Data":"Wikipedia:Categories, lists, and navigation templates"},{"TagName":"h2","Data":"Are \"List of ...\" articles still needed?"},{"TagName":"p","Data":"Lists are still useful for showing \"missing\" articles.\n"},{"TagName":"a","Data":"Lists"},{"TagName":"h2","Data":"What's the difference between categories and navigation templates?"},{"TagName":"p","Data":"John Brown's Raid on Harpers Ferry has an article, a category, and a navigation template.\n"},{"TagName":"a","Data":"article"},{"TagName":"a","Data":"category"},{"TagName":"a","Data":"navigation template"},{"TagName":"p","Data":"A navigation template is a collection of links on a single topic, formatted in a standard way, in a box with a border. These links can be arranged in different ways within the box. The box is placed at the right or at the foot of the pages linked in it.\n"},{"TagName":"a","Data":"navigation template"},{"TagName":"p","Data":"There are fewer navigation templates than categories. There is no requirement that a page be linked in a navigation template, whereas every page must belong to at least one category, and almost always more.\n"},{"TagName":"p","Data":"When appropriate, however, a navigation template organizes links in a far more useful way than categories do. It permits many nuances that categories can not, or can only clumsily. For the reader, a navigation template, if it exists, makes finding related articles much faster.\n"},{"TagName":"p","Data":"Templates are more complicated to create than categories, and the Wikipedian wishing to create one may want to use an existing template as a model.\n"},{"TagName":"h2","Data":"Can pages be in more than one category?"},{"TagName":"p","Data":"Yes, it is expected that most pages will be members of one category or more. Similarly, each category can be a member of more than one parent category.\n"},{"TagName":"h2","Data":"What are \"maintenance categories\"?"},{"TagName":"p","Data":"Some categories exist to aid maintenance of the project, for example, template categories and redirect categories. Maintenance categories are often added by templates rather than links. Contributors monitor these maintenance categories for many reasons to cleanup articles. Maintenance categories are usually \"hidden\" from view and can be seen only by registered users who have set their preferences to see hidden categories, which is easy to do:\n"},{"TagName":"a","Data":"template"},{"TagName":"a","Data":"redirect"},{"TagName":"a","Data":"Preferences"},{"TagName":"a","Data":"Appearance"},{"TagName":"a","Data":"purge your browser cache"},{"TagName":"p","Data":"Templates used to populate redirect categories are indexed functionally and alphanumerically at Wikipedia:Template messages/Redirect pages.\n"},{"TagName":"a","Data":"Wikipedia:Template messages/Redirect pages"},{"TagName":"h2","Data":"What is the naming convention for categories?"},{"TagName":"p","Data":"Use the Wikipedia titling conventions of no unnecessary capital letters or abbreviations, i.e. use [[Category:Category examples]] instead of [[Category:Category E.g.]].\n"},{"TagName":"p","Data":"If the category collects articles, then avoid the word List in the name of the category, and use plurals, e.g. Category:Popes.\n"},{"TagName":"a","Data":"Category:Popes"},{"TagName":"p","Data":"However, if the category collects lists, then using the word Lists in the name of the category is appropriate, e.g. Category:Lists of radio stations.\n"},{"TagName":"a","Data":"Category:Lists of radio stations"},{"TagName":"p","Data":"Use the topic name without indicating structure, e.g. [[Category:History of London]] instead of [[Category:History - Europe - UK - London]].\n"},{"TagName":"p","Data":"For more on this, see Wikipedia:Naming conventions (categories).\n"},{"TagName":"a","Data":"Wikipedia:Naming conventions (categories)"},{"TagName":"h2","Data":"How do I add an article to a category?"},{"TagName":"p","Data":"Edit the article and add [[Category:Category name]] at the bottom of the article.\nFor example: [[Category:Mind-body interventions]].\n"},{"TagName":"h2","Data":"How do I reference (link to) a category on a page without categorizing the page?"},{"TagName":"p","Data":"To link to the category page, put a colon before the word \"category\", inside the link, e.g. [[:Category:United States]], which will appear as Category:United States.\n"},{"TagName":"a","Data":"Category:United States"},{"TagName":"h2","Data":"Where should the category tag go in the article?"},{"TagName":"p","Data":"Category tags should be placed at the bottom of the article, after the appendices (e.g. References and External links). This ensures that when we press \"edit\", they are immediately presented with the main article text, rather than the more esoteric category tags. It also ensures that the category tags are in a consistent place so they are easy to find.\n"},{"TagName":"h2","Data":"In what order should categories be listed within the article?"},{"TagName":"p","Data":"Both the alphabet and importance are used to order categories currently. Although this, like most ordering issues in Wikipedia, is a matter for judgment, it is generally clear that some categories – for example the birthplace or birth year of a person – are less important than others, such as their status as an Oscar or Nobel Prize winner. \n"},{"TagName":"p","Data":"See also Wikipedia:Overcategorization.\n"},{"TagName":"a","Data":"Wikipedia:Overcategorization"},{"TagName":"h2","Data":"How do I sort the article differently on the category page?"},{"TagName":"p","Data":"Use a {{DEFAULTSORT}} tag, which looks like {{DEFAULTSORT:Smith, John}}. All categories will then sort under \"Smith\" unless a sorting key is used for them (see below).\n"},{"TagName":"a","Data":"DEFAULTSORT"},{"TagName":"a","Data":"sorting key"},{"TagName":"p","Data":"For individual categories, use a sorting key. For example, an article categorized by [[Category:Proper category|Sorting key]] would appear under S within the category.\n"},{"TagName":"a","Data":"sorting key"},{"TagName":"h2","Data":"Which categories can be used for articles on people?"},{"TagName":"p","Data":"Articles about people should be categorized cautiously. Unlike the body of the article, the various category choices for people can focus on, in most cases, what are common and unrelated attributes such as place of birth and gender, instead of emphasising the reason for their inclusion.\n"},{"TagName":"p","Data":"See Wikipedia:Categorization of people for guidelines.\n"},{"TagName":"a","Data":"Wikipedia:Categorization of people"},{"TagName":"h2","Data":"Somebody changed my categorization – what do I do?"},{"TagName":"p","Data":"All contributions to Wikipedia may be \"edited mercilessly\". If the change was not explained in the article history or talk page, try leaving a question on the relevant user's talk page. Remember to follow the bold, revert, discuss procedure.\n"},{"TagName":"a","Data":"talk page"},{"TagName":"a","Data":"bold, revert, discuss"},{"TagName":"h2","Data":"What should I do if I see an article without any categories?"},{"TagName":"p","Data":"Try to categorize it yourself. If you are unable to, add the {{Uncategorized}} template to the article, which will place a notice that the article needs categorizing, and automatically add it to the list at Category:Uncategorized pages.\n"},{"TagName":"a","Data":"Uncategorized"},{"TagName":"a","Data":"Category:Uncategorized pages"},{"TagName":"h2","Data":"I am interested in a category – where can I get involved?"},{"TagName":"p","Data":"If there is one, you can join the WikiProject involved.\n"},{"TagName":"a","Data":"WikiProject"},{"TagName":"h2","Data":"I want to change the relationships of some categories – will anyone mind?"},{"TagName":"p","Data":"If you want to restructure some existing categories, it is best to discuss your plans with others working in the same areas, or at least to announce your intentions.\n"},{"TagName":"h2","Data":"How do I create a category?"},{"TagName":"p","Data":"A category page should contain a brief description of the purpose of the category. A prominent link to the most important article in the category is usually a good idea, but please avoid copying large quantities of text or images from an article to a category page. \n"},{"TagName":"p","Data":"In many cases, a category has a \"main article\", which describes the subject of that category. The category and the article often have the same name. In such case, do this:\n"},{"TagName":"p","Data":"If the subject has count, then make the category name plural and create a redirect of that same, plural name, redirecting back to the singular name. For instance City and Category:Cities. That is, create a page called \"Cities\" and add the line\n"},{"TagName":"a","Data":"City"},{"TagName":"a","Data":"Category:Cities"},{"TagName":"p","Data":"In theory, if a main article is categorized correctly in its corresponding category, the use of the cat main template is redundant.\n"},{"TagName":"h2","Data":"Do categories need parents?"},{"TagName":"p","Data":"Yes. If you are creating a new category, look for a suitable \"parent\" category (or several) to assign it to. A good place to look is in articles on related subjects.\n"},{"TagName":"p","Data":"If you do not have a parent category, then your category cannot be browsed to via other categories. Also, your category will show up on Wikipedia:Database reports/Uncategorized categories.\n"},{"TagName":"a","Data":"Wikipedia:Database reports/Uncategorized categories"},{"TagName":"h2","Data":"Can categories be renamed, moved, or redirected?"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:CMOVE"},{"TagName":"p","Data":"Yes, \"speedy renaming\" can be done by listing the category at Wikipedia:Categories for discussion#Speedy renaming. See Wikipedia:Category deletion policy#Speedy renaming procedure.\n"},{"TagName":"a","Data":"Wikipedia:Categories for discussion#Speedy renaming"},{"TagName":"a","Data":"Wikipedia:Category deletion policy#Speedy renaming procedure"},{"TagName":"p","Data":"Redirects in the form #REDIRECT [[Category:New name]] are not recommended in category space. Instead, use the template {{Category redirect}}: a bot periodically recategorizes articles in the redirected category to the target category. Any editor can add a category redirect although, in general, established categories should not be unilaterally redirected but should be taken to Wikipedia:Categories for discussion to suggest redirecting as part of a rename / merger of the category.\n"},{"TagName":"a","Data":"Category redirect"},{"TagName":"a","Data":"Wikipedia:Categories for discussion"},{"TagName":"p","Data":"Categories can be moved. The old page will have {{Category redirect|New name}} instead of #REDIRECT [[:Category:New name]].\n"},{"TagName":"a","Data":"Category redirect"},{"TagName":"h2","Data":"How do I delete a category?"},{"TagName":"p","Data":"If you feel a category falls within Wikipedia:Category deletion policy, bring it up on Wikipedia:Categories for discussion.\n"},{"TagName":"a","Data":"Wikipedia:Category deletion policy"},{"TagName":"a","Data":"Wikipedia:Categories for discussion"},{"TagName":"h2","Data":"When were categories implemented?"},{"TagName":"p","Data":"The category feature appeared in the MediaWiki software v1.3, which was implemented on Wikipedia in late May 2004.\n"},{"TagName":"a","Data":"MediaWiki"},{"TagName":"p","Data":"Initially categories were displayed at the top right of articles, but they were soon moved to the bottom due to layout conflicts.\n"},{"TagName":"h2","Data":"Why might a category list not be up to date?"},{"TagName":"p","Data":"Sometimes, pages are not placed in categories manually by Wikipedia editors, but by means of templates, which can be used to place identical information (including category membership information) on many different pages at once. When the information on such a template is edited, the pages containing that template are updated, but not necessarily updated immediately. This means that pages might not always appear in the most current categories. However, this problem usually affects project maintenance categories rather than the categories used for browsing.\n"},{"TagName":"a","Data":"templates"},{"TagName":"p","Data":"Various other delays sometimes mean that lists of category members or subcategories, or the page counts given, are not completely up to date (see Phabricator tickets T18036, T132467, and T157670 for technical details). So if you are editing Wikipedia and find that your page hasn't yet shown up in a category or been removed from an old category, don't panic! The problem may resolve itself within minutes, but sometimes it may take longer, in some cases days, even months. (It may help if you purge the page.)\n"},{"TagName":"a","Data":"T18036"},{"TagName":"a","Data":"T132467"},{"TagName":"a","Data":"T157670"},{"TagName":"a","Data":"purge"},{"TagName":"h2","Data":"What tools are there to browse categories?"},{"TagName":"p","Data":"PetScan is a powerful querying tool that, among other tasks, can scan categories, selecting pages on many categories. \n"},{"TagName":"a","Data":"PetScan"},{"TagName":"p","Data":"\n"},{"TagName":"p","Data":"\n"},{"TagName":"p","Data":"More FAQ topics\n"},{"TagName":"a","Data":"Index of FAQs"},{"TagName":"a","Data":"Main FAQ"},{"TagName":"a","Data":"Overview"},{"TagName":"a","Data":"Readers"},{"TagName":"a","Data":"Schools"},{"TagName":"a","Data":"Organizations"},{"TagName":"a","Data":"Contributing"},{"TagName":"a","Data":"Editing"},{"TagName":"a","Data":"Featured articles"},{"TagName":"a","Data":"Administrators"},{"TagName":"a","Data":"Blocks"},{"TagName":"a","Data":"Technical"},{"TagName":"a","Data":"Problems"},{"TagName":"a","Data":"Article subjects"},{"TagName":"a","Data":"Categories"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Copyright"},{"TagName":"a","Data":"Forking"},{"TagName":"a","Data":"Templates"},{"TagName":"a","Data":"Main Page"},{"TagName":"a","Data":"Miscellaneous"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Category names"},{"TagName":"a","Data":"Categories, lists, and navigation templates"},{"TagName":"a","Data":"Overcategorization"},{"TagName":"a","Data":"Categorizing articles about people"},{"TagName":"a","Data":"People by year"},{"TagName":"a","Data":"Categorization/Sorting names"},{"TagName":"a","Data":"Categorizing redirects"},{"TagName":"a","Data":"User categories"},{"TagName":"a","Data":"Overcategorization/User categories"},{"TagName":"a","Data":"Basic help for readers"},{"TagName":"a","Data":"Basic help for editors"},{"TagName":"a","Data":"FAQ for readers"},{"TagName":"a","Data":"FAQ for editors"},{"TagName":"a","Data":"Container categories"},{"TagName":"a","Data":"Categorizing portals"},{"TagName":"a","Data":"Category classification templates"},{"TagName":"a","Data":"Template index/Category namespace"},{"TagName":"a","Data":"PetScan"},{"TagName":"a","Data":"Categories for discussion"},{"TagName":"a","Data":"Categories for discussion/Speedy"},{"TagName":"a","Data":"Categories for discussion/All current discussions"},{"TagName":"a","Data":"Categories are different from articles"},{"TagName":"a","Data":"Categories versus lists"},{"TagName":"a","Data":"Categorising fictional characters by attribute"},{"TagName":"a","Data":"Do not write articles using categories"},{"TagName":"a","Data":"Overcategorization/Intersection of location and occupation"},{"TagName":"a","Data":"Wiki workflow"},{"TagName":"a","Data":"WikiProject Plants/Description in year categories"},{"TagName":"a","Data":"DexDor/Terminology categories"},{"TagName":"a","Data":"DexDor/Categorization of award recipients"},{"TagName":"a","Data":"Alan Liefting/On categorisation"},{"TagName":"a","Data":"Coder Dan/Categories"},{"TagName":"a","Data":"gracefool/What is a category?"},{"TagName":"a","Data":"Kbdank71/Wikiproject notification"},{"TagName":"a","Data":"Category:Wikipedia categorization"},{"TagName":"a","Data":"Category:Contents"},{"TagName":"a","Data":"WikiProject Categories"}]