[{"TagName":"a","Data":"WP:DR (disambiguation)"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"policy"},{"TagName":"a","Data":"normally"},{"TagName":"a","Data":"consensus"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:DR"},{"TagName":"a","Data":"WP:DISPUTE"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Requests"},{"TagName":"a","Data":"Assume good faith"},{"TagName":"a","Data":"Use etiquette"},{"TagName":"a","Data":"Be civil"},{"TagName":"a","Data":"Be open to compromise"},{"TagName":"a","Data":"Discuss on talk pages"},{"TagName":"a","Data":"Failure to discuss"},{"TagName":"a","Data":"Help desk"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Third opinion"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Mediation"},{"TagName":"a","Data":"Noticeboards"},{"TagName":"a","Data":"Request comments"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Resolution noticeboard"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Administrator assistance"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Arbitration"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"Conduct policies"},{"TagName":"a","Data":"Block evasion"},{"TagName":"a","Data":"Civility"},{"TagName":"a","Data":"Clean start"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Edit warring"},{"TagName":"a","Data":"Editing policy"},{"TagName":"a","Data":"Harassment"},{"TagName":"a","Data":"No personal attacks"},{"TagName":"a","Data":"Ownership of content"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"Username policy"},{"TagName":"a","Data":"Vandalism"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"p","Data":"Disagreements on Wikipedia are normal; editors will frequently disagree with each other, particularly on content decisions. Editors are expected to engage in good faith to resolve their disputes, and must not personalise disputes. Many disputes can be resolved without external input, through gradual editing, discussion, and attempts to understand the legitimate objections of others.\n"},{"TagName":"a","Data":"personalise disputes"},{"TagName":"a","Data":"gradual editing"},{"TagName":"p","Data":"If discussion stalemates, editors may seek outside input to help resolve the dispute. Disputes over content have multiple venues for outside help, and related discussions can also be advertised on the talk pages of relevant WikiProjects to receive participation from interested uninvolved editors. Processes for resolving content disputes with outside help include asking for a third opinion, seeking help from a mediator, making a request at an appropriate noticeboard, or opening a request for comment. Issues of conduct may be addressed at the incidents noticeboard, and may be taken to the arbitration committee for more complex disputes.\n"},{"TagName":"a","Data":"talk pages"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"third opinion"},{"TagName":"a","Data":"mediator"},{"TagName":"a","Data":"noticeboard"},{"TagName":"a","Data":"request for comment"},{"TagName":"a","Data":"incidents noticeboard"},{"TagName":"a","Data":"arbitration committee"},{"TagName":"p","Data":"For issues that demand immediate attention, please see urgent situations.\n"},{"TagName":"a","Data":"urgent situations"},{"TagName":"h2","Data":"Resolving content disputes"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"Wikipedia:Talk"},{"TagName":"a","Data":"Category:Wikipedia discussion"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:RCD"},{"TagName":"p","Data":"There are many methods on Wikipedia for resolving disputes. Most methods are not formal processes and do not involve third-party intervention. Respond to all disputes or grievances, in the first instance, by approaching the editor or editors concerned and explaining which of their edits you object to and why you object. Use the article talk page or their user talk page to do so; be civil, polite, and always assume good faith.\n"},{"TagName":"a","Data":"always assume good faith"},{"TagName":"h3","Data":"Follow the normal protocol"},{"TagName":"p","Data":"When you find a passage in an article that is biased, inaccurate, or unsourced the best practice is to improve it if you can rather than deleting salvageable text. For example, if an article appears biased, add balancing material or make the wording more neutral. Include citations for any material you add. If you do not know how to fix a problem, ask for help on the talk page.\n"},{"TagName":"a","Data":"improve it if you can"},{"TagName":"a","Data":"citations"},{"TagName":"p","Data":"To help other editors understand the reasoning behind your edits, always explain your changes in the edit summary. If an edit is too complex to explain in an edit summary, or the change is contentious, add a section to the talk page that explains your rationale. Be prepared to justify your changes to other editors on the talk page. If you are reverted, continue to explain yourself; do not start an edit war.\n"},{"TagName":"a","Data":"edit summary"},{"TagName":"a","Data":"edit war"},{"TagName":"h3","Data":"Discuss with the other party"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:NEGOTIATE"},{"TagName":"a","Data":""},{"TagName":"a","Data":"Graham's hierarchy of disagreement"},{"TagName":"a","Data":"Wikipedia:Negotiation"},{"TagName":"p","Data":"Talking to other parties is not a mere formality, but an integral part of writing the encyclopedia. Discussing heatedly or poorly – or not at all – will make other editors less sympathetic to your position, and prevent you from effectively using later stages in dispute resolution. Sustained discussion between the parties, even if not immediately successful, demonstrates your good faith and shows you are trying to reach a consensus. Try negotiating a truce or proposing a compromise through negotiation.\n"},{"TagName":"a","Data":"consensus"},{"TagName":"a","Data":"truce"},{"TagName":"a","Data":"compromise"},{"TagName":"p","Data":"Do not continue edit warring; once sustained discussion begins, productively participating in it is a priority. Uninvolved editors who are invited to join a dispute will likely be confused and alarmed if there are large numbers of reverts or edits made while discussion is ongoing.\n"},{"TagName":"p","Data":"Talk page discussion is a prerequisite to almost all of Wikipedia's venues of higher dispute resolution. If you wish at any time to request a third opinion (3O) or request for comment, use the Dispute Resolution Noticeboard (DRN), or open a request for arbitration, you will be expected to show there has been talk page discussion of the dispute. Actual discussion is needed; discussion conducted entirely through edit summaries is inadequate.\n"},{"TagName":"a","Data":"Talk page discussion"},{"TagName":"a","Data":"third opinion (3O)"},{"TagName":"a","Data":"request for comment"},{"TagName":"a","Data":"Dispute Resolution Noticeboard (DRN)"},{"TagName":"a","Data":"request for arbitration"},{"TagName":"a","Data":"edit summaries"},{"TagName":"h3","Data":"Focus on content"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:FOC"},{"TagName":"a","Data":"Wikipedia:Editing policy"},{"TagName":"a","Data":"Wikipedia:Talk page guidelines"},{"TagName":"p","Data":"Focus on article content during discussions, not on editor conduct; comment on content, not the contributor. Wikipedia is written through collaboration, and assuming that the efforts of others are in good faith is therefore vital. Bringing up conduct during discussions about content creates a distraction to the discussion and may inflame the situation.\n"},{"TagName":"a","Data":"assuming that the efforts of others are in good faith"},{"TagName":"p","Data":"Focusing on content, and not bringing up conduct, can be difficult if it seems other editors are being uncivil or stubborn. Stay cool! It is never to your benefit to respond in kind. When it becomes too difficult or exhausting to maintain a civil discussion based on content, you should seriously consider going to an appropriate dispute resolution venue detailed below; but at no juncture should you lose your temper. Wikipedia is not like a lot of the Internet: we expect editors to be polite and reasonable at all times.\n"},{"TagName":"a","Data":"Stay cool"},{"TagName":"a","Data":"detailed below"},{"TagName":"h3","Data":"Disengage"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:DISENGAGE"},{"TagName":"p","Data":"Most situations are not actually urgent; there are no deadlines on Wikipedia, and perfection is not required. At all stages during discussion, consider whether you should take a break from the dispute. Taking a deep breath and sleeping on it often helps. You can always return to the discussion later, but at least you will return without an inflamed temper.\n"},{"TagName":"a","Data":"there are no deadlines"},{"TagName":"a","Data":"perfection is not required"},{"TagName":"p","Data":"Take a long-term view of the situation. You will probably be able to return and carry on editing an article when the previous problems no longer exist and the editor you were in dispute with might have moved on. The disputed article will continue to evolve, other editors may become interested, and they might have different perspectives if the issue comes up again. Even if your position on the article is not accepted, it might be in the future.\n"},{"TagName":"p","Data":"Disengaging is particularly helpful when in dispute with new users, as it gives them a chance to familiarise themselves with Wikipedia's policies and culture. There are currently 6,728,131 articles on Wikipedia. Consider focusing your contributions on another article, where you can more easily make constructive edits.\n"},{"TagName":"a","Data":"new users"},{"TagName":"a","Data":"6,728,131 articles"},{"TagName":"h2","Data":"Requesting other editors' help for content disputes"},{"TagName":"p","Data":""},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:CONTENTDISPUTE"},{"TagName":"a","Data":"WP:SEEKHELP"},{"TagName":"a","Data":"Wikipedia:Dispute resolution requests"},{"TagName":"p","Data":"If you cannot resolve the dispute through discussion with the other editor, you may request participation from interested editors uninvolved in the discussion, to build consensus for your changes. Several venues are available, listed below, to find editors who may be able to assist.\n"},{"TagName":"a","Data":"consensus"},{"TagName":"p","Data":"Participation in dispute resolution is voluntary and no one is required to participate. However, discussion can still proceed and consensus may be reached without the non-participating editor's input. Administrators and the community may take into consideration the degree and nature of an editor's participation in dispute resolution when deciding if an editor's activities are productive.\n"},{"TagName":"h3","Data":"Article talk page"},{"TagName":"p","Data":"Most content dispute discussions should start at the disputed article's talk page. This is a good place to talk to the other editor in the dispute, and also to get opinions from additional editors. Usually an article will be on other editors' watchlists, and other editors may see your conversation and join the discussion.\n"},{"TagName":"a","Data":"watchlists"},{"TagName":"h3","Data":"Related talk pages or WikiProjects"},{"TagName":"p","Data":"If your dispute is related to a certain content area, you can ask your question or publicize a related discussion on the talk page of relevant WikiProjects[a] or other pages. For example, a dispute at the article Battle of Stalingrad could be mentioned at Wikipedia talk:WikiProject Military history. To keep discussion centralized at the original talk page, you may just want to leave a link to the original talk page and a brief invitation to join the discussion, rather than restarting the discussion on the new talk page.\n"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"[a]"},{"TagName":"a","Data":"Battle of Stalingrad"},{"TagName":"a","Data":"Wikipedia talk:WikiProject Military history"},{"TagName":"h3","Data":"Third opinion"},{"TagName":"p","Data":"Third opinion is an excellent venue for small disputes involving only two editors.\n"},{"TagName":"a","Data":"Third opinion"},{"TagName":"h3","Data":"Noticeboards"},{"TagName":"p","Data":"If your dispute is related to the application of a specific policy or guideline, you may wish to post in one of these noticeboards (below) to get input from uninvolved editors familiar with that topic.\n"},{"TagName":"a","Data":"Biographies of living persons noticeboard"},{"TagName":"a","Data":"biographies of living persons policy"},{"TagName":"a","Data":"Conflict of interest noticeboard"},{"TagName":"a","Data":"conflicts of interest editing"},{"TagName":"a","Data":"Neutral point of view noticeboard"},{"TagName":"a","Data":"Fringe theories noticeboard"},{"TagName":"a","Data":"fringe theories"},{"TagName":"a","Data":"No original research noticeboard"},{"TagName":"a","Data":"original research"},{"TagName":"a","Data":"source synthesis"},{"TagName":"a","Data":"Reliable sources noticeboard"},{"TagName":"a","Data":"reliable"},{"TagName":"a","Data":"External links noticeboard"},{"TagName":"a","Data":"external links"},{"TagName":"h4","Data":"Requested move"},{"TagName":"p","Data":"Requested moves (RM) is a process to request community-wide input on the retitling of the article. RMs should be used when there is a dispute about what the title of an article should be, or when the user anticipates that a move would be contentious; while the RM is ongoing, the article should remain at its stable title. To solicit responses from a large number of editors, RMs can further be publicized via noticeboards or relevant WikiProject talk pages. RM discussions take place on a relevant article's talk page.\n"},{"TagName":"a","Data":"Requested moves"},{"TagName":"a","Data":"title of an article"},{"TagName":"a","Data":"noticeboards"},{"TagName":"a","Data":"WikiProject"},{"TagName":"h3","Data":"Requests for comment"},{"TagName":"p","Data":" "},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:DR#RfCs"},{"TagName":"p","Data":"Request for comment (RfC) is a process to request community-wide input on article content. RfCs can be used when there is a content-related dispute, or simply to get input from other editors before making a change. To solicit responses from a large number of editors, RfCs can be publicized via noticeboards or relevant WikiProject talk pages. An RfC bot will also automatically notify the feedback request service pool of editors. RfC discussions related to article content take place on article talk pages.\n"},{"TagName":"a","Data":"Request for comment"},{"TagName":"a","Data":"noticeboards"},{"TagName":"a","Data":"WikiProject"},{"TagName":"a","Data":"feedback request service"},{"TagName":"h3","Data":"Dispute resolution noticeboard"},{"TagName":"p","Data":"The Dispute resolution noticeboard (DRN) is the place where editors involved in a content dispute can have a discussion facilitated by uninvolved volunteers, in an attempt to find compromise and resolution to disputes. The volunteers are experienced Wikipedia editors with knowledge in dispute resolution. Disputes are sometimes referred to a more appropriate venue (such as Requests for Comment).\n"},{"TagName":"a","Data":"Dispute resolution noticeboard"},{"TagName":"h2","Data":"Resolving user conduct disputes"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:RUCD"},{"TagName":"a","Data":"WP:CONDUCTDISPUTE"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"Wikipedia:Tools/User interaction investigations"},{"TagName":"p","Data":"The difference between a conduct and a content dispute is that, in a conduct dispute, the actions of a user (such as how an editor edits or the comments the editor makes about other users) is the overriding issue. If there would be no substantive dispute if the editor was not behaving in a disruptive or unprofessional way, then it is a conduct dispute; if the primary issue is that two editors cannot agree on what the content of an article should be, then it is a content dispute.\n"},{"TagName":"h3","Data":"User talk page"},{"TagName":"p","Data":"If the issue is a conduct dispute (i.e., editor behavior) the first step is to talk with the other editor at their user talk page in a polite, simple, and direct way. Try to avoid discussing conduct issues on article talk pages. There are several templates you may use to warn editors of conduct issues,[b] or you may choose to use your own words to open a discussion on the editor's talk page. In all cases, and even in the face of serious misconduct, please try to act in a professional and polite manner. Turn the other cheek.\n"},{"TagName":"a","Data":"user talk page"},{"TagName":"a","Data":"polite, simple, and direct"},{"TagName":"a","Data":"several templates"},{"TagName":"a","Data":"[b]"},{"TagName":"a","Data":"Turn the other cheek"},{"TagName":"h3","Data":"Noticeboards"},{"TagName":"p","Data":"If discussion with the editor fails to resolve the issue, you may ask an administrator to evaluate the conduct of the user. You can ask for an administrator's attention at a noticeboard such as the administrators' noticeboard for incidents (ANI). Conduct complaints that fall into certain sub-categories of misconduct have their own administrators' noticeboard; for example, complaints about edit warring should be made at the edit warring noticeboard (AN3), and requests for enforcing an Arbitration Committee decision at the arbitration enforcement noticeboard (AE). Administrators and the community will look to see if you have tried to resolve the conflict before escalating, and they will look at your behavior as well as the behavior of the other editor or editors. Administrators have wide latitude to use their permissions to stop misconduct and damage to the encyclopedia; for example, an editor who is making personal attacks, and does not stop when you ask them, may be warned by an administrator and subsequently blocked.\n"},{"TagName":"a","Data":"administrator"},{"TagName":"a","Data":"administrators' noticeboard for incidents"},{"TagName":"a","Data":"edit warring noticeboard"},{"TagName":"a","Data":"arbitration enforcement noticeboard"},{"TagName":"p","Data":"Sockpuppet investigations is for evaluating concerns that two users may be sockpuppets (editors who are operating two accounts pretending to be different people, or blocked editors returning under a different account). Requests for comment on usernames and usernames for administrator attention (UAA) are the main methods of bringing attention to usernames which may be inappropriate.\n"},{"TagName":"a","Data":"Sockpuppet investigations"},{"TagName":"a","Data":"sockpuppets"},{"TagName":"a","Data":"Requests for comment on usernames"},{"TagName":"a","Data":"usernames for administrator attention (UAA)"},{"TagName":"h3","Data":"Sensitive issues and functionary actions"},{"TagName":"a","Data":"Wikipedia:Arbitration Committee"},{"TagName":"a","Data":"Wikipedia:CheckUser"},{"TagName":"a","Data":"Wikipedia:Oversight"},{"TagName":"a","Data":"Wikipedia:Harassment"},{"TagName":"a","Data":"Wikipedia:Volunteer Response Team"},{"TagName":"p","Data":"A small number of user conduct grievances involve sensitive or non-public information. These include issues where an arbitrator, checkuser, or oversighter has stated a privacy issue exists in the case, and disputes where there is a concern of a sensitive or private nature. For example:\n"},{"TagName":"a","Data":"arbitrator"},{"TagName":"a","Data":"checkuser"},{"TagName":"a","Data":"oversighter"},{"TagName":"a","Data":"BLP"},{"TagName":"a","Data":"external link"},{"TagName":"a","Data":"outing"},{"TagName":"a","Data":"socking by an administrator"},{"TagName":"p","Data":"Disputes or issues of this kind should usually be referred to the functionaries mailing list or Arbitration Committee. In some cases it may be possible to seek advice from an uninvolved trusted administrator by IRC, email or other private means. Where an action is marked as CheckUser, Oversight, VRT (formerly OTRS), or Arbitration Committee, that action should not be reverted without checking beforehand. The presumption is that they have a good reason, and those aware of the reason may need time to recheck, consult, and respond. Sometimes the relevant talk page or other wiki pages will have more details and these are always a good first place to check.\n"},{"TagName":"a","Data":"functionaries mailing list"},{"TagName":"a","Data":"Arbitration Committee"},{"TagName":"p","Data":"Such actions, if disputed, should initially be raised (by email if necessary) with the agent or functionary concerned. Where a dispute about CheckUser and Oversighter actions cannot be resolved in this manner, it should be referred to the functionaries mailing list or the Wikipedia:Arbitration Committee/Audit where appropriate. Disputes about ArbCom actions should be referred to the Arbitration Committee.\n"},{"TagName":"a","Data":"functionaries mailing list"},{"TagName":"a","Data":"Wikipedia:Arbitration Committee/Audit"},{"TagName":"a","Data":"Arbitration Committee"},{"TagName":"h3","Data":"Last resort: arbitration"},{"TagName":"a","Data":"Wikipedia:Requests for arbitration"},{"TagName":"a","Data":"Wikipedia:Arbitration Committee"},{"TagName":"a","Data":"Wikipedia:Arbitration policy"},{"TagName":"a","Data":"Wikipedia:Arbitration guide"},{"TagName":"p","Data":"If you have taken all other reasonable steps to resolve the dispute, and the dispute is not over the content of an article, you can request arbitration. Be prepared to show that you tried to resolve the dispute by other means. Arbitration differs from other forms of dispute resolution in that the Arbitration Committee will consider the case and issue a decision, instead of merely assisting the parties in reaching an agreement. If the issue is decided by arbitration, you will be expected to abide by the result. If the case involves serious user misconduct, arbitration may result in a number of serious consequences up to totally banning someone from editing, as laid out in the arbitration policy.\n"},{"TagName":"a","Data":"request arbitration"},{"TagName":"a","Data":"Arbitration Committee"},{"TagName":"a","Data":"arbitration policy"},{"TagName":"h2","Data":"For urgent situations"},{"TagName":"p","Data":"Some situations can be sufficiently urgent or serious that dispute resolution steps are not equipped to resolve the issue. Such situations can be forwarded to the appropriate venue.\n"},{"TagName":"a","Data":"Deletion"},{"TagName":"a","Data":"Wikipedia:Requests for oversight"},{"TagName":"a","Data":"Guide to appealing a block"},{"TagName":"a","Data":"Wikipedia:Administrator intervention against vandalism"},{"TagName":"a","Data":"Wikipedia:Usernames for administrator attention"},{"TagName":"a","Data":"Wikipedia:Sockpuppet investigations"},{"TagName":"a","Data":"Personal Attacks"},{"TagName":"a","Data":"Wikipedia:Administrators' noticeboard/Incidents"},{"TagName":"a","Data":"Wikipedia:Administrators' noticeboard/Edit warring"},{"TagName":"a","Data":"Wikipedia:Administrators' noticeboard"},{"TagName":"p","Data":"The administrators' noticeboards (e.g. AN and ANI) are not the appropriate place to raise disputes relating to content. Reports that do not belong at these noticeboards will be closed, and discussions will need to be re-posted by you at an appropriate forum – such as the dispute resolution noticeboard (DRN).\n"},{"TagName":"a","Data":"dispute resolution noticeboard (DRN)"},{"TagName":"h2","Data":"Words of caution"},{"TagName":"p","Data":"Dispute resolution is sometimes used by editors to try to game the system. This generally backfires badly. Please remember that dispute resolution mechanisms are ultimately there to enable editors to collaboratively write an encyclopedia – not to win personal or political battles.\n"},{"TagName":"a","Data":"game the system"},{"TagName":"a","Data":"backfires"},{"TagName":"p","Data":"Under Wikipedia:Decisions not subject to consensus of editors, some disputes are resolved in different forums using those forums' methods.\n"},{"TagName":"a","Data":"Wikipedia:Decisions not subject to consensus of editors"},{"TagName":"h2","Data":"History"},{"TagName":"p","Data":"From 2002 to 2007, disputes were discussed at Wikipedia:Conflicts between users. The process subsequently moved to Wikipedia:Requests for comment/User conduct until it was shut down in 2014 and replaced by this policy.\n"},{"TagName":"a","Data":"Wikipedia:Conflicts between users"},{"TagName":"a","Data":"Wikipedia:Requests for comment/User conduct"},{"TagName":"p","Data":"The Mediation Committee (MEDCOM) and the Association of Members' Advocates (AMA) assisted in disputes in the early days of Wikipedia. The MEDCOM was created by Jimbo at the same time that he kicked off ArbCom. The Mediation Cabal (MEDCAB) also existed for a number of years to assist in guerilla dispute resolution, and at one point eclipsed the original MEDCOM in popularity and efficacy.\n"},{"TagName":"a","Data":"Mediation Committee"},{"TagName":"a","Data":"Association of Members' Advocates"},{"TagName":"a","Data":"ArbCom"},{"TagName":"a","Data":"Mediation Cabal"},{"TagName":"h2","Data":"Notes"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"Don't template the regulars"},{"TagName":"a","Data":"Template the regulars"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"policies and guidelines"},{"TagName":"a","Data":"Five pillars"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"Verifiability"},{"TagName":"a","Data":"No original research"},{"TagName":"a","Data":"Neutral point of view"},{"TagName":"a","Data":"What Wikipedia is not"},{"TagName":"a","Data":"Biographies of living persons"},{"TagName":"a","Data":"Copyright"},{"TagName":"a","Data":"Copyright violations"},{"TagName":"a","Data":"Image use"},{"TagName":"a","Data":"Article titles"},{"TagName":"a","Data":"Notability"},{"TagName":"a","Data":"Autobiography"},{"TagName":"a","Data":"Citing sources"},{"TagName":"a","Data":"Reliable sources"},{"TagName":"a","Data":"Medicine"},{"TagName":"a","Data":"Do not include copies of lengthy primary sources"},{"TagName":"a","Data":"Plagiarism"},{"TagName":"a","Data":"Don't create hoaxes"},{"TagName":"a","Data":"Fringe theories"},{"TagName":"a","Data":"Patent nonsense"},{"TagName":"a","Data":"External links"},{"TagName":"a","Data":"Civility"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Harassment"},{"TagName":"a","Data":"Vandalism"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"No personal attacks"},{"TagName":"a","Data":"Ownership of content"},{"TagName":"a","Data":"Edit warring"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"No legal threats"},{"TagName":"a","Data":"Child protection"},{"TagName":"a","Data":"Paid-contribution disclosure"},{"TagName":"a","Data":"Assume good faith"},{"TagName":"a","Data":"Conflict of interest"},{"TagName":"a","Data":"Disruptive editing"},{"TagName":"a","Data":"Do not disrupt Wikipedia to illustrate a point"},{"TagName":"a","Data":"Etiquette"},{"TagName":"a","Data":"Gaming the system"},{"TagName":"a","Data":"Please do not bite the newcomers"},{"TagName":"a","Data":"Courtesy vanishing"},{"TagName":"a","Data":"Responding to threats of harm"},{"TagName":"a","Data":"Talk page guidelines"},{"TagName":"a","Data":"Signatures"},{"TagName":"a","Data":"Deletion policy"},{"TagName":"a","Data":"Proposed deletion"},{"TagName":"a","Data":"Biographies"},{"TagName":"a","Data":"Criteria for speedy deletion"},{"TagName":"a","Data":"Attack page"},{"TagName":"a","Data":"Oversight"},{"TagName":"a","Data":"Revision deletion"},{"TagName":"a","Data":"Administrators"},{"TagName":"a","Data":"Banning"},{"TagName":"a","Data":"Blocking"},{"TagName":"a","Data":"Page protection"},{"TagName":"a","Data":"Editing policy"},{"TagName":"a","Data":"Article size"},{"TagName":"a","Data":"Summary style"},{"TagName":"a","Data":"Be bold"},{"TagName":"a","Data":"Disambiguation"},{"TagName":"a","Data":"Hatnotes"},{"TagName":"a","Data":"Broad-concept article"},{"TagName":"a","Data":"Understandability"},{"TagName":"a","Data":"Manual of Style"},{"TagName":"a","Data":"Contents"},{"TagName":"a","Data":"Accessibility"},{"TagName":"a","Data":"Dates and numbers"},{"TagName":"a","Data":"Images"},{"TagName":"a","Data":"Layout"},{"TagName":"a","Data":"Lead section"},{"TagName":"a","Data":"Linking"},{"TagName":"a","Data":"Lists"},{"TagName":"a","Data":"Categories, lists, and navigation templates"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Template namespace"},{"TagName":"a","Data":"Project namespace"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"User pages"},{"TagName":"a","Data":"User boxes"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"Subpages"},{"TagName":"a","Data":"Terms of Use"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"Friendly space policy"},{"TagName":"a","Data":"Licensing and copyright"},{"TagName":"a","Data":"Privacy policy"},{"TagName":"a","Data":"List of all policies and guidelines"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"List of guidelines"},{"TagName":"a","Data":"Summaries of values and principles"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"accounts"},{"TagName":"a","Data":"governance"},{"TagName":"a","Data":"Unregistered (IP) users"},{"TagName":"a","Data":"Why create an account?"},{"TagName":"a","Data":"Create an account"},{"TagName":"a","Data":"Request an account"},{"TagName":"a","Data":"IPs are human too"},{"TagName":"a","Data":"IP addresses are not people"},{"TagName":"a","Data":"IP hopper"},{"TagName":"a","Data":"New account"},{"TagName":"a","Data":"Logging in"},{"TagName":"a","Data":"Reset passwords"},{"TagName":"a","Data":"Username policy"},{"TagName":"a","Data":"Changing username"},{"TagName":"a","Data":"Usernames for administrator attention"},{"TagName":"a","Data":"Unified login or SUL"},{"TagName":"a","Data":"Alternate account"},{"TagName":"a","Data":"Password strength requirements"},{"TagName":"a","Data":"User account security"},{"TagName":"a","Data":"Personal security practices"},{"TagName":"a","Data":"Two-factor authentication"},{"TagName":"a","Data":"2FA for AWB"},{"TagName":"a","Data":"Committed identity"},{"TagName":"a","Data":"On privacy, confidentiality and discretion"},{"TagName":"a","Data":"Compromised accounts"},{"TagName":"a","Data":"How to not get outed"},{"TagName":"a","Data":"Blocking policy"},{"TagName":"a","Data":"FAQ"},{"TagName":"a","Data":"Admin's guide"},{"TagName":"a","Data":"Tools"},{"TagName":"a","Data":"Autoblock"},{"TagName":"a","Data":"Appealing a block"},{"TagName":"a","Data":"Guide to appealing blocks"},{"TagName":"a","Data":"UTRS Unblock Ticket Request System"},{"TagName":"a","Data":"Blocking IP addresses"},{"TagName":"a","Data":"Range blocks"},{"TagName":"a","Data":"IPv6"},{"TagName":"a","Data":"Open proxies"},{"TagName":"a","Data":"Banning policy"},{"TagName":"a","Data":"ArbCom appeals"},{"TagName":"a","Data":"Sanctions"},{"TagName":"a","Data":"Personal sanctions"},{"TagName":"a","Data":"General sanctions"},{"TagName":"a","Data":"Contentious topics"},{"TagName":"a","Data":"Log"},{"TagName":"a","Data":"Essay"},{"TagName":"a","Data":"Long-term abuse"},{"TagName":"a","Data":"Standard offer"},{"TagName":"a","Data":"Global actions"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"Single-purpose account"},{"TagName":"a","Data":"Sleeper account"},{"TagName":"a","Data":"Vandalism-only account"},{"TagName":"a","Data":"Wikibreak"},{"TagName":"a","Data":"Enforcer"},{"TagName":"a","Data":"Retiring"},{"TagName":"a","Data":"Courtesy vanishing"},{"TagName":"a","Data":"Clean start"},{"TagName":"a","Data":"Quiet return"},{"TagName":"a","Data":"User groups"},{"TagName":"a","Data":"global user groups"},{"TagName":"a","Data":"Requests for permissions"},{"TagName":"a","Data":"Admin instructions"},{"TagName":"a","Data":"Admin guide"},{"TagName":"a","Data":"Account creator"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"(Auto) confirmed"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Autopatrolled"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"AutoWikiBrowser"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Bot"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Edit filter helper"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Event coordinator"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Extended confirmed"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"File mover"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"IP block exempt"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Mass message sender"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"New page reviewer"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Page mover"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Pending changes reviewer"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Rollback"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Template editor"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Global rights policy"},{"TagName":"a","Data":"Volunteer Response Team"},{"TagName":"a","Data":"Administrator"},{"TagName":"a","Data":"RfA"},{"TagName":"a","Data":"Bureaucrat"},{"TagName":"a","Data":"RfB"},{"TagName":"a","Data":"CheckUser"},{"TagName":"a","Data":"Oversight"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Edit filter manager"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Interface administrator"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Founder"},{"TagName":"a","Data":"Importer"},{"TagName":"a","Data":"Researcher"},{"TagName":"a","Data":"Committees"},{"TagName":"a","Data":"Arbitration Committee"},{"TagName":"a","Data":"Bot approvals group"},{"TagName":"a","Data":"Functionaries"},{"TagName":"a","Data":"SPI clerks"},{"TagName":"a","Data":"ArbCom clerks"},{"TagName":"a","Data":"Governance"},{"TagName":"a","Data":"Administration"},{"TagName":"a","Data":"FAQ"},{"TagName":"a","Data":"Formal organization"},{"TagName":"a","Data":"Editorial oversight and control"},{"TagName":"a","Data":"Quality control"},{"TagName":"a","Data":"Wikimedia Foundation"},{"TagName":"a","Data":"Board"},{"TagName":"a","Data":"Founder's seat"},{"TagName":"a","Data":"Meta-Wiki"},{"TagName":"a","Data":"Proposals"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"Elections"},{"TagName":"a","Data":"Policies and guidelines"},{"TagName":"a","Data":"Petitions"},{"TagName":"a","Data":"Noticeboards"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Reforms"}]