[{"TagName":"a","Data":"Wikipedia:Consensus"},{"TagName":"a","Data":"Wikipedia:Civility"},{"TagName":"a","Data":"Wikipedia:Categorization"},{"TagName":"a","Data":"Wikipedia:Canvassing"},{"TagName":"a","Data":"Wikipedia:WikiProject Countries"},{"TagName":"a","Data":"Wikipedia:WikiProject Council"},{"TagName":"a","Data":"Wikipedia:C-class"},{"TagName":"a","Data":"Wikipedia:Copyright problems"},{"TagName":"a","Data":"Wikipedia:Basic copyediting"},{"TagName":"a","Data":"Wikipedia:Copying within Wikipedia"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"Wikipedia policy with legal considerations"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:C"},{"TagName":"a","Data":"WP:COPY"},{"TagName":"a","Data":"WP:COPYRIGHT"},{"TagName":"a","Data":"Wikipedia copyright"},{"TagName":"a","Data":"Copyright policy"},{"TagName":"a","Data":"Copyright violation policy"},{"TagName":"a","Data":"Reusing Wikipedia content"},{"TagName":"a","Data":"CC BY-SA 4.0"},{"TagName":"a","Data":"GFDL"},{"TagName":"a","Data":"Public domain content"},{"TagName":"a","Data":"Non-free content"},{"TagName":"a","Data":"Non-US copyrights"},{"TagName":"a","Data":"Copying within Wikipedia"},{"TagName":"a","Data":"Copyright information index"},{"TagName":"a","Data":"Frequently asked questions"},{"TagName":"a","Data":"Donating copyrighted material"},{"TagName":"a","Data":"Copying text from other sources"},{"TagName":"a","Data":"Close paraphrasing"},{"TagName":"a","Data":"Requesting copyright permission"},{"TagName":"a","Data":"Guidance for text copyright problems"},{"TagName":"a","Data":"Copyright problems"},{"TagName":"a","Data":"Files for discussion"},{"TagName":"a","Data":"Contributor copyright investigations"},{"TagName":"a","Data":"General help"},{"TagName":"a","Data":"Copyright assistance"},{"TagName":"a","Data":"Media copyright questions"},{"TagName":"a","Data":"File copyright tags"},{"TagName":"a","Data":"Declaration of consent"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"Legal policies"},{"TagName":"a","Data":"Child protection"},{"TagName":"a","Data":"Copyright violations"},{"TagName":"a","Data":"Copyrights"},{"TagName":"a","Data":"Libel"},{"TagName":"a","Data":"No legal threats"},{"TagName":"a","Data":"Non-free content criteria"},{"TagName":"a","Data":"Paid-contribution disclosure"},{"TagName":"a","Data":"Reusing Wikipedia content"},{"TagName":"a","Data":"Terms of use"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"p","Data":"Important note: The Wikimedia Foundation does not own copyright on Wikipedia article texts or illustrations. It is therefore pointless to email our contact addresses asking for permission to reproduce articles or images, even if rules at your company, school, or organization mandate that you ask web site operators before copying their content.\n"},{"TagName":"p","Data":"The only Wikipedia content you should contact the Wikimedia Foundation about are the trademarked Wikipedia/Wikimedia logos, which are not freely usable without permission.\n"},{"TagName":"p","Data":"Permission to reproduce and modify text on Wikipedia has already been granted to anyone anywhere by the authors of individual articles as long as such reproduction and modification complies with licensing terms (see below and Wikipedia:Mirrors and forks for specific terms). Images may or may not permit reuse and modification; the conditions for reproduction of each image should be individually checked. The only exceptions are those cases in which editors have violated Wikipedia policy by uploading copyrighted material without authorization, or with copyright licensing terms which are incompatible with those Wikipedia authors have applied to the rest of Wikipedia content. While such material is present on Wikipedia (before it is detected and removed), it will be a copyright violation to copy it. For permission to use it, one must contact the owner of the copyright of the text or illustration in question; often, but not always, this will be the original author.\n"},{"TagName":"a","Data":"Wikipedia:Mirrors and forks"},{"TagName":"p","Data":"If you wish to reuse content from Wikipedia, first read the Reusers' rights and obligations section.  You should then read the Creative Commons Attribution-ShareAlike 4.0 International License and the GNU Free Documentation License.\n"},{"TagName":"a","Data":"Reusers' rights and obligations"},{"TagName":"a","Data":"Creative Commons Attribution-ShareAlike 4.0 International License"},{"TagName":"a","Data":"GNU Free Documentation License"},{"TagName":"p","Data":"The text of Wikipedia is copyrighted (automatically, under the Berne Convention) by Wikipedia editors and contributors and is formally licensed to the public under one or several liberal licenses. Most of Wikipedia's text and many of its images are co-licensed under the Creative Commons Attribution-ShareAlike 4.0 International License (CC BY-SA) and the GNU Free Documentation License (GFDL) (unversioned, with no invariant sections, front-cover texts, or back-cover texts). Some text has been imported only under CC BY-SA and CC BY-SA-compatible license and cannot be reused under GFDL; such text will be identified on the page footer, in the page history, or on the discussion page of the article that utilizes the text. Every image has a description page that indicates the license under which it is released or, if it is non-free, the rationale under which it is used.\n"},{"TagName":"a","Data":"Berne Convention"},{"TagName":"a","Data":"Creative Commons Attribution-ShareAlike 4.0 International License"},{"TagName":"a","Data":"GNU Free Documentation License"},{"TagName":"p","Data":"The licenses Wikipedia uses grant free access to our content in the same sense that free software is licensed freely. Wikipedia content can be copied, modified, and redistributed if and only if the copied version is made available on the same terms to others and acknowledgment of the authors of the Wikipedia article used is included (a link back to the article is generally thought to satisfy the attribution requirement; see below for more details). Copied Wikipedia content will therefore remain free under an appropriate license and can continue to be used by anyone subject to certain restrictions, most of which aim to ensure that freedom. This principle is known as copyleft in contrast to typical copyright licenses. \n"},{"TagName":"a","Data":"Wikipedia"},{"TagName":"a","Data":"free software"},{"TagName":"a","Data":"copyleft"},{"TagName":"p","Data":"To this end,\n"},{"TagName":"a","Data":"Wikipedia:Text of the Creative Commons Attribution-ShareAlike 4.0 International License"},{"TagName":"a","Data":"GNU Free Documentation License"},{"TagName":"a","Data":"disclaimers"},{"TagName":"p","Data":"The English text of the CC BY-SA and GFDL licenses is the only legally binding restriction between authors and users of Wikipedia content. What follows is our interpretation of CC BY-SA and GFDL, as it pertains to the rights and obligations of users and contributors.\n"},{"TagName":"h2","Data":"Contributors' rights and obligations"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:CRANDO"},{"TagName":"p","Data":"If you contribute text directly to Wikipedia, you thereby license it to the public for reuse under CC BY-SA and GFDL (unversioned, with no invariant sections, front-cover texts, or back-cover texts). Non-text media may be contributed under a variety of different licenses that support the general goal of allowing unrestricted re-use and re-distribution. See Guidelines for images and other media files, below.\n"},{"TagName":"a","Data":"Guidelines for images and other media files"},{"TagName":"p","Data":"If you want to import text that you have found elsewhere or that you have co-authored with others, you can only do so if it is available under terms that are compatible with the CC BY-SA license. You do not need to ensure or guarantee that the imported text is available under the GNU Free Documentation License, unless you are its sole author. Furthermore, please note that you cannot import information which is available only under the GFDL. In other words, you may only import text that is (a) single-licensed under terms compatible with the CC BY-SA license or (b) dual-licensed with the GFDL and another license with terms compatible with the CC BY-SA license. If you are the sole author of the material, you must license it under both CC BY-SA and GFDL.\n"},{"TagName":"p","Data":"If the material, text or media, has been previously published and you wish to donate it to Wikipedia under appropriate license, you will need to verify copyright permission through one of our established procedures. See Wikipedia:Donating copyrighted materials for details. If you are not a copyright holder, you will still need to verify copyright permission; see the Using copyrighted work from others section below.\n"},{"TagName":"a","Data":"Wikipedia:Donating copyrighted materials"},{"TagName":"a","Data":"Using copyrighted work from others"},{"TagName":"p","Data":"You retain copyright to materials you contribute to Wikipedia, text and media. Copyright is never transferred to Wikipedia. You can later republish and relicense them in any way you like. However, you can never retract or alter the license for copies of materials that you place here; these copies will remain so licensed until they enter the public domain when your copyright expires (currently some decades after an author's death). \n"},{"TagName":"a","Data":"public domain"},{"TagName":"h3","Data":"Using copyrighted work from others"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:COPYOTHERS"},{"TagName":"p","Data":"All creative works are copyrighted, by international agreement, unless either they fall into the public domain or their copyright is explicitly disclaimed. Generally, Wikipedia must have permission to use copyrighted works. There are some circumstances under which copyrighted works may be legally utilized without permission; see Wikipedia:Non-free content for specific details on when and how to utilize such material. However, it is our goal to be able to freely redistribute as much of Wikipedia's material as possible, so original images and sound files licensed under CC BY-SA and GFDL (unversioned, with no invariant sections, front-cover texts, or back-cover texts) or in the public domain are greatly preferred to copyrighted media files used under fair use or otherwise. \n"},{"TagName":"a","Data":"public domain"},{"TagName":"a","Data":"Wikipedia:Non-free content"},{"TagName":"a","Data":"public domain"},{"TagName":"a","Data":"fair use"},{"TagName":"p","Data":"If you want to import media (including text) that you have found elsewhere, and it does not meet the non-free content policy and guideline, you can only do so if it is public domain or available under terms that are compatible with the CC BY-SA license. If you import media under a compatible license which requires attribution, you must, in a reasonable fashion, credit the author(s). You must also in most cases verify that the material is compatibly licensed or public domain. If the original source of publication contains a copyright disclaimer or other indication that the material is free for use, a link to it on the media description page or the article's talk page may satisfy this requirement. If you obtain special permission to use a copyrighted work from the copyright holder under compatible terms, you must make a note of that fact (along with the relevant names and dates) and verify this through one of several processes. See Wikipedia:Requesting copyright permission for the procedure for asking a copyright holder to grant a usable license for their work and for the processes for verifying that license has been granted. \n"},{"TagName":"a","Data":"non-free content policy and guideline"},{"TagName":"a","Data":"Wikipedia:Requesting copyright permission"},{"TagName":"p","Data":"Never use materials that infringe the copyrights of others. This could create legal liabilities and seriously hurt Wikipedia. If in doubt, write the content yourself, thereby creating a new copyrighted work which can be included in Wikipedia without trouble.\n"},{"TagName":"p","Data":"Note that copyright law governs the creative expression of ideas, not the ideas or information themselves. Therefore, it is legal to read an encyclopedia article or other work, reformulate the concepts in your own words, and submit it to Wikipedia, so long as you do not follow the source too closely. (See our Copyright FAQ for more on how much reformulation may be necessary as well as the distinction between summary and abridgment.) However, it would still be unethical (but not illegal) to do so without citing the original as a reference (see the plagiarism guideline).\n\n"},{"TagName":"a","Data":"how much reformulation may be necessary"},{"TagName":"a","Data":"the distinction between summary and abridgment"},{"TagName":"a","Data":"plagiarism guideline"},{"TagName":"h3","Data":"Linking to copyrighted works"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:COPYLINK"},{"TagName":"a","Data":"WP:COPYLINKS"},{"TagName":"a","Data":"WP:LINKVIO"},{"TagName":"p","Data":"Since most recently-created works are copyrighted, almost any Wikipedia article which cites its sources will link to copyrighted material. It is not necessary to obtain the permission of a copyright holder before linking to copyrighted material, just as an author of a book does not need permission to cite someone else's work in their bibliography. Likewise, Wikipedia is not restricted to linking only to CC BY-SA or open-source content.\n"},{"TagName":"a","Data":"cites its sources"},{"TagName":"a","Data":"bibliography"},{"TagName":"p","Data":"However, if you know or reasonably suspect that an external Web site is carrying a work without the permission of the copyright holder, do not link to that copy of the work. An example would be linking to a site hosting the lyrics of many popular songs without permission from their copyright holders. Knowingly and intentionally directing others to a site that violates copyright has been considered a form of contributory infringement in the United States (Intellectual Reserve v. Utah Lighthouse Ministry [1]); cf. GS Media v Sanoma for a landmark case in the European Union. Linking to a page that illegally distributes someone else's work sheds a bad light on Wikipedia and its editors.\n"},{"TagName":"a","Data":"contributory infringement"},{"TagName":"a","Data":"Intellectual Reserve v. Utah Lighthouse Ministry"},{"TagName":"a","Data":"[1]"},{"TagName":"a","Data":"GS Media v Sanoma"},{"TagName":"p","Data":"The copyright status of Internet archives in the United States is unclear, however.  It is currently acceptable to link to Internet archives such as the Wayback Machine, which host unmodified archived copies of webpages taken at various points in time.\n"},{"TagName":"a","Data":"Internet archives"},{"TagName":"a","Data":"the Wayback Machine"},{"TagName":"p","Data":"In articles about a website, it is acceptable to include a link to that website even if there are possible copyright violations somewhere on the site.\n"},{"TagName":"p","Data":"Context is also important; it may be acceptable to link to a reputable website's review of a particular film, even if it presents a still from the film (such uses are generally either explicitly permitted by distributors or allowed under fair use). However, linking directly to the still of the film removes the context and the site's justification for permitted use or fair use.\n"},{"TagName":"h3","Data":"Copyright violations"},{"TagName":"a","Data":"Wikipedia:Copyright violations"},{"TagName":"p","Data":"Contributors who repeatedly post copyrighted material despite appropriate warnings may be blocked from editing by any administrator to prevent further problems.\n"},{"TagName":"a","Data":"blocked"},{"TagName":"a","Data":"administrator"},{"TagName":"p","Data":"If you suspect a copyright violation, you should at least bring up the issue on that page's discussion page. Others can then examine the situation and take action if needed. Some cases will be false alarms. For example, text that can be found elsewhere on the Web that was in fact copied from Wikipedia in the first place is not a copyright violation on Wikipedia's part.\n"},{"TagName":"a","Data":"discussion page"},{"TagName":"p","Data":"If a page contains material which infringes copyright, that material–and the whole page, if there is no other material present–should be removed. See Wikipedia:Copyright violations for more information, and Wikipedia:Copyright problems for detailed instructions.\n"},{"TagName":"a","Data":"Wikipedia:Copyright violations"},{"TagName":"a","Data":"Wikipedia:Copyright problems"},{"TagName":"h3","Data":"Guidelines for images and other media files "},{"TagName":"p","Data":"Images, photographs, video and sound files, like written works, are subject to copyright. Someone holds the copyright unless the work has explicitly been placed in the public domain. Images, video and sound files on the internet need to be licensed directly from the copyright holder or someone able to license on their behalf. In some cases, fair use guidelines may allow them to be used irrespective of any copyright claims.\n"},{"TagName":"a","Data":"copyright"},{"TagName":"a","Data":"public domain"},{"TagName":"a","Data":"fair use"},{"TagName":"p","Data":"On Wikipedia, the use of media files is subject to the image use policy, and additionally the use of non-free content is governed by Wikipedia:Non-free content. Image description pages must be tagged with a special tag to indicate the legal status of the images, as described at Wikipedia:Image copyright tags. Untagged or incorrectly-tagged images may be deleted.\n"},{"TagName":"a","Data":"image use policy"},{"TagName":"a","Data":"Wikipedia:Non-free content"},{"TagName":"a","Data":"Wikipedia:Image copyright tags"},{"TagName":"p","Data":"Questions about media copyright may be directed to Wikipedia:Media copyright questions, which is generally staffed by volunteers familiar with Wikipedia's media copyright guidelines and policies.\n"},{"TagName":"a","Data":"Wikipedia:Media copyright questions"},{"TagName":"h2","Data":"Governing copyright law"},{"TagName":"a","Data":"Wikipedia:Non-U.S. copyrights"},{"TagName":"p","Data":"The Wikimedia Foundation is based in the United States and accordingly governed by United States copyright law. Regardless, according to Jimbo Wales, the co-founder of Wikipedia, Wikipedia contributors should respect the copyright law of other nations, even if these do not have official copyright relations with the United States.[2] \n"},{"TagName":"a","Data":"Jimbo Wales"},{"TagName":"a","Data":"[2]"},{"TagName":"p","Data":"A brief summary of non-U.S. copyright laws, including guidelines on determining copyright status of the material in the United States, is available at Wikipedia:Non-U.S. copyrights.\n"},{"TagName":"a","Data":"Wikipedia:Non-U.S. copyrights"},{"TagName":"h3","Data":"Works by the United States Federal Government"},{"TagName":"a","Data":"Wikipedia:Public domain § U.S. government works"},{"TagName":"p","Data":"Works produced by civilian and military employees of the United States federal government in the scope of their employment are public domain by statute in the United States (though they may be protected by copyright outside the U.S.). It is not enough that the employee was working at the time; he/she must have made the work as part of his/her duties (e.g. a soldier who takes a photograph with his/her personal camera while on patrol in Iraq owns the copyright to the photo, but it may find its way onto a unit webpage or otherwise be licensed to the government).  \n"},{"TagName":"a","Data":"United States"},{"TagName":"p","Data":"However, not every work republished by the U.S. government falls into this category. The U.S. government can own copyrights that are assigned to it by others–for example, works created by contractors.\n"},{"TagName":"p","Data":"United States Code; Title 17; Chapter 1; § 105 Subject matter of copyright; United States Government works.\nCopyright protection under this title is not available for any work of the United States Government, but the United States Government is not precluded from receiving and holding copyrights transferred to it by assignment, bequest, or otherwise.US Code"},{"TagName":"a","Data":"US Code"},{"TagName":"p","Data":"Moreover, images and other media found on .mil and .gov websites may be using commercial stock photography owned by others. It may be useful to check the privacy and security notice of the website, but only with an email to the webmaster can you be confident that an image is in the public domain.\n"},{"TagName":"a","Data":"stock photography"},{"TagName":"p","Data":"Note that while the United States government does not claim copyright protection on its own works, governments outside the U.S. often do claim copyright over works produced by their employees. (For example, several Commonwealth realms utilize Crown copyright.)\n"},{"TagName":"a","Data":"Crown copyright"},{"TagName":"h3","Data":"Works by state governments of the United States"},{"TagName":"p","Data":"In contrast to the federal government, most state and local governments in the United States retain copyright to their employees' work. Such work is not in the public domain, so please make sure to check copyright information before using it.\n"},{"TagName":"a","Data":"check copyright information"},{"TagName":"h2","Data":"Reusers' rights and obligations"},{"TagName":"a","Data":"Wikipedia:Reusing Wikipedia content"},{"TagName":"p","Data":"The only Wikipedia content you should contact the Wikimedia Foundation about is the trademarked Wikipedia/Wikimedia logos, which are not freely usable without permission (members of the media, see Foundation:Press room, others see Wikipedia:Contact us). If you want to use other Wikipedia materials in your own books/articles/websites or other publications, you can do so, unless it is used under the non-free content provisions—but only in compliance with the licensing terms. Please follow the guidelines below:\n"},{"TagName":"a","Data":"Foundation:Press room"},{"TagName":"a","Data":"Wikipedia:Contact us"},{"TagName":"a","Data":"non-free content provisions"},{"TagName":"h3","Data":"Re-use of text"},{"TagName":"a","Data":"hyperlink"},{"TagName":"a","Data":"URL"},{"TagName":"a","Data":"https://creativecommons.org/licenses/by-sa/4.0/"},{"TagName":"p","Data":"For further information, please refer to the legal code of the CC BY-SA License.\n"},{"TagName":"a","Data":"legal code of the CC BY-SA License"},{"TagName":"h4","Data":"Additional availability of text under the GNU Free Documentation License"},{"TagName":"p","Data":"For compatibility reasons, any page which does not incorporate text that is exclusively available under CC BY-SA or a CC BY-SA-compatible license is also available under the terms of the GNU Free Documentation License. In order to determine whether a page is available under the GFDL, review the page footer, page history, and discussion page for attribution of single-licensed content that is not GFDL-compatible. Since all text published before June 15th, 2009 on Wikipedia was released under the GFDL, you can ensure GFDL compatibility by using the page history to retrieve content published before that date.\n"},{"TagName":"a","Data":"GNU Free Documentation License"},{"TagName":"h3","Data":"Re-use of non-text media"},{"TagName":"p","Data":"Where not otherwise noted, non-text media files are available under various free culture licenses, consistent with the Wikimedia Foundation Licensing Policy. Please view the media description page for details about the license of any specific media file.\n"},{"TagName":"a","Data":"Wikimedia Foundation Licensing Policy"},{"TagName":"h3","Data":"Non-free materials and special requirements"},{"TagName":"p","Data":"Wikipedia articles may also include quotations, images, or other media under the U.S. Copyright law \"fair use\" doctrine in accordance with our guidelines for non-free content. In Wikipedia, such \"fair use\" material should be identified as from an external source by an appropriate method (on the image description page, or history page, as appropriate; quotations should be denoted with quotation marks or block quotation in accordance with Wikipedia's manual of style). This leads to possible restrictions on the use, outside of Wikipedia, of such \"fair use\" content retrieved from Wikipedia: this \"fair use\" content does not fall under the CC BY-SA or GFDL license as such, but under the \"fair use\" (or similar/different) regulations in the country where the media are retrieved.\n"},{"TagName":"a","Data":"guidelines for non-free content"},{"TagName":"a","Data":"Wikipedia's manual of style"},{"TagName":"p","Data":"Prior to June 15, 2009, Wikipedia did permit some text under licenses that were compatible with the GFDL but might require additional terms that were not required for original Wikipedia text (such as including Invariant Sections, Front-Cover Texts, or Back-Cover Texts). However, these materials could only be placed if the original copyright holders did not require that they be carried forward; for that reason, they impose no special burden for reuse.\n"},{"TagName":"h2","Data":"Reusing text within Wikipedia"},{"TagName":"a","Data":"Wikipedia:Copying within Wikipedia"},{"TagName":"p","Data":"When you merge or split an article, or otherwise move text from one page to another within Wikipedia, the page history functionality cannot by itself determine where the content originally came from. This may violate the attribution clause of the project's licenses. If you are copying text within Wikipedia, you must at least put a link to the source page in an edit summary at the destination page. It is encouraged to do the same thing at the source page, and to add notices at the talk pages of both.\n"},{"TagName":"a","Data":"merge"},{"TagName":"a","Data":"split"},{"TagName":"a","Data":"page history functionality"},{"TagName":"a","Data":"edit summary"},{"TagName":"p","Data":"If you reuse text which you created yourself, the above may still be a good idea to avoid confusion, but it isn't mandatory. \n"},{"TagName":"h2","Data":"If you are the owner of Wikipedia-hosted content being used without your permission"},{"TagName":"p","Data":"\nIf you are the owner of content that is being used on Wikipedia without your permission, then you may request the page be immediately removed from Wikipedia; see Request for immediate removal of copyright violation. You can also contact our designated agent to have it permanently removed (but it may take up to a week for the page to be deleted that way). You may also blank the page and replace it with the words {{copyvio|URL or place you published the text}} but the text will still be in the page history. Either way, we will, of course, need some evidence to support your claim of ownership. \n"},{"TagName":"a","Data":"Request for immediate removal of copyright violation"},{"TagName":"a","Data":"designated agent"},{"TagName":"a","Data":"copyvio"},{"TagName":"p","Data":"Inversely, if you are the editor of a Wikipedia article and have found a copy hosted without following the licensing requirements for attribution, please see Wikipedia:Standard license violation letter.\n"},{"TagName":"a","Data":"Wikipedia:Standard license violation letter"},{"TagName":"h2","Data":"See also"},{"TagName":"a","Data":"Wikipedia:Copyright problems"},{"TagName":"a","Data":"Wikipedia:Designated agent"},{"TagName":"a","Data":"Wikipedia:Example requests for permission"},{"TagName":"a","Data":"Wikipedia:FAQ/Contributing#Copyrights"},{"TagName":"a","Data":"Wikipedia:FAQ/Copyright"},{"TagName":"a","Data":"Wikipedia:File copyright tags"},{"TagName":"a","Data":"Wikipedia:Freedom of panorama"},{"TagName":"a","Data":"Wikipedia:Mirrors and forks"},{"TagName":"a","Data":"Wikipedia:Non-free content"},{"TagName":"a","Data":"Wikipedia:Non-U.S. copyrights"},{"TagName":"a","Data":"Wikipedia:Plagiarism"},{"TagName":"a","Data":"Wikipedia:Scanning an image does not make it your \"own work\""},{"TagName":"a","Data":"Wikipedia:Spotting possible copyright violations"},{"TagName":"a","Data":"Wikipedia:Standard license violation letter"},{"TagName":"a","Data":"Wikipedia:WikiProject Copyright Cleanup"},{"TagName":"h2","Data":"External links"},{"TagName":"a","Data":"Commons:Copyright rules"},{"TagName":"a","Data":"m:Avoid Copyright Paranoia"}]