[{"TagName":"a","Data":"Wikipedia:Substitution"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":""},{"TagName":"a","Data":"how-to guide"},{"TagName":"a","Data":"Wikipedia's policies or guidelines"},{"TagName":"a","Data":"consensus"},{"TagName":"a","Data":"vetting"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"H:SUBST"},{"TagName":"p","Data":"Substitution is a function whereby, when an editor saves a page, an item in the wikicode is permanently replaced with its current value. In particular, templates and magic words can be substituted, as an alternative to transclusion. The difference is that when a template is substituted on a page, its appearance on that page will no longer be affected by later changes made to the template itself (as is the case in a transcluded template).\n"},{"TagName":"a","Data":"templates"},{"TagName":"a","Data":"magic words"},{"TagName":"a","Data":"transclusion"},{"TagName":"p","Data":"Substitution is done using the subst: modifier after the double opening braces. For example, to substitute the template {{afd}}, type {{subst:afd}}. You can check the resulting wikitext before saving by clicking \"Show changes\" (and see what the page will look like by clicking \"Show preview\").\n"},{"TagName":"a","Data":"afd"},{"TagName":"p","Data":"Variables and parser functions can also be substituted, meaning that their current value will be recorded permanently on the page – they will not be re-evaluated whenever someone views the page.\n"},{"TagName":"a","Data":"Variables"},{"TagName":"a","Data":"parser functions"},{"TagName":"h2","Data":"When to use substitution"},{"TagName":"p","Data":"Generally speaking, templates are transcluded rather than substituted, although there are some that are specifically designed to be substituted (and may not work if transcluded). Some reasons for substituting templates include:\n"},{"TagName":"a","Data":"transcluded"},{"TagName":"p","Data":"Disadvantages of substitution may include:\n"},{"TagName":"p","Data":"Time-dependent variables are substituted to make the rendered page independent of the time at which it is viewed. Substituting page-dependent variables makes the resulting wikitext independent of renaming of the page and of copying to another page.\n"},{"TagName":"p","Data":"For more detailed guidance, including lists of templates which should or should not be substituted, see Wikipedia:Substitution.\n"},{"TagName":"a","Data":"Wikipedia:Substitution"},{"TagName":"h2","Data":"Syntax"},{"TagName":"p","Data":"To substitute a template, use the same syntax as for transclusion, but include subst: after the opening double braces. For example, to substitute the template {{afd}}, type {{subst:afd}}. Parameters can be included as in the case of transclusion, for example {{subst:afd|Some article}}.\n"},{"TagName":"a","Data":"transclusion"},{"TagName":"a","Data":"afd"},{"TagName":"p","Data":"Pages not in the template namespace can also be substituted, e.g. {{subst:User:Cleverclogs/My box}}. To substitute the current content of a page in mainspace (i.e. one with no namespace prefix), two colons are required, as in {{subst::Page}}. If a substituted page or template does not exist, the entire expression (with braces and subst:) will remain unchanged in the wikitext and on the page.\n"},{"TagName":"a","Data":"mainspace"},{"TagName":"p","Data":"Use the same syntax to substitute variables and parser functions, e.g. {{subst:PAGENAME}} or {{subst:#switch:{{NUMBEROFADMINS}}|1=Foo|1000=Bar|#default=Baz}}.\n"},{"TagName":"p","Data":"There may be whitespace between the opening braces and the \"subst:\". However it is recommended not to have any space or newlines immediately after the \"subst:\", as this will not work in every case.\n"},{"TagName":"h2","Data":"Technical implementation"},{"TagName":"p","Data":"Substitution is part of the process performed on saving a page, and causes the wikitext saved as a result of the edit to differ from the text which the user actually entered in the edit window. Other replacements performed during this process include expansion of links using the pipe trick, and replacement of multiple tildes with signatures and timestamps.\n"},{"TagName":"a","Data":"pipe trick"},{"TagName":"p","Data":"This means that substitution necessarily occurs before any actions performed at the time of page rendering (conversion of the stored wikitext to HTML). In particular, substitutions are done before transclusions. So typing {{subst:Help:L{{in(tut)}}k}} will not do substitution, even though {{in(tut)}} returns the text \"in\" and Help:Link exists. The transclusion of {{in(tut)}} has not yet taken place when the substitution is attempted. However, replace {{in(tut)}} with {{subst:in(tut)}}, and both substitutions will be performed in the expected order.\n"},{"TagName":"a","Data":"in(tut)"},{"TagName":"a","Data":"Help:Link"},{"TagName":"a","Data":"in(tut)"},{"TagName":"p","Data":"Similarly:\n"},{"TagName":"a","Data":"x0"},{"TagName":"a","Data":"t6"},{"TagName":"p","Data":"Clicking the \"Show changes\" button during editing shows the wikitext that will result after substitution and other immediate replacements are carried out. Clicking \"Show preview\" shows what the rendered page will look like after these replacements.\n"},{"TagName":"p","Data":"If a page substitutes itself (e.g. in the noinclude part of a template page) it substitutes the old version, as it was before the current edit.\n"},{"TagName":"p","Data":"If the expansion of a substituted template itself contains instances of the subst: syntax, then the substitutions are performed recursively. However substitution is not automatically recursive – if a substituted template contains ordinary transclusions or variables and parser functions which are not explicitly substituted, then these will not be substituted.\n"},{"TagName":"p","Data":"Note also that if instances of the subst: syntax appear in a template that is being transcluded, then they will be rendered unchanged (as \"{{subst:...}}\"), since no substitution in wikitext is possible at the rendering stage. This feature can be exploited to control template behaviour (see § Making templates behave differently when transcluded or substituted). However, it may be inconvenient when a template is designed to be possible to transclude as well as substitute – in this case safesubst: can be used instead of subst: (see § The safesubst: modifier).\n"},{"TagName":"a","Data":"§ Making templates behave differently when transcluded or substituted"},{"TagName":"a","Data":"§ The safesubst: modifier"},{"TagName":"h3","Data":"The safesubst: modifier"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:SAFESUBST"},{"TagName":"p","Data":"The subst: modifier can be replaced by the alternative modifier safesubst:. The two have the same behaviour, except when they are encountered during non-substituted expansion (transclusion or direct viewing) of a template. In such a situation, the code {{subst:...}} remains unparsed, whereas the {{safesubst:...}} is treated as if no modifier were present – and so the subtemplate is transcluded or the variable or parser function evaluated.\n"},{"TagName":"p","Data":"Hence the safesubst: modifier is used in the code of templates which are designed to produce recursive substitution when substituted; but that are also intended to work when transcluded or simply to be viewed directly. Contrasted with using the subst: modifier, such templates would break in such cases of transclusion (and possibly on direct viewing).\n"},{"TagName":"p","Data":"For details on how to implement this (in particular, how to prevent the substitution from being performed as soon as the template code is saved), see § Recursive substitution.\n"},{"TagName":"a","Data":"§ Recursive substitution"},{"TagName":"h2","Data":"Recursive substitution"},{"TagName":"p","Data":"As mentioned above, substitution is not automatically recursive. So if a substituted template has code containing transclusions of other templates and parser functions, that code will be copied \"as is\" into the resulting wikitext – the transcluded items will not themselves be substituted.\n"},{"TagName":"p","Data":"To make substitution work recursively, you must include the subst: syntax in the code of the calling template. However, you cannot do this by simply typing \"subst:\" within the template, as the substitution would then be performed as soon as the template is saved. There are two ways to work around this problem:\n"},{"TagName":"p","Data":"To ensure that the template will still work as intended if it is transcluded instead of substituted, use safesubst: instead of subst:. This also applies if the template is also to be viewed directly, on its own page (although in this case, if the first of the above methods is used, plain subst: will still work, as the includeonly tags will cause the parser to ignore the subst: on direct viewing).\n"},{"TagName":"p","Data":"To see what a template will produce when fully expanded, without the need to explicitly substitute all subtemplates etc., the Special:ExpandTemplates tool can be used.\n"},{"TagName":"a","Data":"Special:ExpandTemplates"},{"TagName":"p","Data":"For more information, see the Recursive conversion of wikitext help page at Meta. See also Help:Calculation § Substitution, m:Template:Example table with computations, with optional substitution (backlinks edit), and the feature request at substall.\n"},{"TagName":"a","Data":"Recursive conversion of wikitext"},{"TagName":"a","Data":"Help:Calculation § Substitution"},{"TagName":"a","Data":"m:Template:Example table with computations, with optional substitution"},{"TagName":"a","Data":"backlinks"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"substall"},{"TagName":"h3","Data":"Recursive substitution in guided tours"},{"TagName":"p","Data":"Guided tours can make posts on behalf of users, such as automatically posting the contents of a wiki page onto a talk page. Unlike normal substitution or transclusion, however, this function of guided tours does not respect \u003cincludeonly\u003e...\u003c/includeonly\u003e and similar markup. To make recursive substitution work via guided tour posting, you can use the Delaying Template:subst method described on Meta.\n"},{"TagName":"a","Data":"Guided tours"},{"TagName":"a","Data":"Delaying Template:subst"},{"TagName":"h3","Data":"An example of recursion in action"},{"TagName":"p","Data":"This is an example using the actual Template:Like, and a hypothetical Template:Foo. You are attempting to include the Template:Foo, and indirectly the Template:Like, on a third page through transclusion and substitution. Template:Like displays this symbol:  Like\n"},{"TagName":"a","Data":"Template:Like"},{"TagName":"p","Data":"For example, let's say the Template:Foo contained the wikitext {{Like}}. If you then transclude it, using the wikitext {{Foo}}, this will transclude the Template:Like as you would expect. But if you use the wikitext {{subst:Foo}}, when you save it, you find the wikitext {{Like}} substituted rather than the wikitext of the page Template:Like. The substitution has not been recursive.\n"},{"TagName":"p","Data":"An example of recursion would be if the Template:Foo contained the wikitext {{{{{|safesubst:}}}Like}}. Now if you transclude it, using the wikitext {{Foo}}, this will transclude the Template:Like just as before. And if you save {{subst:Foo}} it will substitute the full actual wikitext of the Template:Like. You have therefore achieved recursive substitution.\n"},{"TagName":"h3","Data":"Further examples"},{"TagName":"p","Data":"Note: {{!}} substitutes to |.\n"},{"TagName":"p","Data":"Foo\n"},{"TagName":"p","Data":"yes\n"},{"TagName":"p","Data":"Substitution\n"},{"TagName":"p","Data":"yes\n"},{"TagName":"p","Data":"Substitution\n"},{"TagName":"p","Data":"yes\n"},{"TagName":"p","Data":"{{subst:PAGENAME}}\n"},{"TagName":"p","Data":"{{subst:#if: 1 | yes | no}}\n"},{"TagName":"p","Data":"{{subst:PAGENAME}}\n"},{"TagName":"p","Data":"{{subst:#if: 1 | yes | no}}\n"},{"TagName":"p","Data":"Substitution\n"},{"TagName":"p","Data":"yes\n"},{"TagName":"p","Data":"Foo\n"},{"TagName":"p","Data":"yes\n"},{"TagName":"p","Data":"Substitution\n"},{"TagName":"p","Data":"yes\n"},{"TagName":"p","Data":"Substitution\n"},{"TagName":"p","Data":"yes\n"},{"TagName":"h2","Data":"Making templates behave differently when transcluded or substituted"},{"TagName":"p","Data":"Sometimes it is desirable to make a template behave differently when substituted rather than when transcluded. A common trick for doing this is to use an expression like {{{{{subst|subst:}}}ns:0}}. This evaluates to the empty string if the template is being substituted (since the inner substitution takes effect, giving the prefix of namespace 0, which is empty), but to \"{{subst:ns:0}}\" if the template is being transcluded (since substitution cannot take place after transclusion).\n"},{"TagName":"a","Data":"namespace"},{"TagName":"p","Data":"A common application is in templates which are designed only to be substituted, to make them produce a warning if they are mistakenly transcluded instead. This is done in templates like {{prod}}, which are designed to produce a timestamp (e.g. for adding pages to dated categories), and will not be able to do this if transcluded.\n"},{"TagName":"a","Data":"prod"},{"TagName":"p","Data":"A template, {{issubst}}, has been created to simplify this. It returns \"yes\" if substitution is being performed, or the empty string otherwise. This can then be used as the parameter of a conditional parser function to make the template display a warning method if it is being transcluded, or to otherwise change the behaviour of a template depending on whether it is being transcluded or substituted.\n"},{"TagName":"a","Data":"issubst"},{"TagName":"h2","Data":"Documenting substitution"},{"TagName":"p","Data":"Usage of a template through subst: does not automatically show up in page histories. Therefore, providing the line of wikitext containing \"subst:\" in the edit summary is especially useful.\n"},{"TagName":"a","Data":"edit summary"},{"TagName":"p","Data":"Also, pages with a substituted template do not show up in backlinks, and the template does not appear in the list of transcluded templates on the edit page. The template could add pages to a category to track substitutions, but listing this category on a page may clutter the list of content-based categories the page is in. Also, comments outside noinclude tags are included in the wikitext. Thus a comment can be used to mention the template. Substitution of parameters does not work inside comments, but a workaround for this is to begin an intended comment with \u003c!\u003cnoinclude /\u003e-- so that it turns into a comment once transcluded.\n"},{"TagName":"h2","Data":"Limitation"},{"TagName":"p","Data":"Substitution is not available inside \u003cref\u003e...\u003c/ref\u003e and \u003cgallery\u003e...\u003c/gallery\u003e tags. If you write {{subst:foo}}, it is not substituted nor transcluded, but remains as-is (it's a known bug, see T4700 and gerrit:272916 for current status).\n"},{"TagName":"a","Data":"T4700"},{"TagName":"a","Data":"gerrit:272916"},{"TagName":"p","Data":"However it is possible to bypass this limitation by using the magic word #tag. If you write, for instance, {{safesubst:#tag:ref|content of the reference}}, the content of the reference will be substituted and the {{#tag:ref|...}} will be replaced with \u003cref\u003e...\u003c/ref\u003e. A more concrete example:\nIf you write for instance {{safesubst:#tag:ref|...Title=ExampleTitle|archivedate={{subst:TODAY}}|Edition=Hardcover...}}\nthen the software will perform substitutions on the text within the last field and the {{#tag:ref|...}} will be replaced with \u003cref\u003e...\u003c/ref\u003earound the altered text, and the reference will be saved with the substitution; it'll be saved as \"{{|...Title=ExampleTitle|archivedate=29 January 2016|Edition=Hardcover|...}}\" with \u003cref\u003e...\u003c/ref\u003e around it.\nIn other words, first the software will expand the templates and then place that expanded text within reference tags.\n"},{"TagName":"h2","Data":"Templates for substitution"},{"TagName":"a","Data":"require subst"},{"TagName":"a","Data":"issubst"},{"TagName":"a","Data":"ifsubst"},{"TagName":"a","Data":"magic word"},{"TagName":"h2","Data":"See also"},{"TagName":"a","Data":"Substitution for Dummies"},{"TagName":"a","Data":"m:Help:Substitution"},{"TagName":"a","Data":"mw:Help:ExpandTemplates"},{"TagName":"a","Data":"mw:Help:TemplateData"},{"TagName":"a","Data":"bugzilla:2003"},{"TagName":"a","Data":"m:Template:last edit"},{"TagName":"a","Data":"backlinks"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"last edit"},{"TagName":"a","Data":"m:Template:page history"},{"TagName":"a","Data":"backlinks"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"WikiProject Check Wikipedia § Template programming element"},{"TagName":"a","Data":"dead link"},{"TagName":"a","Data":"the last time this link worked"},{"TagName":"a","Data":"this tools page"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"Wikipedia templates"},{"TagName":"a","Data":"General"},{"TagName":"a","Data":"Cleanup"},{"TagName":"a","Data":"Verifiability and sources"},{"TagName":"a","Data":"Disputes"},{"TagName":"a","Data":"Hatnotes"},{"TagName":"a","Data":"Infoboxes"},{"TagName":"a","Data":"Links"},{"TagName":"a","Data":"External link templates"},{"TagName":"a","Data":"Linking country articles"},{"TagName":"a","Data":"Lists"},{"TagName":"a","Data":"Main page"},{"TagName":"a","Data":"Section"},{"TagName":"a","Data":"Sources of articles"},{"TagName":"a","Data":"Quick reference"},{"TagName":"a","Data":"Standard boxes"},{"TagName":"a","Data":"Stub types"},{"TagName":"a","Data":"Translation"},{"TagName":"a","Data":"Compact TOC"},{"TagName":"a","Data":"Category"},{"TagName":"a","Data":"File"},{"TagName":"a","Data":"Talk"},{"TagName":"a","Data":"Template"},{"TagName":"a","Data":"User"},{"TagName":"a","Data":"Userboxes"},{"TagName":"a","Data":"User talk"},{"TagName":"a","Data":"Wikipedia"},{"TagName":"a","Data":"WikiProject banners"},{"TagName":"a","Data":"Deletion"},{"TagName":"a","Data":"Speedy"},{"TagName":"a","Data":"Formatting"},{"TagName":"a","Data":"Maintenance"},{"TagName":"a","Data":"Merging"},{"TagName":"a","Data":"Moving"},{"TagName":"a","Data":"Requested"},{"TagName":"a","Data":"Navigation"},{"TagName":"a","Data":"Redirect pages"},{"TagName":"a","Data":"Functional index"},{"TagName":"a","Data":"Language codes"},{"TagName":"a","Data":"Splitting"},{"TagName":"a","Data":"Wikimedia sister projects"},{"TagName":"a","Data":"Archive"},{"TagName":"a","Data":"Articles for deletion"},{"TagName":"a","Data":"Birth, death and age"},{"TagName":"a","Data":"Button"},{"TagName":"a","Data":"Category header"},{"TagName":"a","Data":"Citation and verifiability"},{"TagName":"a","Data":"Citation Style 1"},{"TagName":"a","Data":"Deletion review"},{"TagName":"a","Data":"Editnotice"},{"TagName":"a","Data":"Hatnotes"},{"TagName":"a","Data":"Help desk"},{"TagName":"a","Data":"Inline cleanup"},{"TagName":"a","Data":"Introduction cleanup"},{"TagName":"a","Data":"IPA"},{"TagName":"a","Data":"Math"},{"TagName":"a","Data":"Notice and warnings"},{"TagName":"a","Data":"Organization infoboxes"},{"TagName":"a","Data":"Proposed article mergers"},{"TagName":"a","Data":"Protection"},{"TagName":"a","Data":"Quotation"},{"TagName":"a","Data":"Redirects"},{"TagName":"a","Data":"Search"},{"TagName":"a","Data":"Semantics"},{"TagName":"a","Data":"Speedy deletion"},{"TagName":"a","Data":"Notices"},{"TagName":"a","Data":"String-handling"},{"TagName":"a","Data":"Sup and sub-related"},{"TagName":"a","Data":"Top icon"},{"TagName":"a","Data":"Transwiki maintenance"},{"TagName":"a","Data":"Unicode"},{"TagName":"a","Data":"User talk pages"},{"TagName":"a","Data":"User noticeboard notices"},{"TagName":"a","Data":"Userboxes"},{"TagName":"a","Data":"User rights"},{"TagName":"a","Data":"Userspace linking"},{"TagName":"a","Data":"Userspace Disclaimers"},{"TagName":"a","Data":"Wikibreak"},{"TagName":"a","Data":"WikiLove"},{"TagName":"a","Data":"Wikipedia icons"},{"TagName":"a","Data":"Discussion icons"},{"TagName":"a","Data":"Comment icons"},{"TagName":"a","Data":"Emoji"},{"TagName":"a","Data":"Template documentation"},{"TagName":"a","Data":"Examples of templates"},{"TagName":"a","Data":"Maintenance template removal"},{"TagName":"a","Data":"Requested templates"},{"TagName":"a","Data":"WikiProject Templates"},{"TagName":"a","Data":"Template help"},{"TagName":"a","Data":"Template namespace"},{"TagName":"a","Data":"Category"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"Wikipedia help pages"},{"TagName":"a","Data":"Teahouse"},{"TagName":"a","Data":"Help desk"},{"TagName":"a","Data":"FAQs"},{"TagName":"a","Data":"Reference desks"},{"TagName":"a","Data":"Noticeboards"},{"TagName":"a","Data":"Cheatsheet"},{"TagName":"a","Data":"Directories"},{"TagName":"a","Data":"About Wikipedia"},{"TagName":"a","Data":"Administration"},{"TagName":"a","Data":"Purpose"},{"TagName":"a","Data":"Principles"},{"TagName":"a","Data":"Policies and guidelines"},{"TagName":"a","Data":"What Wikipedia is not"},{"TagName":"a","Data":"Disclaimer"},{"TagName":"a","Data":"parental advice"},{"TagName":"a","Data":"Making requests"},{"TagName":"a","Data":"Who writes Wikipedia?"},{"TagName":"a","Data":"Help for readers"},{"TagName":"a","Data":"FAQ"},{"TagName":"a","Data":"Books"},{"TagName":"a","Data":"Copyright"},{"TagName":"a","Data":"Glossary"},{"TagName":"a","Data":"Mobile access"},{"TagName":"a","Data":"Navigation"},{"TagName":"a","Data":"Other languages"},{"TagName":"a","Data":"Searching"},{"TagName":"a","Data":"Students"},{"TagName":"a","Data":"Viewing media"},{"TagName":"a","Data":"Contributingto Wikipedia"},{"TagName":"a","Data":"Advice for young editors"},{"TagName":"a","Data":"Avoiding common mistakes"},{"TagName":"a","Data":"Etiquette"},{"TagName":"a","Data":"Simplified Manual of Style"},{"TagName":"a","Data":"Simplified rule-set"},{"TagName":"a","Data":"\"Ignore all rules\""},{"TagName":"a","Data":"\"The rules are principles\""},{"TagName":"a","Data":"Style-tips"},{"TagName":"a","Data":"Tip of the day"},{"TagName":"a","Data":"Your first article"},{"TagName":"a","Data":"article wizard"},{"TagName":"a","Data":"Getting started"},{"TagName":"a","Data":"Why create an account?"},{"TagName":"a","Data":"Introductions by topic"},{"TagName":"a","Data":"Graphics tutorials"},{"TagName":"a","Data":"Picture tutorial"},{"TagName":"a","Data":"IRC (live chat) tutorial"},{"TagName":"a","Data":"VisualEditor user guide"},{"TagName":"a","Data":"Dos and don'ts"},{"TagName":"a","Data":"Accessibility"},{"TagName":"a","Data":"Biographies"},{"TagName":"a","Data":"Biographies (living)"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Discussions"},{"TagName":"a","Data":"Disambiguation"},{"TagName":"a","Data":"Images"},{"TagName":"a","Data":"Leads"},{"TagName":"a","Data":"Links"},{"TagName":"a","Data":"Lists"},{"TagName":"a","Data":"References"},{"TagName":"a","Data":"Tables"},{"TagName":"a","Data":"Titles (of articles)"},{"TagName":"a","Data":"How-to pages"},{"TagName":"a","Data":"information pages"},{"TagName":"a","Data":"Appealing blocks"},{"TagName":"a","Data":"Article deletion"},{"TagName":"a","Data":"Categories"},{"TagName":"a","Data":"Citations/references"},{"TagName":"a","Data":"Referencing for beginners"},{"TagName":"a","Data":"Citation Style 1"},{"TagName":"a","Data":"Cite errors"},{"TagName":"a","Data":"References and page numbers"},{"TagName":"a","Data":"Convert"},{"TagName":"a","Data":"Diff"},{"TagName":"a","Data":"Editing"},{"TagName":"a","Data":"Minor edit"},{"TagName":"a","Data":"toolbar"},{"TagName":"a","Data":"edit conflict"},{"TagName":"a","Data":"Find sources"},{"TagName":"a","Data":"Files"},{"TagName":"a","Data":"Footnotes"},{"TagName":"a","Data":"Image deletion"},{"TagName":"a","Data":"Infoboxes"},{"TagName":"a","Data":"Linking"},{"TagName":"a","Data":"link color"},{"TagName":"a","Data":"Logging in"},{"TagName":"a","Data":"Merging"},{"TagName":"a","Data":"Page name"},{"TagName":"a","Data":"Renaming pages"},{"TagName":"a","Data":"Redirect"},{"TagName":"a","Data":"Passwords"},{"TagName":"a","Data":"Email confirmation"},{"TagName":"a","Data":"Reverting"},{"TagName":"a","Data":"Simple vandalism cleanup"},{"TagName":"a","Data":"Talk pages"},{"TagName":"a","Data":"archiving"},{"TagName":"a","Data":"simple archiving"},{"TagName":"a","Data":"User contributions"},{"TagName":"a","Data":"WP search protocol"},{"TagName":"a","Data":"Coding"},{"TagName":"a","Data":"Wiki markup"},{"TagName":"a","Data":"Barcharts"},{"TagName":"a","Data":"Calculations"},{"TagName":"a","Data":"Characters"},{"TagName":"a","Data":"Columns"},{"TagName":"a","Data":"Elevation"},{"TagName":"a","Data":"Hidden text"},{"TagName":"a","Data":"HTML"},{"TagName":"a","Data":"Lists"},{"TagName":"a","Data":"Magic words"},{"TagName":"a","Data":"Music symbols"},{"TagName":"a","Data":"Sections"},{"TagName":"a","Data":"Sounds"},{"TagName":"a","Data":"Tables"},{"TagName":"a","Data":"Templates"},{"TagName":"a","Data":"Transclusion"},{"TagName":"a","Data":"URL"},{"TagName":"a","Data":"Visual files"},{"TagName":"a","Data":"Directories"},{"TagName":"a","Data":"Abbreviations"},{"TagName":"a","Data":"Contents"},{"TagName":"a","Data":"Departments"},{"TagName":"a","Data":"Editor's index"},{"TagName":"a","Data":"Essays"},{"TagName":"a","Data":"FAQs"},{"TagName":"a","Data":"Glossary"},{"TagName":"a","Data":"Guidelines"},{"TagName":"a","Data":"Manual of Style "},{"TagName":"a","Data":"Policies"},{"TagName":"a","Data":"Tasks"},{"TagName":"a","Data":"Tips"},{"TagName":"a","Data":"Tools"},{"TagName":"a","Data":"Missing Manual"},{"TagName":"a","Data":"Ask for help on your talk page"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"Wikipedia technical help"},{"TagName":"a","Data":"the Teahouse"},{"TagName":"a","Data":"help desk"},{"TagName":"a","Data":"village pump (technical)"},{"TagName":"a","Data":"talk pages"},{"TagName":"a","Data":"IRC"},{"TagName":"a","Data":"Generaltechnical help"},{"TagName":"a","Data":"Browser notes"},{"TagName":"a","Data":"Bypass cache"},{"TagName":"a","Data":"Keyboard shortcuts"},{"TagName":"a","Data":"Editing"},{"TagName":"a","Data":"CharInsert"},{"TagName":"a","Data":"Edit conflict"},{"TagName":"a","Data":"Edit toolbar"},{"TagName":"a","Data":"Reverting"},{"TagName":"a","Data":"How to create a page"},{"TagName":"a","Data":"IRC"},{"TagName":"a","Data":"Tutorial"},{"TagName":"a","Data":"Mobile access"},{"TagName":"a","Data":"Multilingual support"},{"TagName":"a","Data":"Page history"},{"TagName":"a","Data":"Page information"},{"TagName":"a","Data":"Page name"},{"TagName":"a","Data":"Help"},{"TagName":"a","Data":"Printing"},{"TagName":"a","Data":"Software notices"},{"TagName":"a","Data":"Editnotice"},{"TagName":"a","Data":"Special Characters"},{"TagName":"a","Data":"Entering"},{"TagName":"a","Data":"User access levels"},{"TagName":"a","Data":"VisualEditor"},{"TagName":"a","Data":"Help"},{"TagName":"a","Data":"Specialpage"},{"TagName":"a","Data":"Special page help"},{"TagName":"a","Data":"Edit filter"},{"TagName":"a","Data":"Emailing users"},{"TagName":"a","Data":"Logging in"},{"TagName":"a","Data":"Reset passwords"},{"TagName":"a","Data":"Logs"},{"TagName":"a","Data":"Moving a page"},{"TagName":"a","Data":"History merging"},{"TagName":"a","Data":"Non-admin and admin-only page moves"},{"TagName":"a","Data":"Notifications/Echo"},{"TagName":"a","Data":"FAQ"},{"TagName":"a","Data":"Page Curation"},{"TagName":"a","Data":"Page import"},{"TagName":"a","Data":"Pending changes"},{"TagName":"a","Data":"Random pages"},{"TagName":"a","Data":"Recent changes"},{"TagName":"a","Data":"Related changes"},{"TagName":"a","Data":"Searching"},{"TagName":"a","Data":"Linksearch"},{"TagName":"a","Data":"Tags"},{"TagName":"a","Data":"User contributions"},{"TagName":"a","Data":"Watchlist"},{"TagName":"a","Data":"What links here"},{"TagName":"a","Data":"Wikitext"},{"TagName":"a","Data":"Wikitext"},{"TagName":"a","Data":"Cheatsheet"},{"TagName":"a","Data":"Columns"},{"TagName":"a","Data":"Line-break handling"},{"TagName":"a","Data":"Lists"},{"TagName":"a","Data":"Magic words"},{"TagName":"a","Data":"For beginners"},{"TagName":"a","Data":"Conditional expressions"},{"TagName":"a","Data":"Switch parser function"},{"TagName":"a","Data":"Time function"},{"TagName":"a","Data":"Redirects"},{"TagName":"a","Data":"Sections and TOCs"},{"TagName":"a","Data":"Tables"},{"TagName":"a","Data":"Introduction"},{"TagName":"a","Data":"Basics"},{"TagName":"a","Data":"Advanced table formatting"},{"TagName":"a","Data":"Collapsing"},{"TagName":"a","Data":"Conditional tables"},{"TagName":"a","Data":"Sortable tables"},{"TagName":"a","Data":"Using colours"},{"TagName":"a","Data":"Links"},{"TagName":"a","Data":"diffs"},{"TagName":"a","Data":"Links"},{"TagName":"a","Data":"Interlanguage"},{"TagName":"a","Data":"Interwiki"},{"TagName":"a","Data":"Permanent"},{"TagName":"a","Data":"Diffs"},{"TagName":"a","Data":"Simplest diff guide"},{"TagName":"a","Data":"Simple diff and link guide"},{"TagName":"a","Data":"Complete diff and link guide"},{"TagName":"a","Data":"Colon trick"},{"TagName":"a","Data":"Link color"},{"TagName":"a","Data":"Pipe trick"},{"TagName":"a","Data":"URLs"},{"TagName":"a","Data":"Media"},{"TagName":"a","Data":"Media help"},{"TagName":"a","Data":"Files"},{"TagName":"a","Data":"Creation and usage"},{"TagName":"a","Data":"Moving files to Commons"},{"TagName":"a","Data":"Images"},{"TagName":"a","Data":"Introduction to images"},{"TagName":"a","Data":"Picture tutorial"},{"TagName":"a","Data":"Preparing images for upload"},{"TagName":"a","Data":"Uploading images"},{"TagName":"a","Data":"Options to hide an image"},{"TagName":"a","Data":"Extended image syntax"},{"TagName":"a","Data":"SVG help"},{"TagName":"a","Data":"Gallery tag"},{"TagName":"a","Data":"Graphics tutorials"},{"TagName":"a","Data":"Basic bitmap image editing"},{"TagName":"a","Data":"How to improve image quality"},{"TagName":"a","Data":"Graphics Lab resources"},{"TagName":"a","Data":"Sound file markup"},{"TagName":"a","Data":"Visual file markup"},{"TagName":"a","Data":"Family trees"},{"TagName":"a","Data":"Graphs and charts"},{"TagName":"a","Data":"How to create"},{"TagName":"a","Data":"Barcharts"},{"TagName":"a","Data":"To scale charts"},{"TagName":"a","Data":"Math formulas"},{"TagName":"a","Data":"Math symbols"},{"TagName":"a","Data":"Musical scores"},{"TagName":"a","Data":"Musical symbols"},{"TagName":"a","Data":"Timeline"},{"TagName":"a","Data":"EasyTimeline syntax"},{"TagName":"a","Data":"WikiHiero syntax"},{"TagName":"a","Data":"Templates"},{"TagName":"a","Data":"Lua"},{"TagName":"a","Data":"Templates"},{"TagName":"a","Data":"Advanced template coding"},{"TagName":"a","Data":"Template documentation"},{"TagName":"a","Data":"Template index"},{"TagName":"a","Data":"Template limits"},{"TagName":"a","Data":"Template sandbox and test cases"},{"TagName":"a","Data":"Citation templates"},{"TagName":"a","Data":"Lua help"},{"TagName":"a","Data":"Lua project"},{"TagName":"a","Data":"Resources"},{"TagName":"a","Data":"To do"},{"TagName":"a","Data":"Substitution"},{"TagName":"a","Data":"Purge"},{"TagName":"a","Data":"Job queue"},{"TagName":"a","Data":"Transclusion"},{"TagName":"a","Data":"Labeled section"},{"TagName":"a","Data":"Costs and benefits"},{"TagName":"a","Data":"Guide to Scribbling"},{"TagName":"a","Data":"Data structure"},{"TagName":"a","Data":"Namespaces"},{"TagName":"a","Data":"Main/Article"},{"TagName":"a","Data":"Category"},{"TagName":"a","Data":"Draft"},{"TagName":"a","Data":"File"},{"TagName":"a","Data":"File description page"},{"TagName":"a","Data":"Help"},{"TagName":"a","Data":"Portal"},{"TagName":"a","Data":"Project/Wikipedia"},{"TagName":"a","Data":"Talk"},{"TagName":"a","Data":"Archiving"},{"TagName":"a","Data":"Simple"},{"TagName":"a","Data":"Template"},{"TagName":"a","Data":"User"},{"TagName":"a","Data":"User page design"},{"TagName":"a","Data":"MediaWiki"},{"TagName":"a","Data":"Bug reports and feature requests"},{"TagName":"a","Data":"TimedMediaHandler extension"},{"TagName":"a","Data":"Module"},{"TagName":"a","Data":"Special"},{"TagName":"a","Data":"HTML"},{"TagName":"a","Data":"CSS"},{"TagName":"a","Data":"Cascading Style Sheets"},{"TagName":"a","Data":"HTML in wikitext"},{"TagName":"a","Data":"Catalogue of CSS classes"},{"TagName":"a","Data":"Common.js and common.css"},{"TagName":"a","Data":"User CSS for monospaced coding font"},{"TagName":"a","Data":"Classes in microformats"},{"TagName":"a","Data":"Markup validation"},{"TagName":"a","Data":"Span tags"},{"TagName":"a","Data":"Useful styles"},{"TagName":"a","Data":"Customisation"},{"TagName":"a","Data":"Preferences"},{"TagName":"a","Data":"Gadgets"},{"TagName":"a","Data":"Skins"},{"TagName":"a","Data":"Citation tools"},{"TagName":"a","Data":"Cleaning up vandalism tools"},{"TagName":"a","Data":"Customizing watchlists"},{"TagName":"a","Data":"Hide pages"},{"TagName":"a","Data":"IRC Scripts"},{"TagName":"a","Data":"User scripts"},{"TagName":"a","Data":"Guide"},{"TagName":"a","Data":"List"},{"TagName":"a","Data":"Techniques"},{"TagName":"a","Data":"User style"},{"TagName":"a","Data":"Tools"},{"TagName":"a","Data":"Alternative browsing"},{"TagName":"a","Data":"Browser tools"},{"TagName":"a","Data":"Editing tools"},{"TagName":"a","Data":"Navigation shortcuts"},{"TagName":"a","Data":"Optimum tool set"},{"TagName":"a","Data":"Wikimedia Cloud Services"},{"TagName":"a","Data":"Beta Features at MediaWiki"},{"TagName":"a","Data":"AfC helper script"},{"TagName":"a","Data":"AntiVandal"},{"TagName":"a","Data":"AutoWikiBrowser"},{"TagName":"a","Data":"Bots"},{"TagName":"a","Data":"Creating"},{"TagName":"a","Data":"history"},{"TagName":"a","Data":"HotCat"},{"TagName":"a","Data":"Huggle"},{"TagName":"a","Data":"Navigation popups"},{"TagName":"a","Data":"RedWarn"},{"TagName":"a","Data":"Twinkle"},{"TagName":"a","Data":"Ultraviolet"},{"TagName":"a","Data":"WPCleaner"},{"TagName":"a","Data":"igloo"},{"TagName":"a","Data":"STiki"},{"TagName":"a","Data":"Category:Wikipedia how-to"},{"TagName":"a","Data":"Category:Wikipedia information pages"},{"TagName":"a","Data":"Help pages"},{"TagName":"a","Data":"Administrators"},{"TagName":"a","Data":"Accessibility"},{"TagName":"a","Data":"Accounts"},{"TagName":"a","Data":"Bots"},{"TagName":"a","Data":"Referencing"},{"TagName":"a","Data":"Citation metadata"},{"TagName":"a","Data":"Templates"},{"TagName":"a","Data":"User scripts"}]