[{"TagName":"a","Data":"Wikipedia:WikiProject Politics"},{"TagName":"a","Data":"Wikipedia:WikiProject Poland"},{"TagName":"a","Data":"procedural policy"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:PG"},{"TagName":"a","Data":"WP:RULES"},{"TagName":"a","Data":"WP:POLICY"},{"TagName":"a","Data":"WP:GUIDELINE"},{"TagName":"a","Data":"Policies and guidelines"},{"TagName":"a","Data":"list"},{"TagName":"a","Data":"Principles"},{"TagName":"a","Data":"Five pillars"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"Content policies"},{"TagName":"a","Data":"Article titles"},{"TagName":"a","Data":"Biographies of living persons"},{"TagName":"a","Data":"Image use"},{"TagName":"a","Data":"Neutral point of view"},{"TagName":"a","Data":"No original research"},{"TagName":"a","Data":"Verifiability"},{"TagName":"a","Data":"What Wikipedia is not"},{"TagName":"a","Data":"Not a dictionary"},{"TagName":"a","Data":"Conduct policies"},{"TagName":"a","Data":"Civility"},{"TagName":"a","Data":"Clean start"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Edit warring"},{"TagName":"a","Data":"Editing policy"},{"TagName":"a","Data":"Harassment"},{"TagName":"a","Data":"No legal threats"},{"TagName":"a","Data":"No personal attacks"},{"TagName":"a","Data":"Ownership of content"},{"TagName":"a","Data":"Username policy"},{"TagName":"a","Data":"Vandalism"},{"TagName":"a","Data":"Deletion"},{"TagName":"a","Data":"Enforcement"},{"TagName":"a","Data":"Legal"},{"TagName":"a","Data":"Procedural"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"List of guidelines"},{"TagName":"a","Data":"Manual of Style contents"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"p","Data":"Wikipedia's policies and guidelines are developed by the community to describe best practices, clarify principles, resolve conflicts, and otherwise further our goal of creating a free, reliable encyclopedia. There is no need to read any policy or guideline pages to start editing. The five pillars are a popular summary of the most pertinent principles.\n"},{"TagName":"a","Data":"five pillars"},{"TagName":"p","Data":"Although Wikipedia generally does not employ hard-and-fast rules, Wikipedia's policy and guideline pages describe its principles and agreed-upon best practices. Policies are standards all users should normally follow, and guidelines are generally meant to be best practices for following those standards in specific contexts. Policies and guidelines should always be applied using reason and common sense.\n"},{"TagName":"a","Data":"does not employ hard-and-fast rules"},{"TagName":"a","Data":"common sense"},{"TagName":"p","Data":"This policy page specifies the community standards related to the organization, life cycle, maintenance of, and adherence to policies, guidelines, and related pages of the English Wikipedia. It does not cover other editions of Wikipedia. .mw-parser-output div.crossreference{padding-left:0}(See Wikipedia:List of policies and Wikipedia:List of guidelines for a comprehensive listing of individual English Wikipedia policies and guidelines.)\n"},{"TagName":"a","Data":"English Wikipedia"},{"TagName":"a","Data":"Wikipedia:List of policies"},{"TagName":"a","Data":"Wikipedia:List of guidelines"},{"TagName":"h2","Data":"Derivation"},{"TagName":"a","Data":"Wikipedia:Administration § Human and legal administration"},{"TagName":"p","Data":"Wikipedia is operated by the not-for-profit Wikimedia Foundation, which reserves certain legal rights—see the Wikimedia Foundation's Policies page for a list of its policies. See also Role of Jimmy Wales. Nevertheless, normally Wikipedia is a self-governing project run by its community. Its policies and guidelines are intended to reflect the consensus of the community.\n"},{"TagName":"a","Data":"Wikimedia Foundation"},{"TagName":"a","Data":"the Wikimedia Foundation's Policies page"},{"TagName":"a","Data":"Role of Jimmy Wales"},{"TagName":"a","Data":"consensus"},{"TagName":"h2","Data":"Role"},{"TagName":"a","Data":"Wikipedia:The difference between policies, guidelines and essays"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:POLICIES"},{"TagName":"a","Data":"WP:GUIDES"},{"TagName":"p","Data":"\n"},{"TagName":"p","Data":"Policies have wide acceptance among editors and describe standards all users should normally follow. All policy pages are in Wikipedia:List of policies and guidelines and Category:Wikipedia policies. For summaries of key policies, see also List of policies.\n"},{"TagName":"a","Data":"normally"},{"TagName":"a","Data":"Wikipedia:List of policies and guidelines"},{"TagName":"a","Data":"Category:Wikipedia policies"},{"TagName":"a","Data":"List of policies"},{"TagName":"p","Data":"Guidelines are sets of best practices supported by consensus. Editors should attempt to follow guidelines, though they are best treated with common sense, and occasional exceptions may apply. Guideline pages can be found in Wikipedia:List of policies and guidelines and Category:Wikipedia guidelines. For summaries of key guidelines, see also List of guidelines.\n"},{"TagName":"a","Data":"Wikipedia:List of policies and guidelines"},{"TagName":"a","Data":"Category:Wikipedia guidelines"},{"TagName":"a","Data":"List of guidelines"},{"TagName":"p","Data":"Essays are the opinion or advice of an editor or group of editors for which widespread consensus has not been established. They do not speak for the entire community and may be created and written without approval. Essays the author does not want others to edit, or that contradict widespread consensus, belong in the user namespace. (For more information, see Wikipedia:Essays.)\n"},{"TagName":"a","Data":"user namespace"},{"TagName":"a","Data":"Wikipedia:Essays"},{"TagName":"p","Data":"Other administration pages in the project namespace include:\n"},{"TagName":"a","Data":"administration pages"},{"TagName":"a","Data":"project namespace"},{"TagName":"a","Data":"Wikipedia:Articles for deletion"},{"TagName":"a","Data":"WikiProject"},{"TagName":"a","Data":"essays they have written to give advice to other editors"},{"TagName":"a","Data":"How-to"},{"TagName":"a","Data":"Help namespace"},{"TagName":"a","Data":"Information pages"},{"TagName":"a","Data":"Supplements"},{"TagName":"a","Data":"Community discussion pages"},{"TagName":"a","Data":"noticeboards"},{"TagName":"a","Data":"[1]"},{"TagName":"p","Data":"These other pages are not policies or guidelines, although they may contain valuable advice or information.\n"},{"TagName":"h2","Data":"Adherence"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:ADHERENCE"},{"TagName":"p","Data":"Use common sense in interpreting and applying policies and guidelines; rules have occasional exceptions. However, those who violate the spirit of a rule may be reprimanded or sanctioned even if they do not technically break the rule.\n"},{"TagName":"a","Data":"Use common sense"},{"TagName":"a","Data":"occasional exceptions"},{"TagName":"p","Data":"Whether a policy or guideline is an accurate description of best practice is determined through consensus.\n"},{"TagName":"a","Data":"consensus"},{"TagName":"p","Data":"On discussion pages and in edit summaries, shortcuts are often used to refer to policies and guidelines. (For example, WP:NOR (no original research), WP:NPOV (neutral point of view) and WP:BLP (biographies of living persons)). Similar shortcuts are also used for other types of project pages like essays and how-to guides. Thus a shortcut does not necessarily imply the linked page has policy or guideline status or has been widely accepted by the community. Additionally, the shortcut is not the policy; the plain-English definition of the page's title or shortcut may be importantly different from the linked page.\n"},{"TagName":"a","Data":"shortcuts"},{"TagName":"a","Data":"WP:NOR"},{"TagName":"a","Data":"WP:NPOV"},{"TagName":"a","Data":"WP:BLP"},{"TagName":"a","Data":"the shortcut is not the policy"},{"TagName":"h2","Data":"Enforcement"},{"TagName":"a","Data":"Wikipedia:Enforcement policies"},{"TagName":"a","Data":"Wikipedia:Active sanctions"},{"TagName":"a","Data":"Wikipedia:Arbitration enforcement"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:ENFORCEMENT"},{"TagName":"a","Data":"WP:ENFORCE"},{"TagName":"p","Data":"Enforcement on Wikipedia is similar to other social interactions. If an editor violates the community standards described in policies and guidelines, other editors can persuade the person to adhere to acceptable norms of conduct, over time resorting to more forceful means, such as administrator and steward actions. In the case of gross violations of community norms, they are likely to resort to more forceful means fairly rapidly. Going against the principles set out on these pages, particularly policy pages, is unlikely to prove acceptable, although it may be possible to convince fellow editors an exception ought to be made. This means individual editors (including you) enforce and apply policies and guidelines.\n"},{"TagName":"a","Data":"acceptable norms of conduct"},{"TagName":"a","Data":"administrator"},{"TagName":"a","Data":"steward"},{"TagName":"a","Data":"an exception ought to be made"},{"TagName":"p","Data":"In cases where it is clear a user is acting against policy (or against a guideline in a way that conflicts with policy), especially if they are doing so intentionally and persistently, that user may be temporarily or indefinitely blocked from editing by an administrator. In cases where the general dispute resolution procedure has been ineffective, the Arbitration Committee has the power to deal with highly disruptive or sensitive situations.\n"},{"TagName":"a","Data":"blocked"},{"TagName":"a","Data":"dispute resolution"},{"TagName":"a","Data":"Arbitration Committee"},{"TagName":"h2","Data":"­Content"},{"TagName":"a","Data":"Wikipedia:Avoid instruction creep"},{"TagName":"p","Data":"Policy and guideline pages should:\n"},{"TagName":"h2","Data":"Not part of the encyclopedia"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:NOTPART"},{"TagName":"a","Data":"Wikipedia:Project namespace § Content"},{"TagName":"p","Data":"Wikipedia has many policies and guidelines about encyclopedic content. These standards require verifiability, neutrality, respect for living people, and more.\n"},{"TagName":"a","Data":"content"},{"TagName":"p","Data":"The policies, guidelines, and process pages themselves are not part of the encyclopedia proper. Consequently, they do not generally need to conform to the same content standards or style conventions as articles. It is therefore not necessary to provide reliable sources to verify Wikipedia's administrative pages, or to phrase Wikipedia procedures or principles in a neutral manner, or to cite an outside authority in determining Wikipedia's editorial practices. Instead, the content of these pages is controlled by community-wide consensus, and the style should emphasize clarity, directness, and usefulness to other editors.[2]\n"},{"TagName":"a","Data":"content standards"},{"TagName":"a","Data":"style conventions"},{"TagName":"a","Data":"reliable sources"},{"TagName":"a","Data":"verify"},{"TagName":"a","Data":"neutral"},{"TagName":"a","Data":"cite an outside authority"},{"TagName":"a","Data":"community-wide consensus"},{"TagName":"a","Data":"[2]"},{"TagName":"p","Data":"These pages do, however, need to comply with Wikipedia's legal and behavioral policies, as well as policies applicable to non-content pages. For example, editors may not violate copyrights anywhere on Wikipedia, and edit warring is prohibited everywhere, not merely in encyclopedia articles.\n"},{"TagName":"h2","Data":"Life cycle"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:PGLIFE"},{"TagName":"p","Data":"Many of the most well-established policies and guidelines have developed from principles that have been accepted as fundamental since Wikipedia's inception. Others developed as solutions to common problems and disruptive editing. Policy and guideline pages are seldom established without precedent[3] and always require strong community support. Policies and guidelines may be established through new proposals, promotion of existing essays or guidelines, and reorganization of existing policies and guidelines through splitting and merging.\n"},{"TagName":"a","Data":"[3]"},{"TagName":"p","Data":"Essays and information pages may be established by writing them and adding {{essay}}, {{Information page}}, {{Wikipedia how-to}}, or a similar template to the page.\n"},{"TagName":"a","Data":"essay"},{"TagName":"a","Data":"Information page"},{"TagName":"a","Data":"Wikipedia how-to"},{"TagName":"a","Data":"a similar template"},{"TagName":"p","Data":"Current policy and guideline proposals can be found in Category:Wikipedia proposals, and failed proposals can be found in Category:Wikipedia failed proposals. All editors are welcome to comment on these proposals.\n"},{"TagName":"a","Data":"Category:Wikipedia proposals"},{"TagName":"a","Data":"Category:Wikipedia failed proposals"},{"TagName":"h3","Data":"Proposals"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:PROPOSAL"},{"TagName":"a","Data":"Wikipedia:How to contribute to Wikipedia guidance"},{"TagName":"a","Data":"Wikipedia:Proposed deletion"},{"TagName":"a","Data":"Wikipedia:Deletion requests"},{"TagName":"a","Data":"Wikipedia:Polling is not a substitute for discussion § Policy and guidelines"},{"TagName":"a","Data":"Wikipedia:What Wikipedia is not § Wikipedia is not a bureaucracy"},{"TagName":"p","Data":"Proposals for new guidelines and policies require discussion and a high level of consensus from the entire community for promotion to guideline or policy status. Adding the {{policy}} template to a page without the required consensus does not mean the page is policy, even if the page summarizes or copies policy. Most commonly, a new policy or guideline documents existing practices, rather than proposing a change to what experienced editors already choose to do. \n"},{"TagName":"a","Data":"high level of consensus"},{"TagName":"a","Data":"policy"},{"TagName":"h4","Data":"Good practice for proposals"},{"TagName":"p","Data":"One path for proposals is developing them through steps of\n"},{"TagName":"a","Data":"brainstorming"},{"TagName":"a","Data":"draft proposal"},{"TagName":"a","Data":"proposal"},{"TagName":"a","Data":"policy"},{"TagName":"a","Data":"guideline"},{"TagName":"p","Data":"The first step is to write the best initial proposal you can. Authors can request early-stage feedback at Wikipedia's village pump for idea incubation and from any relevant WikiProjects. Amendments to a proposal can be discussed on its talk page. It is crucial to improve a proposal in response to feedback received from outside editors. Consensus is built through a process of listening to and discussing the proposal with many other editors.\n"},{"TagName":"a","Data":"Wikipedia's village pump for idea incubation"},{"TagName":"p","Data":"Once you think the initial proposal is well written, and the issues involved have been sufficiently discussed among early participants to create a proposal that has a solid chance of success with the broader community, start a request for comment (RfC) about your policy or guideline proposal in a new section on the proposal's talk page.  Include the {{rfc|policy}} tag, along with a brief, time-stamped explanation of the proposal. Then, if you want, you can provide a detailed explanation of what the page does and why you think it should be a policy or guideline. The {{Proposal}} template should be placed at the top of the proposed page; this tag will get the proposal properly categorized.\n"},{"TagName":"a","Data":"request for comment"},{"TagName":"a","Data":"rfc"},{"TagName":"a","Data":"Proposal"},{"TagName":"p","Data":"The RfC should typically be announced at the policy and/or proposals village pumps, and you should notify other potentially interested groups. If your proposal affects a specific content area, then related WikiProjects can be found at the WikiProject directory. If your proposal relates to an existing policy or guideline, then leave a note on the talk page of the related policy or guideline. For example, proposed style guidelines should be announced at Wikipedia talk:Manual of Style, which is the main guideline for style issues. Try to identify the subcategory of guideline or policy (see {{Subcat guideline}} template). Proposals involving contentious subjects or wide-ranging effects should normally be listed on Wikipedia:Centralized discussion for the duration of the RfC. Rarely, a particularly important proposal may be advertised via a watchlist notice; sitenotices (which are displayed to all readers, not just to active editors) are not used for proposals. RfCs for policy and guideline proposals are normally left open for at least a week or sometimes a couple of months.\n"},{"TagName":"a","Data":"policy"},{"TagName":"a","Data":"proposals"},{"TagName":"a","Data":"WikiProject directory"},{"TagName":"a","Data":"Wikipedia talk:Manual of Style"},{"TagName":"a","Data":"Subcat guideline"},{"TagName":"a","Data":"Wikipedia:Centralized discussion"},{"TagName":"a","Data":"watchlist notice"},{"TagName":"p","Data":"To avoid later complaints about insufficient notice, it may be helpful to provide a complete list of the groups or pages you used to advertise the proposal on the talk page. Be careful not to canvass, and avoid non-neutral wording.\n"},{"TagName":"a","Data":"canvass"},{"TagName":"p","Data":"Editors should respond to proposals in a way that helps identify and build consensus. Explain your thoughts, ask questions, and raise concerns. Many editors begin their responses with bold-font 'vote' of support or opposition to make evaluation easier.\n"},{"TagName":"p","Data":"Closing a discussion requires careful evaluation of the responses to determine the consensus. This does not require the intervention of an administrator; it may be done by any sufficiently experienced impartial editor, not involved in the discussion, who is familiar with all policies and guidelines related to the proposal. The following points are important in evaluating consensus:\n"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Polling is not a substitute for discussion"},{"TagName":"p","Data":"Discussion may be closed as one of: Promote, No consensus, or Failed. Please leave a short note about the conclusion you came to. Update the proposal to reflect the consensus. Remove the {{Proposal}} template and replace it with another appropriate template, such as {{Subcat guideline}}, {{Policy}}, {{Supplement}}, {{essay}}, or {{Failed proposal}}. See Wikipedia namespace templates for a listing of banners.\n"},{"TagName":"a","Data":"Proposal"},{"TagName":"a","Data":"Subcat guideline"},{"TagName":"a","Data":"Policy"},{"TagName":"a","Data":"Supplement"},{"TagName":"a","Data":"essay"},{"TagName":"a","Data":"Failed proposal"},{"TagName":"a","Data":"Wikipedia namespace templates"},{"TagName":"p","Data":"If a proposal fails, the failed tag should not usually be removed. It is typically more productive to rewrite a failed proposal from scratch to address problems or seek consensus to integrate uncontroversial aspects of it into existing pages, rather than to re-nominate a proposal.\n"},{"TagName":"h3","Data":"Demotion"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:HISTORICAL"},{"TagName":"a","Data":"Wikipedia:Project namespace § Deletion of project pages"},{"TagName":"a","Data":"Wikipedia:Project namespace § Historical pages"},{"TagName":"p","Data":"An accepted policy or guideline may become obsolete because of changes in editorial practice or community standards, may become redundant because of improvements to other pages, or may represent unwarranted instruction creep. In such situations editors may propose that a policy be demoted to a guideline, or that a policy or guideline be demoted to a supplement, informational page, essay or historical page. In certain cases, a policy or guideline may be superseded, in which case the old page is marked and retained for historical interest.\n"},{"TagName":"a","Data":"instruction creep"},{"TagName":"a","Data":"supplement"},{"TagName":"a","Data":"informational page"},{"TagName":"a","Data":"essay"},{"TagName":"a","Data":"historical"},{"TagName":"a","Data":"superseded"},{"TagName":"p","Data":"The process for demotion is similar to promotion. A talk page discussion is typically started, the {{Under discussion|status|Discussion Title}} template is added to the top of the project page, and community input is solicited. After a reasonable amount of time for comments, an independent editor should close the discussion and evaluate the discussion and determine whether a consensus has formed to change the status.\n"},{"TagName":"a","Data":"Under discussion"},{"TagName":"p","Data":"The {{Disputed tag}} template is typically used instead of {{Under discussion}} for claims that a page was recently assigned guideline or policy status without proper or sufficient consensus being established.\n"},{"TagName":"a","Data":"Disputed tag"},{"TagName":"a","Data":"Under discussion"},{"TagName":"p","Data":"Essays, information pages, and other informal pages that are supported by only a small minority of the community are typically moved to the primary author's userspace. These discussions typically happen on the page's talk page, sometimes with an RfC, but they have at times also been conducted at Miscellany for deletion (despite the MFD guidelines explicitly discouraging this practice). Other pages are retained for historical reference and are marked as such.\n"},{"TagName":"a","Data":"Miscellany for deletion"},{"TagName":"h3","Data":"Content changes"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:PGCHANGE"},{"TagName":"a","Data":"Wikipedia:Policy writing is hard"},{"TagName":"p","Data":"Policies and guidelines can be edited like any other Wikipedia page. It is not strictly necessary to discuss changes or to obtain written documentation of a consensus in advance. However, because policies and guidelines are sensitive and complex, users should take care over any edits, to be sure they are faithfully reflecting the community's view and to be sure they are not accidentally introducing new sources of error or confusion.\n"},{"TagName":"p","Data":"Keep in mind that the purpose of policies and guidelines is to state what most Wikipedians agree upon, and should be phrased to reflect the present consensus on a subject. Editing a policy/guideline/essay page does not in itself imply an immediate change to accepted practice. It is, naturally, bad practice to recommend a rejected practice on a policy or guideline page.\n"},{"TagName":"a","Data":"consensus"},{"TagName":"p","Data":"As explained below, you may update best practices by editing boldly or by working toward widespread consensus for your change through discussion.\n"},{"TagName":"h4","Data":"Substantive changes"},{"TagName":"a","Data":"Wikipedia:Be bold § Wikipedia namespace"},{"TagName":"p","Data":"Implement. Before making substantive changes to policy and guideline pages, it is sometimes useful to try to establish a reasonable exception to the existing practice. To try to update the existing best practices this way, you may directly deviate from the established practice following the WP:IGNORE and WP:BOLD principles and make the change to mainspace pages. After some time, if there are no objections to the change and/or if a widespread consensus for your change or implementation is reached through discussion, you can then edit policy and guideline pages describing the practice to reflect the new situation.\n"},{"TagName":"a","Data":"WP:IGNORE"},{"TagName":"a","Data":"WP:BOLD"},{"TagName":"a","Data":"mainspace"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:TALKFIRST"},{"TagName":"p","Data":"Talk first. Talk page discussion typically precedes substantive changes to a policy. Changes may be made if there are no objections or if the discussion shows there is consensus for the change. Minor edits to improve formatting, grammar, and clarity may be made at any time.\n"},{"TagName":"p","Data":"If the result of discussions is unclear, then it should be evaluated by an administrator or other independent editor, as in the proposal process. Major changes should also be publicized to the community in general; announcements similar to the proposal process may be appropriate.\n"},{"TagName":"p","Data":"If wider input on a proposed change is desired, it may be useful to mark the section with the tag {{Under discussion|section|talk=Discussion Title}}. (If the proposal relates to a single statement, use {{Under discussion inline|Discussion Title}} immediately after it.)\n"},{"TagName":"a","Data":"Under discussion"},{"TagName":"a","Data":"Under discussion inline"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:PGBOLD"},{"TagName":"p","Data":"\n"},{"TagName":"p","Data":"Or be bold. Although most editors find prior discussion helpful, especially at well-developed pages, directly editing these pages is permitted by Wikipedia's policies. Consequently, you should not remove any change solely on the grounds that there was no formal discussion indicating consensus for the change before it was made. Instead, you should give a substantive reason for challenging it either in your edit summary or on the talk page.\n"},{"TagName":"a","Data":"directly editing these pages is permitted by Wikipedia's policies"},{"TagName":"a","Data":"edit summary"},{"TagName":"p","Data":"Bold editors of policy and guideline pages are strongly encouraged to follow WP:1RR or WP:0RR standards. Editing a policy to support your own argument in an active discussion may be seen as gaming the system, especially if you do not disclose your involvement in the argument when making the edits.\n"},{"TagName":"a","Data":"Bold"},{"TagName":"a","Data":"WP:1RR"},{"TagName":"a","Data":"WP:0RR"},{"TagName":"a","Data":"gaming the system"},{"TagName":"h3","Data":"Conflicts between advice pages"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:POLCON"},{"TagName":"a","Data":"Wikipedia:Content forking/Internal § Policy forks"},{"TagName":"p","Data":"If policy and/or guideline pages directly conflict, one or more pages need to be revised to resolve the conflict so all the conflicting pages accurately reflect the community's actual practices and best advice. As a temporary measure during that resolution process, if a guideline appears to conflict with a policy, editors may assume the policy takes precedence.\n"},{"TagName":"p","Data":"More commonly, advice pages do not directly conflict, but provide multiple options. For example, Wikipedia:Reliable sources says newspaper articles are generally considered to be reliable sources, and Wikipedia:Identifying reliable sources (medicine) recommends against newspaper articles for certain technical purposes. Editors must use their best judgement to decide which advice is most appropriate and relevant to the specific situation at hand.\n"},{"TagName":"a","Data":"Wikipedia:Reliable sources"},{"TagName":"a","Data":"Wikipedia:Identifying reliable sources (medicine)"},{"TagName":"h2","Data":"Naming"},{"TagName":"p","Data":"The page names of policies and guidelines usually do not include the words \"policy\" or \"guideline\", unless required to distinguish the page from another.\n"},{"TagName":"h2","Data":"See also"},{"TagName":"a","Data":"Criticism of Wikipedia § Excessive rule-making"},{"TagName":"a","Data":"Wikipedia:List of policies and guidelines"},{"TagName":"a","Data":"Wikipedia:Requests for comment/Wikipedia policies and guidelines"},{"TagName":"a","Data":"Wikipedia:Requests for comment"},{"TagName":"a","Data":"Wikipedia:Centralized discussion"},{"TagName":"a","Data":"Wikipedia:Perennial proposals"},{"TagName":"a","Data":"Wikipedia:Product, process, policy"},{"TagName":"a","Data":"Help:Introduction to policies and guidelines"},{"TagName":"a","Data":"Wikipedia:Principles"},{"TagName":"a","Data":"Wikipedia:Simplified ruleset"},{"TagName":"a","Data":"Wikipedia:Wikimedia proposals"},{"TagName":"h2","Data":"Notes"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"Meta's essay category"},{"TagName":"a","Data":"Meta-Wiki"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"Office declarations"},{"TagName":"h2","Data":"Further reading"},{"TagName":"a","Data":"Mission statement"},{"TagName":"a","Data":"Wikimedia values"},{"TagName":"a","Data":"Wikimedia founding principles"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"policies and guidelines"},{"TagName":"a","Data":"Five pillars"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"Verifiability"},{"TagName":"a","Data":"No original research"},{"TagName":"a","Data":"Neutral point of view"},{"TagName":"a","Data":"What Wikipedia is not"},{"TagName":"a","Data":"Biographies of living persons"},{"TagName":"a","Data":"Copyright"},{"TagName":"a","Data":"Copyright violations"},{"TagName":"a","Data":"Image use"},{"TagName":"a","Data":"Article titles"},{"TagName":"a","Data":"Notability"},{"TagName":"a","Data":"Autobiography"},{"TagName":"a","Data":"Citing sources"},{"TagName":"a","Data":"Reliable sources"},{"TagName":"a","Data":"Medicine"},{"TagName":"a","Data":"Do not include copies of lengthy primary sources"},{"TagName":"a","Data":"Plagiarism"},{"TagName":"a","Data":"Don't create hoaxes"},{"TagName":"a","Data":"Fringe theories"},{"TagName":"a","Data":"Patent nonsense"},{"TagName":"a","Data":"External links"},{"TagName":"a","Data":"Civility"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Harassment"},{"TagName":"a","Data":"Vandalism"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"No personal attacks"},{"TagName":"a","Data":"Ownership of content"},{"TagName":"a","Data":"Edit warring"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"No legal threats"},{"TagName":"a","Data":"Child protection"},{"TagName":"a","Data":"Paid-contribution disclosure"},{"TagName":"a","Data":"Assume good faith"},{"TagName":"a","Data":"Conflict of interest"},{"TagName":"a","Data":"Disruptive editing"},{"TagName":"a","Data":"Do not disrupt Wikipedia to illustrate a point"},{"TagName":"a","Data":"Etiquette"},{"TagName":"a","Data":"Gaming the system"},{"TagName":"a","Data":"Please do not bite the newcomers"},{"TagName":"a","Data":"Courtesy vanishing"},{"TagName":"a","Data":"Responding to threats of harm"},{"TagName":"a","Data":"Talk page guidelines"},{"TagName":"a","Data":"Signatures"},{"TagName":"a","Data":"Deletion policy"},{"TagName":"a","Data":"Proposed deletion"},{"TagName":"a","Data":"Biographies"},{"TagName":"a","Data":"Criteria for speedy deletion"},{"TagName":"a","Data":"Attack page"},{"TagName":"a","Data":"Oversight"},{"TagName":"a","Data":"Revision deletion"},{"TagName":"a","Data":"Administrators"},{"TagName":"a","Data":"Banning"},{"TagName":"a","Data":"Blocking"},{"TagName":"a","Data":"Page protection"},{"TagName":"a","Data":"Editing policy"},{"TagName":"a","Data":"Article size"},{"TagName":"a","Data":"Summary style"},{"TagName":"a","Data":"Be bold"},{"TagName":"a","Data":"Disambiguation"},{"TagName":"a","Data":"Hatnotes"},{"TagName":"a","Data":"Broad-concept article"},{"TagName":"a","Data":"Understandability"},{"TagName":"a","Data":"Manual of Style"},{"TagName":"a","Data":"Contents"},{"TagName":"a","Data":"Accessibility"},{"TagName":"a","Data":"Dates and numbers"},{"TagName":"a","Data":"Images"},{"TagName":"a","Data":"Layout"},{"TagName":"a","Data":"Lead section"},{"TagName":"a","Data":"Linking"},{"TagName":"a","Data":"Lists"},{"TagName":"a","Data":"Categories, lists, and navigation templates"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Template namespace"},{"TagName":"a","Data":"Project namespace"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"User pages"},{"TagName":"a","Data":"User boxes"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"Subpages"},{"TagName":"a","Data":"Terms of Use"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"Friendly space policy"},{"TagName":"a","Data":"Licensing and copyright"},{"TagName":"a","Data":"Privacy policy"},{"TagName":"a","Data":"List of all policies and guidelines"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"List of guidelines"},{"TagName":"a","Data":"Summaries of values and principles"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"accounts"},{"TagName":"a","Data":"governance"},{"TagName":"a","Data":"Unregistered (IP) users"},{"TagName":"a","Data":"Why create an account?"},{"TagName":"a","Data":"Create an account"},{"TagName":"a","Data":"Request an account"},{"TagName":"a","Data":"IPs are human too"},{"TagName":"a","Data":"IP addresses are not people"},{"TagName":"a","Data":"IP hopper"},{"TagName":"a","Data":"New account"},{"TagName":"a","Data":"Logging in"},{"TagName":"a","Data":"Reset passwords"},{"TagName":"a","Data":"Username policy"},{"TagName":"a","Data":"Changing username"},{"TagName":"a","Data":"Usernames for administrator attention"},{"TagName":"a","Data":"Unified login or SUL"},{"TagName":"a","Data":"Alternate account"},{"TagName":"a","Data":"Password strength requirements"},{"TagName":"a","Data":"User account security"},{"TagName":"a","Data":"Personal security practices"},{"TagName":"a","Data":"Two-factor authentication"},{"TagName":"a","Data":"2FA for AWB"},{"TagName":"a","Data":"Committed identity"},{"TagName":"a","Data":"On privacy, confidentiality and discretion"},{"TagName":"a","Data":"Compromised accounts"},{"TagName":"a","Data":"How to not get outed"},{"TagName":"a","Data":"Blocking policy"},{"TagName":"a","Data":"FAQ"},{"TagName":"a","Data":"Admin's guide"},{"TagName":"a","Data":"Tools"},{"TagName":"a","Data":"Autoblock"},{"TagName":"a","Data":"Appealing a block"},{"TagName":"a","Data":"Guide to appealing blocks"},{"TagName":"a","Data":"UTRS Unblock Ticket Request System"},{"TagName":"a","Data":"Blocking IP addresses"},{"TagName":"a","Data":"Range blocks"},{"TagName":"a","Data":"IPv6"},{"TagName":"a","Data":"Open proxies"},{"TagName":"a","Data":"Banning policy"},{"TagName":"a","Data":"ArbCom appeals"},{"TagName":"a","Data":"Sanctions"},{"TagName":"a","Data":"Personal sanctions"},{"TagName":"a","Data":"General sanctions"},{"TagName":"a","Data":"Contentious topics"},{"TagName":"a","Data":"Log"},{"TagName":"a","Data":"Essay"},{"TagName":"a","Data":"Long-term abuse"},{"TagName":"a","Data":"Standard offer"},{"TagName":"a","Data":"Global actions"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"Single-purpose account"},{"TagName":"a","Data":"Sleeper account"},{"TagName":"a","Data":"Vandalism-only account"},{"TagName":"a","Data":"Wikibreak"},{"TagName":"a","Data":"Enforcer"},{"TagName":"a","Data":"Retiring"},{"TagName":"a","Data":"Courtesy vanishing"},{"TagName":"a","Data":"Clean start"},{"TagName":"a","Data":"Quiet return"},{"TagName":"a","Data":"User groups"},{"TagName":"a","Data":"global user groups"},{"TagName":"a","Data":"Requests for permissions"},{"TagName":"a","Data":"Admin instructions"},{"TagName":"a","Data":"Admin guide"},{"TagName":"a","Data":"Account creator"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"(Auto) confirmed"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Autopatrolled"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"AutoWikiBrowser"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Bot"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Edit filter helper"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Event coordinator"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Extended confirmed"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"File mover"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"IP block exempt"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Mass message sender"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"New page reviewer"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Page mover"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Pending changes reviewer"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Rollback"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Template editor"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Global rights policy"},{"TagName":"a","Data":"Volunteer Response Team"},{"TagName":"a","Data":"Administrator"},{"TagName":"a","Data":"RfA"},{"TagName":"a","Data":"Bureaucrat"},{"TagName":"a","Data":"RfB"},{"TagName":"a","Data":"CheckUser"},{"TagName":"a","Data":"Oversight"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Edit filter manager"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Interface administrator"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Founder"},{"TagName":"a","Data":"Importer"},{"TagName":"a","Data":"Researcher"},{"TagName":"a","Data":"Committees"},{"TagName":"a","Data":"Arbitration Committee"},{"TagName":"a","Data":"Bot approvals group"},{"TagName":"a","Data":"Functionaries"},{"TagName":"a","Data":"SPI clerks"},{"TagName":"a","Data":"ArbCom clerks"},{"TagName":"a","Data":"Governance"},{"TagName":"a","Data":"Administration"},{"TagName":"a","Data":"FAQ"},{"TagName":"a","Data":"Formal organization"},{"TagName":"a","Data":"Editorial oversight and control"},{"TagName":"a","Data":"Quality control"},{"TagName":"a","Data":"Wikimedia Foundation"},{"TagName":"a","Data":"Board"},{"TagName":"a","Data":"Founder's seat"},{"TagName":"a","Data":"Meta-Wiki"},{"TagName":"a","Data":"Proposals"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"Elections"},{"TagName":"a","Data":"Policies and guidelines"},{"TagName":"a","Data":"Petitions"},{"TagName":"a","Data":"Noticeboards"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Reforms"}]