[{"TagName":"a","Data":"Wikipedia:Requests for permissions"},{"TagName":"a","Data":"Wikipedia:User access levels"},{"TagName":"a","Data":""},{"TagName":"a","Data":"how-to guide"},{"TagName":"a","Data":"Wikipedia's policies or guidelines"},{"TagName":"a","Data":"consensus"},{"TagName":"a","Data":"vetting"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:COPYREQ"},{"TagName":"a","Data":"WP:PERMISSION"},{"TagName":"a","Data":"WP:PERMISSIONS"},{"TagName":"a","Data":"Quick permission generator (uses email)"},{"TagName":"a","Data":"Donating copyrighted materials"},{"TagName":"a","Data":"Declaration of consent for all enquiries"},{"TagName":"a","Data":"Reusing Wikipedia content"},{"TagName":"a","Data":"Wikipedia copyright"},{"TagName":"a","Data":"Copyright policy"},{"TagName":"a","Data":"Copyright violation policy"},{"TagName":"a","Data":"Reusing Wikipedia content"},{"TagName":"a","Data":"CC BY-SA 4.0"},{"TagName":"a","Data":"GFDL"},{"TagName":"a","Data":"Public domain content"},{"TagName":"a","Data":"Non-free content"},{"TagName":"a","Data":"Non-US copyrights"},{"TagName":"a","Data":"Copying within Wikipedia"},{"TagName":"a","Data":"Copyright information index"},{"TagName":"a","Data":"Frequently asked questions"},{"TagName":"a","Data":"Donating copyrighted material"},{"TagName":"a","Data":"Copying text from other sources"},{"TagName":"a","Data":"Close paraphrasing"},{"TagName":"a","Data":"Requesting copyright permission"},{"TagName":"a","Data":"Guidance for text copyright problems"},{"TagName":"a","Data":"Copyright problems"},{"TagName":"a","Data":"Files for discussion"},{"TagName":"a","Data":"Contributor copyright investigations"},{"TagName":"a","Data":"General help"},{"TagName":"a","Data":"Copyright assistance"},{"TagName":"a","Data":"Media copyright questions"},{"TagName":"a","Data":"File copyright tags"},{"TagName":"a","Data":"Declaration of consent"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"p","Data":"\n"},{"TagName":"p","Data":"To use copyrighted material on Wikipedia, it is not enough that we have permission to use it on Wikipedia alone. That's because Wikipedia itself states all its material may be used by anyone, for any purpose. So we have to be sure all material is in fact licensed for that purpose, whoever provided it.\n"},{"TagName":"p","Data":"To do this, we must often email or contact the copyright holders and ask them to irrevocably release the source material under one or more suitably-free and compatible copyright licenses, so that the content may be used at Wikipedia. We ordinarily ask that such release be provided under the Creative Commons Attribution-Sharealike 3.0 Unported License (CC BY-SA) or a CC BY-SA-compatible license and, if possible, also the GNU Free Documentation License (GFDL) (unversioned, with no invariant sections, front-cover texts, or back-cover texts). See our copyright policy for more.\n"},{"TagName":"a","Data":"suitably-free and compatible"},{"TagName":"a","Data":"Creative Commons Attribution-Sharealike 3.0 Unported License"},{"TagName":"a","Data":"GNU Free Documentation License"},{"TagName":"a","Data":"our copyright policy"},{"TagName":"p","Data":"The main legal issue that is important to explain to potential contributors: they would be agreeing that their material can be used freely by Wikipedia AND its downstream users, and that such use might include commercial use, for which the contributor is not entitled to royalties or compensation. Wikimedia itself is a non-profit organization, and any money it raised from the re-use of Wikimedia content would go to furthering our aims—buying new servers to keep the websites running efficiently, producing print runs, making Wikipedia available on CD/DVD for schools and developing countries, and other activities. However, not all of those who re-use our content are so high-minded.\n"},{"TagName":"p","Data":"This means that a contributor's work might appear in print or digital versions of this encyclopedia that are sold in stores.  It might appear in books, or other specialized subsets of the full text—teacher curriculum packets, publicity brochures, or other uses we haven't thought of yet. It will certainly be used by other websites that legally copy our content. \n"},{"TagName":"p","Data":"About half the people we ask say yes, especially if it's explained that the license terms mean it is more widely appreciated and that we do not want to use all their material, but just one image or item. See Wikipedia:Example requests for permission for more.\n"},{"TagName":"a","Data":"Wikipedia:Example requests for permission"},{"TagName":"p","Data":"This page explains what must be done if you want to use content that's copyrighted, whether you know who produced it or you don't.\n"},{"TagName":"h2","Data":"More"},{"TagName":"p","Data":"It sometimes happens that users post text from other websites claiming to have permission to do so. Sometimes, images from other websites are uploaded and claimed to be under a free license (CC BY-SA, GFDL, public domain, {{No rights reserved}}, or others). If the external website does not have any indication that such claims are well-founded, it is a good idea to try to verify such claims.\n"},{"TagName":"a","Data":"free license"},{"TagName":"a","Data":"CC BY-SA"},{"TagName":"a","Data":"GFDL"},{"TagName":"a","Data":"public domain"},{"TagName":"a","Data":"No rights reserved"},{"TagName":"p","Data":"If the poster or uploader claims to be the copyright holder and website owner themself, leave them a message on-Wiki asking them to include a license statement on their website that says that the text or image in question is indeed published under the claimed license. That's the easiest way to confirm such a claim. If they would prefer not to do that, or claim to have permission from some third party (usually the original author or photographer), permission can be verified as below through email.\n"},{"TagName":"p","Data":"If you yourself have found an image or text source and want to contact the photographer or copyright holder up-front to secure permission before uploading the image or adding the text, you should also follow these guidelines.\n"},{"TagName":"p","Data":"The main legal thing that is important to explain to potential contributors: they would be agreeing that their picture (or text) can be used freely by Wikipedia AND its downstream users, and that such use might include commercial use, for which the contributor is not entitled to royalties or compensation.\n"},{"TagName":"h2","Data":"How to ask for permission"},{"TagName":"a","Data":"Wikimedia VRT release generator"},{"TagName":"a","Data":"Declaration of consent for all enquiries"},{"TagName":"a","Data":"Example requests for permission"},{"TagName":"p","Data":"Search the external website and try to find a contact address. Most websites give an e-mail address of the webmaster; if the author of the text or the photographer of an image is known, try to contact the author or photographer directly. In general, do not send an inquiry to an e-mail address you find posted on Wikipedia: if you have reason to question a license claim made on Wikipedia, you also have reason to wonder whether contact data given on Wikipedia is correct. Try to find a contact address from a source other than the Wiki. Email them explaining the situation and asking for their permission. If authorship is unclear, ask them to confirm that the text or image is indeed theirs.\n"},{"TagName":"h3","Data":"For text"},{"TagName":"p","Data":"Text imported from other sites into Wikipedia articles must be licensed under the terms of the Creative Commons Attribution-Sharealike 3.0 Unported License (CC BY-SA) (CC BY-SA compatible licenses are also accepted, as, of course, is release into public domain). When asking for permission, you should explain that this means that\n"},{"TagName":"a","Data":"Creative Commons Attribution-Sharealike 3.0 Unported License"},{"TagName":"p","Data":"You may also choose to explain that the author does not give up any of their rights to use the text: they are still free to publish the text elsewhere or to license the same text to other parties under any other license. \n"},{"TagName":"p","Data":"It is recommended that you attempt to obtain dual-licensing for text under the GNU Free Documentation License (GFDL) (unversioned, with no invariant sections, front-cover texts, or back-cover texts) license as well, which uses similar ideologies to CC BY-SA, but is incompatible. Wikipedia's general content is co-licensed, and it is more convenient for our reusers to have material available under both licenses, but it is not essential when importing text from external sites authored by others.\n"},{"TagName":"a","Data":"GNU Free Documentation License"},{"TagName":"h3","Data":"For images"},{"TagName":"p","Data":"For images, you are not limited to CC BY-SA: any free license will do. If the photographer's identity is unclear (for instance, if an image was uploaded stating the photographer's name and claiming a free license, but the image cannot be found on the web), ask them to confirm that the image is theirs. In any case, ask them to confirm the claimed license. For CC BY-SA, point out the points mentioned above. Any free license must allow all of the following, for both the image itself as well as any modified versions based on it:\n"},{"TagName":"p","Data":"The only restrictions allowable are proper attribution of the creator and the requirement that derivative works are similarly licensed.\n"},{"TagName":"p","Data":"Persons who are the subject of a Wikipedia biography may also use Wikipedia:Contact us/Photo submission.\n"},{"TagName":"a","Data":"Wikipedia:Contact us/Photo submission"},{"TagName":"h2","Data":"Consent letter"},{"TagName":"p","Data":"Direct copyright holders to read Wikipedia:Declaration of consent for all enquiries for a sample letter.\n"},{"TagName":"a","Data":"Wikipedia:Declaration of consent for all enquiries"},{"TagName":"h2","Data":"When permission is confirmed"},{"TagName":"p","Data":"Once you have received a written/e-mail confirmation granting permission you should: \n"},{"TagName":"p","Data":"1. If the material is not already on Commons or Wikipedia: Upload relevant images, sound recordings or videos to Commons. If you don't have a Commons account, see Commons:First steps for more help. If for text, upload to Wikipedia. \n"},{"TagName":"a","Data":"Upload"},{"TagName":"a","Data":"Commons:First steps"},{"TagName":"p","Data":"2. Please ask the copyright holder to e-mail the permission e-mails for Commons uploads to permissions-commonswikimedia.org and for text permissions to permissions-enwikimedia.org (both are volunteer response team addresses). Make sure to include in this mail:\n"},{"TagName":"a","Data":"volunteer response team"},{"TagName":"p","Data":"as this will enable the Wikimedia information team to verify the materials.\n"},{"TagName":"p","Data":"3. Add {{permission pending}} to the image description page or article talk page (whichever is applicable). This will help an editor with access to VRTS to tag the article or image with {{Permission ticket|ticket=http://linktoticket.example.org }} providing evidence of the received e-mail and clearing the status of the item in question. Providing the link to the VRTS  ticket number is essential for easy verification.\n"},{"TagName":"a","Data":"permission pending"},{"TagName":"a","Data":"with access to VRTS"},{"TagName":"a","Data":"Permission ticket"},{"TagName":"a","Data":"http://linktoticket.example.org"},{"TagName":"p","Data":"See also: Wikipedia:copyrights, Wikipedia:Possible copyright infringements\n"},{"TagName":"a","Data":"Wikipedia:copyrights"},{"TagName":"a","Data":"Wikipedia:Possible copyright infringements"},{"TagName":"h2","Data":"Typical request letter for confirmation"},{"TagName":"a","Data":"Wikipedia:Example requests for permission"},{"TagName":"p","Data":"Dear *[NAME],\n"},{"TagName":"p","Data":"I am writing to confirm whether permission is granted to use *[a page/content] from your website under the terms of the Creative Commons Attribution-ShareAlike 3.0 Unported License (CC BY-SA). A user with the *[IP xxx/ username xxx] has pasted in text from your website [WEBSITE ADDRESS] to Wikipedia, the free encyclopedia. The text concerns *[TOPIC OF PAGE] and the original submission can be viewed at *[Address of Pre-copyvio boilerplate version].\n"},{"TagName":"p","Data":"This user claims on the talk page *[TALK PAGE ADDRESS] to *[have the authority to release this material under CC BY-SA/ be the original author of the material], but for the page to remain on our site, we need further evidence that this is the case. Please be assured that if you do not grant permission, your content will not be used at Wikipedia; we have a strict policy against copyright violations.\n"},{"TagName":"p","Data":"You can read CC BY-SA in full at http://en.wikipedia.org/wiki/Wikipedia:Text_of_Creative_Commons_Attribution-ShareAlike_3.0_Unported_License. The license stipulates that any copy of the material, even if modified, must carry the same license. This means that anyone would be licensed to distribute the material, possibly for a fee (we would distribute your work free of charge). Under the license, no distributor (commercial or otherwise) can restrict future distribution, so your work would never become proprietary. In addition, the license does not grant the right to imply your endorsement of a modified version.\n"},{"TagName":"a","Data":"http://en.wikipedia.org/wiki/Wikipedia:Text_of_Creative_Commons_Attribution-ShareAlike_3.0_Unported_License"},{"TagName":"p","Data":"Please note that your contributions may not remain intact as submitted; this license and the collaborative nature of our project entitles others to edit, alter, and update content at will, i.e., to keep up with new information, or suit the text to a different purpose. There is more information on our copyright policy at: http://en.wikipedia.org/wiki/Wikipedia:Copyrights .\n"},{"TagName":"a","Data":"http://en.wikipedia.org/wiki/Wikipedia:Copyrights"},{"TagName":"p","Data":"The article will be deleted in seven days time if permission is not confirmed, though it can be restored at a later date if you choose to respond later to state that such use is allowed.\n"},{"TagName":"p","Data":"Thank you for your time. I look forward to your response.  \n"},{"TagName":"p","Data":"Yours faithfully,  \n"},{"TagName":"p","Data":"*[NAME]\n"},{"TagName":"h2","Data":"See also"},{"TagName":"a","Data":"Meta: Volunteer Response Team"},{"TagName":"a","Data":"User:R. Baley/Acquire a free image"},{"TagName":"a","Data":"Wikipedia:Requesting free content"},{"TagName":"a","Data":"Wikipedia:Finding images tutorial"},{"TagName":"a","Data":"commons:Commons:WikiProject Permission requests"}]