[{"TagName":"a","Data":"Capital region (disambiguation)"},{"TagName":"a","Data":""},{"TagName":"a","Data":"cite"},{"TagName":"a","Data":"sources"},{"TagName":"a","Data":"improve this article"},{"TagName":"a","Data":"adding citations to reliable sources"},{"TagName":"a","Data":"removed"},{"TagName":"a","Data":"\"Capital districts and territories\""},{"TagName":"a","Data":"news"},{"TagName":"a","Data":"newspapers"},{"TagName":"a","Data":"books"},{"TagName":"a","Data":"scholar"},{"TagName":"a","Data":"JSTOR"},{"TagName":"a","Data":"Learn how and when to remove this template message"},{"TagName":"p","Data":"A capital district, capital region, or capital territory is normally a specially designated administrative division where a country's seat of government is located.  As such, in a federal model of government, no state or territory has any political or economic advantage relative to the others because of the national capital lying within its borders.  A capital territory can be a specific form of federal district.\n"},{"TagName":"a","Data":"district"},{"TagName":"a","Data":"capital region"},{"TagName":"a","Data":"territory"},{"TagName":"a","Data":"administrative division"},{"TagName":"a","Data":"country"},{"TagName":"a","Data":"government"},{"TagName":"a","Data":"federal"},{"TagName":"a","Data":"state"},{"TagName":"a","Data":"capital"},{"TagName":"a","Data":"borders"},{"TagName":"a","Data":"federal district"},{"TagName":"p","Data":"A distinction should be made from administrative divisions which include national capitals, but have no special designated status legally (for example, Île de France has no distinct quality from other regions of France).  Some federal countries (like Belgium and Germany), give their national capitals the status as full, equal federal units.\n"},{"TagName":"a","Data":"Île de France"},{"TagName":"a","Data":"France"},{"TagName":"a","Data":"Belgium"},{"TagName":"a","Data":"Germany"},{"TagName":"p","Data":"A few federal countries have their national capitals located in the capital city of a constituent state: Sarajevo, the capital of Bosnia and Herzegovina, is also the capital of the Federation of Bosnia and Herzegovina, one of federal units and de jure capital of Republika Srpska, the other federal unit; further, Bern, the capital of Switzerland, is the capital of the Canton of Bern.\n"},{"TagName":"a","Data":"Sarajevo"},{"TagName":"a","Data":"Bosnia and Herzegovina"},{"TagName":"a","Data":"Federation of Bosnia and Herzegovina"},{"TagName":"a","Data":"de jure"},{"TagName":"a","Data":"Republika Srpska"},{"TagName":"a","Data":"Bern"},{"TagName":"a","Data":"Switzerland"},{"TagName":"a","Data":"Canton of Bern"},{"TagName":"p","Data":"Unusually, Canada is the only federation in the world not to accord a special administrative subdivision to its capital (c.f. District of Columbia (United States), Federal District (Brazil), Federal Capital Territory (Nigeria), National Capital Territory (India), Australian Capital Territory (Australia), and rather, Ottawa is merely another municipality in the Province of Ontario. The Canadian government does designate the Ottawa area as the National Capital Region, although this term merely represents the jurisdictional area of the government agency that administers federally owned lands and buildings, and is not an actual political unit. The City of Ottawa is governed as any other city in Ontario would be. The capital Berlin is one of three cities that operate as States of Germany.\n"},{"TagName":"a","Data":"federation"},{"TagName":"a","Data":"District of Columbia"},{"TagName":"a","Data":"Federal District"},{"TagName":"a","Data":"Federal Capital Territory"},{"TagName":"a","Data":"National Capital Territory"},{"TagName":"a","Data":"Australian Capital Territory"},{"TagName":"a","Data":"Ottawa"},{"TagName":"a","Data":"Ontario"},{"TagName":"a","Data":"National Capital Region"},{"TagName":"a","Data":"Berlin"},{"TagName":"a","Data":"States of Germany"},{"TagName":"p","Data":"In some non-federal countries there are capital cities that do not belong to any region, but have a special status, for example Oslo in Norway. In some countries the region including the capital does not have special significance, but have names hinting that. For example, the Capital Region of Denmark is a name of a normal national region.\n"},{"TagName":"a","Data":"Oslo"},{"TagName":"a","Data":"Capital Region of Denmark"},{"TagName":"p","Data":"The following have a special administrative district or territory for their capital cities:\n"},{"TagName":"a","Data":"capital"},{"TagName":"h2","Data":"Terminology[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Seoul Capital Area"},{"TagName":"a","Data":"Capital District (Venezuela)"},{"TagName":"a","Data":"Capital District, New York"},{"TagName":"a","Data":"Niamey Capital District"},{"TagName":"a","Data":"Capital Region of Denmark"},{"TagName":"a","Data":"Australian Capital Territory"},{"TagName":"a","Data":"Islamabad Capital Territory"},{"TagName":"a","Data":"Federal Capital Territory (Nigeria)"},{"TagName":"a","Data":"Federal District (Brazil)"},{"TagName":"a","Data":"National Capital District (Papua New Guinea)"},{"TagName":"a","Data":"National Capital Region (Canada)"},{"TagName":"a","Data":"National Capital Region (India)"},{"TagName":"a","Data":"National Capital Region (Japan)"},{"TagName":"a","Data":"National Capital Region (Philippines)"},{"TagName":"a","Data":"National Capital Territory (India)"},{"TagName":"a","Data":"Neutral Municipality (Brazil)"},{"TagName":"h2","Data":"Argentina[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"The Buenos Aires city, previously in the Federal District of Argentina. In 1996, under the 1994 reform of the Argentine Constitution, the city gained autonomous city status, and changed its formal name to Autonomous City of Buenos Aires, and held its first mayoral elections. Buenos Aires is represented in the Argentine Senate by three senators and in the Argentine Chamber of Deputies by 25 national deputies.\n"},{"TagName":"a","Data":"Buenos Aires"},{"TagName":"a","Data":"Federal District"},{"TagName":"a","Data":"Argentina"},{"TagName":"a","Data":"1994 reform of the Argentine Constitution"},{"TagName":"a","Data":"autonomous city"},{"TagName":"a","Data":"Argentine Senate"},{"TagName":"a","Data":"Argentine Chamber of Deputies"},{"TagName":"h2","Data":"Australia[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"The Australian Capital Territory is one of two self-governing internal territories of the Commonwealth of Australia, the other being the Northern Territory. Created in 1911, the ACT was originally called the Federal Capital Territory, the current name being acquired in 1938. The ACT was constituted specifically to house the seat of government, the goal being to avoid situating the new nation's capital Canberra in either New South Wales or Victoria, the two most populous states. The ACT is an enclave of New South Wales.\n"},{"TagName":"a","Data":"Australian Capital Territory"},{"TagName":"a","Data":"Commonwealth of Australia"},{"TagName":"a","Data":"Northern Territory"},{"TagName":"a","Data":"Canberra"},{"TagName":"a","Data":"New South Wales"},{"TagName":"a","Data":"Victoria"},{"TagName":"a","Data":"enclave"},{"TagName":"p","Data":"Although the ACT has its own Chief Minister and its own legislature (the Australian Capital Territory Legislative Assembly), the Federal Parliament retains the right to overrule ACT legislation. While governing the entire ACT, the Legislative Assembly acts as a municipal/state government. The Governor-General of Australia exercises certain rights that in the states would be exercised by the governor, such as the power to issue writs for elections.\n"},{"TagName":"a","Data":"Chief Minister"},{"TagName":"a","Data":"Australian Capital Territory Legislative Assembly"},{"TagName":"a","Data":"Federal Parliament"},{"TagName":"a","Data":"Governor-General of Australia"},{"TagName":"p","Data":"At a federal level, the ACT and the NT both elect two Senators, with the ACT electing 3 members of the House of Representatives and the NT two. The terms of the territory senators are tied to the term of the House of Representatives, not to the term of the Senate.  This means that if there is an election for the Senate only (as last happened in 1970), this would involve only half the state senators, and the territory senators' terms would continue.  Conversely, if there is an election for the House of Representatives only (as last happened in 1972), this would also involve the territory senators but not the state senators.\n"},{"TagName":"a","Data":"Senators"},{"TagName":"a","Data":"House of Representatives"},{"TagName":"h2","Data":"Brazil[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Brasília, the capital of Brazil, is set within the Federal District. Its territory includes several other cities, officially called administrative regions, since the Federal District cannot be divided into municipalities in the same manner as the states of Brazil.\n"},{"TagName":"a","Data":"Brasília"},{"TagName":"a","Data":"Brazil"},{"TagName":"a","Data":"Federal District"},{"TagName":"a","Data":"administrative regions"},{"TagName":"a","Data":"municipalities"},{"TagName":"a","Data":"states of Brazil"},{"TagName":"p","Data":"The Federal District is a special unit of the federation, as it is not organized the same manner as a municipality, does not possess the same autonomy as a state (but is ranked among them) and is closely related to the central power.\n"},{"TagName":"p","Data":"The District Governor is elected directly for a 4-year term. Local laws are issued by a legislative chamber also elected by the local population. Judiciary affairs are carried out by the Union, instead of being appointed by the governor as in the other states of Brazil. The Federal District has the status of a federal state in many aspects. It has representatives both in the Chamber of Deputies (lower house of congress) and in the Federal Senate (upper house of congress).\n"},{"TagName":"a","Data":"Union"},{"TagName":"a","Data":"states of Brazil"},{"TagName":"a","Data":"Chamber of Deputies"},{"TagName":"a","Data":"Federal Senate"},{"TagName":"p","Data":"The Brazilian federal government was transferred to the current Federal District, separate from the state of Goiás and the border with the state of Minas Gerais on April 21, 1960, when the planned city of Brasília was inaugurated. Before the transfer, the Brazilian capital was the city of Rio de Janeiro. After the transfer, the territory where the former Federal District was located became the state of Guanabara, where the city of Rio de Janeiro was included, this state that existed from 1960 to 1975, when the state of Guanabara was merged with the state of Rio de Janeiro.\n"},{"TagName":"a","Data":"Goiás"},{"TagName":"a","Data":"Minas Gerais"},{"TagName":"a","Data":"Rio de Janeiro"},{"TagName":"a","Data":"Federal District"},{"TagName":"a","Data":"Guanabara"},{"TagName":"a","Data":"Rio de Janeiro"},{"TagName":"h2","Data":"Colombia[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Capital District (Colombia)"},{"TagName":"p","Data":"In Colombia the Capital District, containing the city of Bogotá was created as a special district in 1955 by Gustavo Rojas Pinilla. The district is made up of 20 localities.\n"},{"TagName":"a","Data":"Capital District"},{"TagName":"a","Data":"Bogotá"},{"TagName":"a","Data":"Gustavo Rojas Pinilla"},{"TagName":"h2","Data":"Dominican Republic[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Distrito Nacional (Dominican Republic)"},{"TagName":"p","Data":"In Dominican Republic the National District, containing the city of Santo Domingo de Guzman was created as a special district in 1922.\n"},{"TagName":"a","Data":"National District"},{"TagName":"a","Data":"Santo Domingo de Guzman"},{"TagName":"h2","Data":"India[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"The National Capital Territory is a special union territory of India. The territory encompasses three statutory towns: New Delhi (the capital of India), Delhi and Delhi Cantonment, along with 59 census towns and 165 villages. The NCT was set up as a federally administered Union Territory on 11 November 1956. In December 1991, the NCT was given a legislative assembly headed by a Chief Minister. The territory is not classified as a true union territory, though the central government does have limited control over the functioning of the territory much like other union territories. The NCT is unique in India in that the municipal control is handled by a locally elected government, major areas such as the police, and administration are handled by the central government.\n"},{"TagName":"a","Data":"National Capital Territory"},{"TagName":"a","Data":"union territory"},{"TagName":"a","Data":"India"},{"TagName":"a","Data":"New Delhi"},{"TagName":"a","Data":"Delhi Cantonment"},{"TagName":"a","Data":"legislative assembly"},{"TagName":"a","Data":"Chief Minister"},{"TagName":"a","Data":"central government"},{"TagName":"a","Data":"central government"},{"TagName":"h2","Data":"Indonesia[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"In Indonesia, the national capital Jakarta is within the Daerah Khusus Ibukota Jakarta (Special Capital Region of Jakarta). Jakarta is considered one of Indonesia's provinces, therefore Jakarta is headed by a governor and not a mayor. However, Jakarta is divided into 5 smaller \"administrative cities\" (kota administrasi) and one \"administrative regency\" (kabupaten administrasi). The administrative cities are Central, North, East, West, and South Jakarta. The Kepulauan Seribu (Thousand Islands) administrative regency is also included in the formal definition of Jakarta. All of these sub-units have its own degree of autonomy. Mayors of the five administrative cities and the regent of Kepulauan Seribu administration-regency are not elected, but directly appointed by the Governor and members of the Provincial Parliament of Jakarta. Furthermore, these sub-units do not have local parliament as opposed to other cities or regencies in Indonesia.\n"},{"TagName":"a","Data":"Indonesia"},{"TagName":"a","Data":"Jakarta"},{"TagName":"a","Data":"Indonesia's provinces"},{"TagName":"a","Data":"governor"},{"TagName":"a","Data":"Central"},{"TagName":"a","Data":"North"},{"TagName":"a","Data":"East"},{"TagName":"a","Data":"West"},{"TagName":"a","Data":"South Jakarta"},{"TagName":"a","Data":"Thousand Islands"},{"TagName":"a","Data":"Provincial Parliament of Jakarta"},{"TagName":"h2","Data":"Iraq[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Baghdad, the capital of Iraq, is contained within a special capital district.\n"},{"TagName":"a","Data":"Baghdad"},{"TagName":"a","Data":"Iraq"},{"TagName":"h2","Data":"Malaysia[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"As per Article 154 of the Federal Constitution, the national capital of Malaysia was set in Kuala Lumpur, then part of the state of Selangor. In Malaysia, the national capital of Kuala Lumpur lies within the Federal Territory of Kuala Lumpur (since 1974) while the federal government administrative centre of Putrajaya, 40 km (25 mi) to the south of Kuala Lumpur, lies within the Federal Territory of Putrajaya (since 2001). Both federal territories are enclaves within the state of Selangor.\n"},{"TagName":"a","Data":"Malaysia"},{"TagName":"a","Data":"Kuala Lumpur"},{"TagName":"a","Data":"Federal Territory"},{"TagName":"a","Data":"Putrajaya"},{"TagName":"a","Data":"Selangor"},{"TagName":"h2","Data":"Mali[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Regions of Mali"},{"TagName":"p","Data":"Bamako, the capital of Mali, is contained within the Bamako Capital District.\n"},{"TagName":"a","Data":"Bamako"},{"TagName":"a","Data":"Mali"},{"TagName":"h2","Data":"Mexico[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"The Federal District was, since 1824, a federal territory that served as the seat of the capital of Mexico, Mexico City, which was directly administered, until 1997, by the federal government via a presidential-appointed head of government. The Federal District encompassed the historical municipality of Mexico City (abolished in 1928) and other territories in its surroundings. The lack of proper legislation often lead to ambiguity regarding to what was under the jurisdiction of Mexico City and what fell under the Federal District's. Hence, in 1993, an amendment to the article 44 of the federal constitution defined that both names referred to the same entity. On July 6, 1997, the head of government was elected by popular vote for the first time.\n"},{"TagName":"a","Data":"Federal District"},{"TagName":"a","Data":"capital"},{"TagName":"a","Data":"Mexico"},{"TagName":"a","Data":"Mexico City"},{"TagName":"a","Data":"federal constitution"},{"TagName":"p","Data":"On 29 January 2016, the Federal District ceased to exist and its territory, under the name of Mexico City, became the 32nd federal entity of the country. Mexico City has the same rights and obligations as any of the other 31 states, albeit it is not technically one.\n"},{"TagName":"a","Data":"federal entity"},{"TagName":"h2","Data":"Niger[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Niger's capital, Niamey, comprises a capital district of Niger.  It is surrounded by the Tillabéri Department.\n"},{"TagName":"a","Data":"Niger's"},{"TagName":"a","Data":"Niamey"},{"TagName":"a","Data":"Tillabéri Department"},{"TagName":"h2","Data":"Nigeria[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Nigeria's capital Abuja is located in the Federal Capital Territory. The Territory was established in 1976, and the capital was formally moved from Lagos (the historic capital) in 1991.\n"},{"TagName":"a","Data":"Nigeria"},{"TagName":"a","Data":"Abuja"},{"TagName":"a","Data":"Federal Capital Territory"},{"TagName":"a","Data":"Lagos"},{"TagName":"h2","Data":"North Korea[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"North Korea's capital city, Pyongyang, while traditionally located within South Pyongan Province, is currently seen as a \"directly governed city\" (chikalshi 직할시).  For a time, Pyongyang was considered a \"special city\" (t'ŭkpyŏlshi 특별시), to make it equivalent to its South Korean counterpart, Seoul.\n"},{"TagName":"a","Data":"North Korea"},{"TagName":"a","Data":"Pyongyang"},{"TagName":"a","Data":"South Pyongan Province"},{"TagName":"a","Data":"Seoul"},{"TagName":"h2","Data":"Norway[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Oslo acts as a consolidated city-county, and is separate from the other counties of Norway. All counties are co-governed by a county council and representatives from the national government.\n"},{"TagName":"a","Data":"Oslo"},{"TagName":"a","Data":"consolidated city-county"},{"TagName":"a","Data":"counties of Norway"},{"TagName":"a","Data":"county council"},{"TagName":"h2","Data":"Pakistan[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"The capital of Pakistan, Islamabad, is a planned city within the Islamabad Capital Territory, which was created in 1960 out of the Punjab Province. The Territory elects representatives to both houses of the legislature. Before Islamabad was made the capital, Karachi was located in the Federal Capital Territory, which later reverted to the Sindh Province.\n"},{"TagName":"a","Data":"Pakistan"},{"TagName":"a","Data":"Islamabad"},{"TagName":"a","Data":"planned city"},{"TagName":"a","Data":"Islamabad Capital Territory"},{"TagName":"a","Data":"Punjab"},{"TagName":"a","Data":"Karachi"},{"TagName":"a","Data":"Federal Capital Territory"},{"TagName":"a","Data":"Sindh"},{"TagName":"h2","Data":"Papua New Guinea[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Port Moresby, the capital of Papua New Guinea has been contained within the National Capital District of Papua New Guinea since the country achieved independence in 1975.\n"},{"TagName":"a","Data":"Port Moresby"},{"TagName":"a","Data":"Papua New Guinea"},{"TagName":"a","Data":"National Capital District of Papua New Guinea"},{"TagName":"h2","Data":"Peru[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Lima, the nation's capital, is contained entirely within Lima Province, the only province in the country not belonging to any of the twenty-five regions. It is surrounded by the Lima Region on all sides but west.\n"},{"TagName":"a","Data":"Lima"},{"TagName":"a","Data":"Lima Province"},{"TagName":"a","Data":"province"},{"TagName":"a","Data":"twenty-five regions"},{"TagName":"a","Data":"Lima Region"},{"TagName":"h2","Data":"Philippines[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"The National Capital Region of the Philippines is Metro Manila, the country's seat of government containing Manila, the country's capital. Created in 1975 out of four cities and twelve municipalities of the province of Rizal and one municipality of the province of Bulacan, the region is administered by seventeen separately elected mayors and their councils which are coordinated by the Metropolitan Manila Development Authority, a national government agency headed by a chairperson directly appointed by the Philippine President. Quezon City, the country's former capital from 1948 to 1976, is also located within this region.\n"},{"TagName":"a","Data":"Metro Manila"},{"TagName":"a","Data":"Manila"},{"TagName":"a","Data":"Rizal"},{"TagName":"a","Data":"Bulacan"},{"TagName":"a","Data":"Metropolitan Manila Development Authority"},{"TagName":"a","Data":"Philippine President"},{"TagName":"a","Data":"Quezon City"},{"TagName":"h2","Data":"South Korea[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"South Korea's capital city, Seoul, while traditionally located within Gyeonggi Province, is currently seen as a \"special city\" (Teukbyeolsi/T'ŭkpyŏlshi 특별시). Seoul's mayor is seen as the equivalent of any provincial governor.\n"},{"TagName":"a","Data":"South Korea"},{"TagName":"a","Data":"Seoul"},{"TagName":"a","Data":"Gyeonggi Province"},{"TagName":"a","Data":"Seoul's mayor"},{"TagName":"a","Data":"governor"},{"TagName":"h2","Data":"Sweden[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Since 1968, Stockholm has been a consolidated city-county.\n"},{"TagName":"a","Data":"Stockholm"},{"TagName":"a","Data":"consolidated city-county"},{"TagName":"p","Data":"Historically, until 1967, Stockholm did not belong to any county of Sweden, including Stockholm County. Instead, there was an Governor that had the normal responsibilities of the County Administrative Boards and its managers, the governors. This did not mean there was a large practical difference. There was no County Council (which is elected by the people and is responsible for example for health care); instead, the Stockholm city handled such tasks.\n"},{"TagName":"a","Data":"Stockholm"},{"TagName":"a","Data":"county"},{"TagName":"a","Data":"Sweden"},{"TagName":"a","Data":"Stockholm County"},{"TagName":"a","Data":"Governor"},{"TagName":"a","Data":"County Administrative Boards"},{"TagName":"a","Data":"County Council"},{"TagName":"h2","Data":"Taiwan (Republic of China)[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Taipei, the capital of the Republic of China (colloquially known as Taiwan), is a special municipality (Chinese: 直轄市; pinyin: zhíxiáshì).\n"},{"TagName":"a","Data":"Taipei"},{"TagName":"a","Data":"Republic of China"},{"TagName":"a","Data":"Taiwan"},{"TagName":"a","Data":"special municipality"},{"TagName":"a","Data":"Chinese"},{"TagName":"a","Data":"pinyin"},{"TagName":"h2","Data":"United States[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"As provided by Article 1, Section 8 of the United States Constitution, the seat of the United States government is a federal district known as the District of Columbia. When created in 1790, the District comprised 100 square miles (260 km2) of land donated by the states of Maryland and Virginia. Columbia was a poetic name for the United States used at the time.\n"},{"TagName":"a","Data":"Article 1, Section 8"},{"TagName":"a","Data":"United States Constitution"},{"TagName":"a","Data":"seat"},{"TagName":"a","Data":"United States"},{"TagName":"a","Data":"District of Columbia"},{"TagName":"a","Data":"Maryland"},{"TagName":"a","Data":"Virginia"},{"TagName":"a","Data":"Columbia"},{"TagName":"p","Data":"The City of Washington was built in the center of the District, but other towns were also located in the territory such as Georgetown and Alexandria. The United States Congress returned the Virginia portion of the District back to that state in 1846. The District of Columbia Organic Act of 1871 revoked the charters of the individual cities of Washington and Georgetown, and instead created a single government for the whole District of Columbia. The City of Washington no longer exists; however, the name continues in use and the District is often referred to as just Washington, D.C. Georgetown now exists as a historic district within the District of Columbia.\n"},{"TagName":"a","Data":"Georgetown"},{"TagName":"a","Data":"Alexandria"},{"TagName":"a","Data":"returned the Virginia portion"},{"TagName":"a","Data":"District of Columbia Organic Act of 1871"},{"TagName":"p","Data":"Since the Home Rule Act of 1973, the District of Columbia has been run by an elected mayor and district council. Congress retains ultimate authority over the District and has the right to review the local budget and taxes, overturn laws passed by the district council, and terminate home rule. District residents pay federal taxes and are represented by a single, non-voting member in the United States House of Representatives.\n"},{"TagName":"a","Data":"Home Rule Act of 1973"},{"TagName":"a","Data":"mayor"},{"TagName":"a","Data":"district council"},{"TagName":"a","Data":"home rule"},{"TagName":"a","Data":"taxes"},{"TagName":"a","Data":"non-voting member"},{"TagName":"a","Data":"United States House of Representatives"},{"TagName":"p","Data":"Because of the Twenty-third Amendment to the United States Constitution, the people of the District of Columbia are allowed to vote for President of the United States. The District is allotted three electoral votes, equal to that of the least populous state.\n"},{"TagName":"a","Data":"Twenty-third Amendment to the United States Constitution"},{"TagName":"h2","Data":"Venezuela[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"The Capital District has the capital of Venezuela, Caracas.\n"},{"TagName":"a","Data":"Capital District"},{"TagName":"a","Data":"Venezuela"},{"TagName":"a","Data":"Caracas"},{"TagName":"h2","Data":"See also[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Capital region"},{"TagName":"a","Data":"Direct-controlled municipality"},{"TagName":"a","Data":"Federal district"},{"TagName":"a","Data":"Federal territory"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"Capital districts and territories"},{"TagName":"a","Data":"Federal Capital Territory"},{"TagName":"a","Data":"Nigeria"},{"TagName":"a","Data":"Federal District"},{"TagName":"a","Data":"Brazil"},{"TagName":"a","Data":"Buenos Aires"},{"TagName":"a","Data":"Argentina"},{"TagName":"a","Data":"Australian Capital Territory"},{"TagName":"a","Data":"Australia"},{"TagName":"a","Data":"Capital District"},{"TagName":"a","Data":"Venezuela"},{"TagName":"a","Data":"Islamabad Capital Territory"},{"TagName":"a","Data":"Pakistan"},{"TagName":"a","Data":"Kuala Lumpur"},{"TagName":"a","Data":"Malaysia"},{"TagName":"a","Data":"National Capital Territory"},{"TagName":"a","Data":"India"},{"TagName":"a","Data":"Mexico City"},{"TagName":"a","Data":"Mexico"},{"TagName":"a","Data":"Washington, D.C."},{"TagName":"a","Data":"United States"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"administrative division"},{"TagName":"a","Data":"English terms"},{"TagName":"a","Data":"Insular area"},{"TagName":"a","Data":"Local government area"},{"TagName":"a","Data":"Special area"},{"TagName":"a","Data":"Unincorporated area"},{"TagName":"a","Data":"Unorganized area"},{"TagName":"a","Data":"Borough"},{"TagName":"a","Data":"County borough"},{"TagName":"a","Data":"Metropolitan borough"},{"TagName":"a","Data":"Canton"},{"TagName":"a","Data":"Half-canton"},{"TagName":"a","Data":"Capital"},{"TagName":"a","Data":"Federal capital"},{"TagName":"a","Data":"Imperial capital"},{"TagName":"a","Data":"City"},{"TagName":"a","Data":"Autonomous city"},{"TagName":"a","Data":"Charter city"},{"TagName":"a","Data":"Independent city"},{"TagName":"a","Data":"Incorporated city"},{"TagName":"a","Data":"Imperial city"},{"TagName":"a","Data":"Free imperial city"},{"TagName":"a","Data":"Royal free city"},{"TagName":"a","Data":"Community"},{"TagName":"a","Data":"Autonomous community"},{"TagName":"a","Data":"Residential community"},{"TagName":"a","Data":"County"},{"TagName":"a","Data":"Administrative county"},{"TagName":"a","Data":"Autonomous county"},{"TagName":"a","Data":"Consolidated city-county"},{"TagName":"a","Data":"County seat"},{"TagName":"a","Data":"County town"},{"TagName":"a","Data":"Metropolitan county"},{"TagName":"a","Data":"Non-metropolitan county"},{"TagName":"a","Data":"Regional county municipality"},{"TagName":"a","Data":"Viscounty"},{"TagName":"a","Data":"Country"},{"TagName":"a","Data":"Overseas country"},{"TagName":"a","Data":"Department"},{"TagName":"a","Data":"Overseas department"},{"TagName":"a","Data":"District"},{"TagName":"a","Data":"Capital district"},{"TagName":"a","Data":"City district"},{"TagName":"a","Data":"Congressional district"},{"TagName":"a","Data":"Electoral district"},{"TagName":"a","Data":"Federal district"},{"TagName":"a","Data":"Indian government district"},{"TagName":"a","Data":"Land district"},{"TagName":"a","Data":"Local government district"},{"TagName":"a","Data":"Metropolitan district"},{"TagName":"a","Data":"Non-metropolitan district"},{"TagName":"a","Data":"Military district"},{"TagName":"a","Data":"Municipal district"},{"TagName":"a","Data":"Police district"},{"TagName":"a","Data":"Regional district"},{"TagName":"a","Data":"Rural district"},{"TagName":"a","Data":"Sanitary district"},{"TagName":"a","Data":"Educational service district"},{"TagName":"a","Data":"Local service district"},{"TagName":"a","Data":"School district"},{"TagName":"a","Data":"Intermediate school district"},{"TagName":"a","Data":"Special district"},{"TagName":"a","Data":"in the US"},{"TagName":"a","Data":"Urban district"},{"TagName":"a","Data":"Division"},{"TagName":"a","Data":"Census division"},{"TagName":"a","Data":"Police division"},{"TagName":"a","Data":"Subdivision of India"},{"TagName":"a","Data":"Indian reservation"},{"TagName":"a","Data":"Indian reserve"},{"TagName":"a","Data":"Municipality"},{"TagName":"a","Data":"City municipality"},{"TagName":"a","Data":"County municipality"},{"TagName":"a","Data":"Direct-controlled municipality"},{"TagName":"a","Data":"District municipality"},{"TagName":"a","Data":"Neutral municipality"},{"TagName":"a","Data":"Regional municipality"},{"TagName":"a","Data":"Resort municipality"},{"TagName":"a","Data":"Mountain resort municipality"},{"TagName":"a","Data":"Rural municipality"},{"TagName":"a","Data":"Specialized municipality"},{"TagName":"a","Data":"Prefecture"},{"TagName":"a","Data":"Autonomous prefecture"},{"TagName":"a","Data":"Subprefecture"},{"TagName":"a","Data":"Super-prefecture"},{"TagName":"a","Data":"Praetorian prefecture"},{"TagName":"a","Data":"Province"},{"TagName":"a","Data":"Autonomous province"},{"TagName":"a","Data":"Overseas province"},{"TagName":"a","Data":"Roman province"},{"TagName":"a","Data":"Region"},{"TagName":"a","Data":"Special administrative region"},{"TagName":"a","Data":"Autonomous region"},{"TagName":"a","Data":"Capital region"},{"TagName":"a","Data":"National capital region"},{"TagName":"a","Data":"Development region"},{"TagName":"a","Data":"Mesoregion"},{"TagName":"a","Data":"Microregion"},{"TagName":"a","Data":"Overseas region"},{"TagName":"a","Data":"Subregion"},{"TagName":"a","Data":"State"},{"TagName":"a","Data":"Proto-state"},{"TagName":"a","Data":"City-state"},{"TagName":"a","Data":"Federal state"},{"TagName":"a","Data":"Free state"},{"TagName":"a","Data":"Sovereign state"},{"TagName":"a","Data":"Territory"},{"TagName":"a","Data":"Capital territory"},{"TagName":"a","Data":"Federal capital territory"},{"TagName":"a","Data":"National capital territory"},{"TagName":"a","Data":"Dependent territory"},{"TagName":"a","Data":"Federal territory"},{"TagName":"a","Data":"Incorporated territory"},{"TagName":"a","Data":"Organized incorporated territory"},{"TagName":"a","Data":"Overseas territory"},{"TagName":"a","Data":"Union territory"},{"TagName":"a","Data":"Town"},{"TagName":"a","Data":"Census town"},{"TagName":"a","Data":"Market town"},{"TagName":"a","Data":"Township"},{"TagName":"a","Data":"Charter township"},{"TagName":"a","Data":"Civil township"},{"TagName":"a","Data":"Paper township"},{"TagName":"a","Data":"Survey township"},{"TagName":"a","Data":"Urban township"},{"TagName":"a","Data":"Regional unit"},{"TagName":"a","Data":"Autonomous territorial unit"},{"TagName":"a","Data":"Exclusive economic zone"},{"TagName":"a","Data":"Free economic zone"},{"TagName":"a","Data":"Special economic zone"},{"TagName":"a","Data":"Exclusion zone"},{"TagName":"a","Data":"Military exclusion zone"},{"TagName":"a","Data":"Free speech zone"},{"TagName":"a","Data":"Neutral zone"},{"TagName":"a","Data":"Self-administered zone"},{"TagName":"a","Data":"Free-trade zone"},{"TagName":"a","Data":"Alpine resort"},{"TagName":"a","Data":"Bailiwick"},{"TagName":"a","Data":"Banner"},{"TagName":"a","Data":"Autonomous"},{"TagName":"a","Data":"Block"},{"TagName":"a","Data":"Cadastre"},{"TagName":"a","Data":"Circle"},{"TagName":"a","Data":"Circuit"},{"TagName":"a","Data":"Colony"},{"TagName":"a","Data":"Commune"},{"TagName":"a","Data":"Condominium"},{"TagName":"a","Data":"Constituency"},{"TagName":"a","Data":"Duchy"},{"TagName":"a","Data":"District"},{"TagName":"a","Data":"Eldership"},{"TagName":"a","Data":"Emirate"},{"TagName":"a","Data":"Federal dependency"},{"TagName":"a","Data":"Governorate"},{"TagName":"a","Data":"Hamlet"},{"TagName":"a","Data":"Manor"},{"TagName":"a","Data":"Royal"},{"TagName":"a","Data":"Muftiate"},{"TagName":"a","Data":"Neighbourhood"},{"TagName":"a","Data":"Parish"},{"TagName":"a","Data":"Precinct"},{"TagName":"a","Data":"Principality"},{"TagName":"a","Data":"Protectorate"},{"TagName":"a","Data":"Quarter"},{"TagName":"a","Data":"Regency"},{"TagName":"a","Data":"Autonomous republic"},{"TagName":"a","Data":"Riding"},{"TagName":"a","Data":"Sector"},{"TagName":"a","Data":"Autonomous"},{"TagName":"a","Data":"Shire"},{"TagName":"a","Data":"Sultanate"},{"TagName":"a","Data":"Suzerainty"},{"TagName":"a","Data":"Townland"},{"TagName":"a","Data":"Village"},{"TagName":"a","Data":"Summer"},{"TagName":"a","Data":"Ward"},{"TagName":"a","Data":"Agency"},{"TagName":"a","Data":"Barony"},{"TagName":"a","Data":"Burgh"},{"TagName":"a","Data":"Exarchate"},{"TagName":"a","Data":"Hide"},{"TagName":"a","Data":"Hundred"},{"TagName":"a","Data":"Imperial Circle"},{"TagName":"a","Data":"March"},{"TagName":"a","Data":"Monthon"},{"TagName":"a","Data":"Presidency"},{"TagName":"a","Data":"Residency"},{"TagName":"a","Data":"Roman diocese"},{"TagName":"a","Data":"Seat"},{"TagName":"a","Data":"Tenth"},{"TagName":"a","Data":"Tithing"},{"TagName":"a","Data":"Amt"},{"TagName":"a","Data":"Apskritis"},{"TagName":"a","Data":"Bakhsh"},{"TagName":"a","Data":"Barangay"},{"TagName":"a","Data":"Bashki"},{"TagName":"a","Data":"Bezirk"},{"TagName":"a","Data":"Regierungsbezirk"},{"TagName":"a","Data":"Comarca"},{"TagName":"a","Data":"Comune"},{"TagName":"a","Data":"Frazione"},{"TagName":"a","Data":"Freguesia"},{"TagName":"a","Data":"Fu"},{"TagName":"a","Data":"Austria"},{"TagName":"a","Data":"Germany"},{"TagName":"a","Data":"South Tyrol"},{"TagName":"a","Data":"Switzerland"},{"TagName":"a","Data":"Gemeente"},{"TagName":"a","Data":"Gmina"},{"TagName":"a","Data":"Hromada"},{"TagName":"a","Data":"Județ"},{"TagName":"a","Data":"Kampong"},{"TagName":"a","Data":"Finland"},{"TagName":"a","Data":"Sweden"},{"TagName":"a","Data":"Län (Sweden)"},{"TagName":"a","Data":"Finland"},{"TagName":"a","Data":"Località"},{"TagName":"a","Data":"Maakunta"},{"TagName":"a","Data":"Megye"},{"TagName":"a","Data":"Muban"},{"TagName":"a","Data":"Mukim"},{"TagName":"a","Data":"Njësi administrative"},{"TagName":"a","Data":"Oblast"},{"TagName":"a","Data":"Autonomous"},{"TagName":"a","Data":"Okrug"},{"TagName":"a","Data":"Ostān"},{"TagName":"a","Data":"Poblacion"},{"TagName":"a","Data":"Purok"},{"TagName":"a","Data":"Qark"},{"TagName":"a","Data":"Raion"},{"TagName":"a","Data":"Savivaldybė"},{"TagName":"a","Data":"Seniūnija"},{"TagName":"a","Data":"Shahrestān"},{"TagName":"a","Data":"Sum"},{"TagName":"a","Data":"China"},{"TagName":"a","Data":"Sýsla"},{"TagName":"a","Data":"Tehsil"},{"TagName":"a","Data":"Vingtaine"},{"TagName":"a","Data":"Commote"},{"TagName":"a","Data":"Gau"},{"TagName":"a","Data":"Heerlijkheid"},{"TagName":"a","Data":"Komunë"},{"TagName":"a","Data":"Köping"},{"TagName":"a","Data":"Korale"},{"TagName":"a","Data":"Län/Lääni"},{"TagName":"a","Data":"Sweden"},{"TagName":"a","Data":"Landskommun"},{"TagName":"a","Data":"Maalaiskunta"},{"TagName":"a","Data":"Egypt"},{"TagName":"a","Data":"Greece"},{"TagName":"a","Data":"Pagus"},{"TagName":"a","Data":"Pargana"},{"TagName":"a","Data":"Plasă"},{"TagName":"a","Data":"Rreth"},{"TagName":"a","Data":"Satrapy"},{"TagName":"a","Data":"Socken"},{"TagName":"a","Data":"Subah"},{"TagName":"a","Data":"Syssel"},{"TagName":"a","Data":"Zhou"},{"TagName":"a","Data":"Census division"},{"TagName":"a","Data":"Electoral district"},{"TagName":"a","Data":"List of administrative divisions by country"},{"TagName":"a","Data":"Slavic administrative divisions"}]