[{"TagName":"a","Data":"project content guideline"},{"TagName":"a","Data":"common sense"},{"TagName":"a","Data":"occasional exceptions"},{"TagName":"a","Data":"consensus"},{"TagName":"a","Data":"talk page"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:PROJGUIDE"},{"TagName":"a","Data":"WP:COUNCIL/G"},{"TagName":"a","Data":"Wikipedia guidelines"},{"TagName":"a","Data":"Guidelines list"},{"TagName":"a","Data":"Policies list"},{"TagName":"a","Data":"Behavioral"},{"TagName":"a","Data":"Assume good faith"},{"TagName":"a","Data":"Conflict of interest"},{"TagName":"a","Data":"Courtesy vanishing"},{"TagName":"a","Data":"Disruptive editing"},{"TagName":"a","Data":"Don't bite the newcomers"},{"TagName":"a","Data":"Don't disrupt to make a point"},{"TagName":"a","Data":"Etiquette"},{"TagName":"a","Data":"Gaming the system"},{"TagName":"a","Data":"User pages"},{"TagName":"a","Data":"Other behavioral guidelines"},{"TagName":"a","Data":"WMF friendly space policy"},{"TagName":"a","Data":"Discussions"},{"TagName":"a","Data":"Talk page guidelines"},{"TagName":"a","Data":"Signatures"},{"TagName":"a","Data":"Content"},{"TagName":"a","Data":"Citing sources"},{"TagName":"a","Data":"External links"},{"TagName":"a","Data":"Reliable sources"},{"TagName":"a","Data":"medicine"},{"TagName":"a","Data":"Fringe theories"},{"TagName":"a","Data":"Non-free content"},{"TagName":"a","Data":"Offensive material"},{"TagName":"a","Data":"Don't copy long texts"},{"TagName":"a","Data":"Don't create hoaxes"},{"TagName":"a","Data":"Patent nonsense"},{"TagName":"a","Data":"Other content guidelines"},{"TagName":"a","Data":"Editing"},{"TagName":"a","Data":"Article size"},{"TagName":"a","Data":"Be bold"},{"TagName":"a","Data":"Edit summary"},{"TagName":"a","Data":"Understandability"},{"TagName":"a","Data":"Other editing guidelines"},{"TagName":"a","Data":"Organization"},{"TagName":"a","Data":"Categories, lists, templates"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Disambiguation"},{"TagName":"a","Data":"Style"},{"TagName":"a","Data":"Manual of Style"},{"TagName":"a","Data":"contents"},{"TagName":"a","Data":"lists"},{"TagName":"a","Data":"tables"},{"TagName":"a","Data":"Deletion"},{"TagName":"a","Data":"Deletion process"},{"TagName":"a","Data":"Speedy keep"},{"TagName":"a","Data":"Deletion guidelines for administrators"},{"TagName":"a","Data":"Project content"},{"TagName":"a","Data":"Project pages"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"Templates"},{"TagName":"a","Data":"User pages"},{"TagName":"a","Data":"User boxes"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"Subpages"},{"TagName":"a","Data":"Other"},{"TagName":"a","Data":"Naming conventions"},{"TagName":"a","Data":"Notability"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"p","Data":"A WikiProject is a group of people who want to work as a team to improve Wikipedia. This guideline outlines the accepted practices for starting and maintaining WikiProjects, as well as some tips for how to organize WikiProjects effectively. For more detailed instructions on how to start a WikiProject, see Wikipedia:WikiProject Council/Guide/WikiProject.\n"},{"TagName":"a","Data":"guideline"},{"TagName":"a","Data":"Wikipedia:WikiProject Council/Guide/WikiProject"},{"TagName":"h2","Data":"What is a WikiProject?"},{"TagName":"a","Data":"FAQs about WikiProjects"},{"TagName":"a","Data":""},{"TagName":"a","Data":"WikiProject Council"},{"TagName":"a","Data":"FAQs"},{"TagName":"a","Data":"Overview"},{"TagName":"a","Data":"+"},{"TagName":"a","Data":"talk"},{"TagName":"a","Data":"Council page"},{"TagName":"a","Data":"Guidelines"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"Task forces"},{"TagName":"a","Data":"Assessment FAQ"},{"TagName":"a","Data":"Technical notes"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"Proposals"},{"TagName":"a","Data":"Signpost"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"p","Data":"A WikiProject is a group of editors interested in collaborating on a specific topic within Wikipedia. A WikiProject is a group of people, not a set of pages, a subject area, a list of tasks, or a category. The pages of a WikiProject serve as a central place for coordination, discussion, and organization of the group's activities related to the specific topic. WikiProject pages may be used to develop criteria, maintain various collaborative processes, keep track of work that needs to be done, and act as a forum where relevant issues may be discussed.\n"},{"TagName":"a","Data":"WikiProject"},{"TagName":"a","Data":"group of editors"},{"TagName":"p","Data":"A WikiProject may also help build ties between Wikipedians interested in a topic, and the broader community interested in that topic: establishing partnerships, mentoring new Wikipedians, etc. In this respect, the role of a WikiProject may overlap with the role of a Wikimedia chapter, thematic organization, or user group.\n"},{"TagName":"a","Data":"Wikimedia chapter"},{"TagName":"a","Data":"thematic organization"},{"TagName":"a","Data":"user group"},{"TagName":"p","Data":"A WikiProject is fundamentally a social construct: its success depends on its ability to function as a cohesive group of editors working towards a common goal. Much of the work that participants do to sustain a successful WikiProject (quality assessment, peer review, coordination of volunteer editors, etc.) can be tedious, unrewarding, and unappreciated. To be effective, a WikiProject must foster an esprit de corps among its participants. When group cohesion is maintained—where, in other words, project participants are willing to share in the less exciting work—a WikiProject can muster the energy and direction to produce excellent articles systematically rather than incidentally.\n"},{"TagName":"a","Data":"esprit de corps"},{"TagName":"h2","Data":"Creating a WikiProject"},{"TagName":"p","Data":"WikiProjects exist in the project namespace and can technically be started by any auto-confirmed user. However, to avoid the proliferation of unused and underutilized WikiProjects, it is strongly recommended that those interested in starting a WikiProject read the guidance below and propose their project at the proposal page.\n"},{"TagName":"a","Data":"project namespace"},{"TagName":"a","Data":"auto-confirmed user"},{"TagName":"a","Data":"proposal page"},{"TagName":"h3","Data":"Before you begin"},{"TagName":"p","Data":"Interested in starting a WikiProject? First, check to see if the project (or related projects) already exist(s). You can browse existing projects at the manual directory and the automatically curated directory as well as the WikiProject list maintained by Bamyers99. Additionally, you can use the searchbox below to text search for existing pages in the project space:\n"},{"TagName":"a","Data":"manual directory"},{"TagName":"a","Data":"automatically curated directory"},{"TagName":"a","Data":"WikiProject list"},{"TagName":"a","Data":"Bamyers99"},{"TagName":"p","Data":"If your project doesn't already exist, it's time to look for editors with similar interests. This is the most important step.  You must find people who want to work together on the project with you. The first stop should be to look for projects with similar interests (if any exist). Use the directories above or check the talk pages of related articles for projects with interests that overlap with yours. Post at the talk pages for those similar projects asking if editors are interested in your starting a project focused on your topic. If you can't find other editors with similar interests, consider participating in a current project instead. Single-editor projects tend to have short lives.\n"},{"TagName":"p","Data":"If your project idea fits within another existing project (e.g. you want to start Wikipedia:WikiProject Hockey Arenas when Wikipedia:WikiProject Hockey already exists), and you're concerned coordination on this topic would either overwhelm the existing project's talk page, or be overwhelmed by it, consider organizing as a task force under that existing project instead. This would drastically reduce the amount of setup and maintenance required to keep the project pages functioning.\n"},{"TagName":"a","Data":"Wikipedia:WikiProject Hockey Arenas"},{"TagName":"a","Data":"Wikipedia:WikiProject Hockey"},{"TagName":"a","Data":"task force"},{"TagName":"p","Data":"If you're having trouble finding interested editors, consider that the scope of your proposed project may be too narrow. Wikipedia is a huge place with many draws on editors' attention; finding several long-term editors with a sustained interest in one topic may not be easy. Projects with overly narrow scopes tend to become inactive due to lack of editors, not enough associated encyclopedia pages for sustained effort, or competing with a broader-scoped more popular project that draws the time of interested editors. Broadening the proposed scope may help to bring in more pages and editors; although a scope too broad may fail to interest editors who wish to collaborate on only a subset of your topic.\n"},{"TagName":"h3","Data":"Proposing a project"},{"TagName":"p","Data":"If the project doesn't yet exist, but you've found interested editors, it's time to propose your project idea! Go to the WikiProject proposals page and search that page and its archives to see if your project idea has been proposed before (if it has, be prepared to justify why you feel this time the project will succeed). Follow the instructions on that page to create a proposal. You'll need to list the pages and categories that are key to your proposed group, as well as current WikiProjects that relate to those pages. Then interested users will sign-up to support the project (feel free to advertise this at related projects or pages. Canvassing is not a concern here; however, filling the support roles with new accounts is unlikely to lead to a sustainable project). While there are no hard rules for what constitutes \"sufficient\" support, projects that are likely to succeed tend to start with at least 6 to 12 active Wikipedians. Once that threshold is reached, the proposal can be considered successful and the project created (see below). If there is insufficient support to start the project after a few months, the proposal will generally be archived for future reference.\n"},{"TagName":"a","Data":"WikiProject proposals"},{"TagName":"a","Data":"archives"},{"TagName":"a","Data":"create a proposal"},{"TagName":"a","Data":"categories"},{"TagName":"a","Data":"Canvassing"},{"TagName":"a","Data":"archived"},{"TagName":"h3","Data":"Create the WikiProject"},{"TagName":"p","Data":"Creating a WikiProject is technically as easy as starting a page titled Wikipedia:WikiProject Your Favorite Topic. However, various tools have been developed to help WikiProjects keep track of pages of interest and to facilitate collaboration on improving the encyclopedia coverage of a topic area. Getting a new project set up utilizing these tools is a slightly complicated process; detailed instructions can be found at Wikipedia:WikiProject Council/Guide/WikiProject. Additionally, you may ask at Wikipedia talk:WikiProject Council where interested experienced editors may be willing to help.\n"},{"TagName":"a","Data":"Wikipedia:WikiProject Your Favorite Topic"},{"TagName":"a","Data":"Wikipedia:WikiProject Council/Guide/WikiProject"},{"TagName":"a","Data":"Wikipedia talk:WikiProject Council"},{"TagName":"h3","Data":"Task force"},{"TagName":"p","Data":"Based on discussion at a WikiProject proposal or at a given WikiProject, you may instead wish to start a task force under an existing WikiProject. A task force is a group of editors interested in a smaller part of a WikiProject's scope (e.g. United States military history task force is under the Military history WikiProject). Creating a task force gives those editors space to collaborate on the part of the WikiProject scope they are interested in, without drowning out broader discussion on the WikiProject's talk page. Additionally, task forces tend to have reduced administrative overhead, as they can use the tools and templates already developed for the parent WikiProject. Instructions for how to setup a new task force are at Wikipedia:WikiProject Council/Guide/Task forces.\n"},{"TagName":"a","Data":"task force"},{"TagName":"a","Data":"United States military history task force"},{"TagName":"a","Data":"Military history WikiProject"},{"TagName":"a","Data":"Wikipedia:WikiProject Council/Guide/Task forces"},{"TagName":"h2","Data":"General principles"},{"TagName":"h3","Data":"Tagging pages with WikiProject banners"},{"TagName":"p","Data":"Many WikiProjects use talk page banners to mark certain pages as within the scope of the WikiProject. This helps the WikiProjects to organize their progress improving pages within the project's scope. Additionally, talk page banners may point interested editors towards relevant WikiProjects where they might become involved, or just ask a question about an article. Consequently, pages should only be marked with WikiProject banners for projects that intend to support the tagged pages. Pages of broad interest may fall within the scopes of several projects, and may therefore have several project banners on their talk page (these banners are often collapsed to be less visible with {{WikiProjectBannerShell}}). In general, one should not attempt to police which projects are sufficiently relevant to place their banners on a given talk page.[1] Conversely, projects that place their banners on a talk page have no special ownership over that page, and the consensus of project participants can be overruled by a broader consensus at a more visible forum. \n\n"},{"TagName":"a","Data":"talk page banners"},{"TagName":"a","Data":"WikiProjectBannerShell"},{"TagName":"a","Data":"[1]"},{"TagName":"a","Data":"ownership"},{"TagName":"a","Data":"consensus"},{"TagName":"h3","Data":"WikiProjects define their scopes"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:PROJSCOPE"},{"TagName":"a","Data":"WP:OVERBANNER"},{"TagName":"a","Data":"WP:SCOPEWAR"},{"TagName":"a","Data":"WP:PROJGUIDE#OWN"},{"TagName":"p","Data":"Many editors place banners on behalf of WikiProjects in which they are not participants. This practice is normally welcomed by WikiProjects as it brings to their attention new and interesting articles. Be judicious in making such placements by carefully reviewing the scope of the project. Information about the project's scope is often available on the WikiProject's main page, and sometimes also on documentation associated with the template. All editors should avoid tagging an article with a disruptive number of WikiProject banners. If an article is only tangentially related to the scope of a WikiProject, then please do not place that project's banner on the article. For example, washing toys for babies reduces transmission of some diseases, but the banners for WP:WikiProject Health and fitness, WP:WikiProject Biology, WP:WikiProject Viruses and/or WP:WikiProject Medicine do not need to be added to Talk:Toy. If you are uncertain that the placement will be welcomed, leave a note on the project's talk page instead of placing the banner yourself. Note that for projects involved in the WP:1.0 assessment program (which is most of them), every banner placed is a demand for an assessment according to the project's guidelines. It is more friendly to omit outside WikiProjects that you think will rate the article as low importance relative to their specific field.\n"},{"TagName":"a","Data":"toys"},{"TagName":"a","Data":"WP:WikiProject Health and fitness"},{"TagName":"a","Data":"WP:WikiProject Biology"},{"TagName":"a","Data":"WP:WikiProject Viruses"},{"TagName":"a","Data":"WP:WikiProject Medicine"},{"TagName":"a","Data":"Talk:Toy"},{"TagName":"a","Data":"WP:1.0"},{"TagName":"p","Data":"If you place a banner for a WikiProject in which you do not participate, and one of its regular participants removes it, do not re-add the banner without discussion. A WikiProject's participants define the scope of their project (the articles that they volunteer to track and support), which includes defining an article as being outside the scope of the project. Similarly, if a WikiProject says that an article is within their scope, do not edit war to remove the banner.[2]\n"},{"TagName":"a","Data":"volunteer"},{"TagName":"a","Data":"edit war"},{"TagName":"a","Data":"[2]"},{"TagName":"h3","Data":"Advice pages"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:PROJPAGE"},{"TagName":"a","Data":"WP:ADVICEPAGE"},{"TagName":"a","Data":"Wikipedia:Essays"},{"TagName":"a","Data":"Wikipedia:Policy writing is hard"},{"TagName":"p","Data":"Many large WikiProjects collect advice about how to apply Wikipedia's policies and guidelines to their specific subject area. This advice, sometimes in a separate advice page, sometimes in a section of the WikiProject's main page, is often excellent, and may helpfully consolidate and explain the specific details of many site-wide policies and guidelines, the application of which to a particular context might otherwise cause confusion among editors. A separate-page example is Wikipedia:WikiProject Cycling/Notability. A page-section example is Wikipedia:WikiProject Bibliographies#Recommended structure.\n"},{"TagName":"a","Data":"policies and guidelines"},{"TagName":"a","Data":"Wikipedia:WikiProject Cycling/Notability"},{"TagName":"a","Data":"Wikipedia:WikiProject Bibliographies#Recommended structure"},{"TagName":"p","Data":"Editors who are working on such an advice page or section are encouraged to carefully study the main policies, guidelines, and relevant well-accepted general Wikipedia essays. The good advice pages do not conflict with the site-wide pages, and avoid unnecessary duplication of material from them. \n"},{"TagName":"p","Data":"WikiProject advice can best help editors by providing: subject-specific considerations in applying site-wide standards; links to subject-specific templates; a list of information that editors should consider including in a given type of article; relevant examples; and clear explanations (e.g., reasons why editors recommend \"this\" instead of \"that\"). Well-written WikiProject advice material also takes into account the fact that most articles are within the scope of multiple WikiProjects, and seeks to avoid conflicting advice, which can lead to unproductive \"territorial\" disputes between projects, and between projects and editors with WikiProject-unrelated editing concerns.\n"},{"TagName":"p","Data":"However, in a few cases, projects have wrongly used these pages as a means of asserting ownership over articles within their scope, such as insisting that all articles that interest the project must contain a criticism section or must not contain an infobox, or that a specific type of article can't be linked in navigation templates, and that other editors of the article get no say in this because of a \"consensus\" within the project.  An advice page written by several participants of a project is a \"local consensus\" that is no more binding on editors than material written by any single individual editor. Any advice page that has not been formally approved by the community through the WP:PROPOSAL process has the actual status of an optional essay. Contents of WikiProject advice pages that contradict widespread consensus belong in the user namespace.\n"},{"TagName":"a","Data":"ownership over articles"},{"TagName":"a","Data":"a criticism section"},{"TagName":"a","Data":"an infobox"},{"TagName":"a","Data":"navigation templates"},{"TagName":"a","Data":"\"local consensus\" that is no more binding"},{"TagName":"a","Data":"WP:PROPOSAL"},{"TagName":"a","Data":"essay"},{"TagName":"a","Data":"user namespace"},{"TagName":"p","Data":"Some important site-wide topical guidelines, such as Wikipedia:Identifying reliable sources (medicine), and Wikipedia:Notability (books), originally began as advice pages written by WikiProjects.  However, after being adopted by the community, they are no longer WikiProject advice pages and have the same status as any other guideline.  When this happens, the WikiProject's participants cede any notion of control over the page, and everyone in the community participates equally in further development of the guidelines. Such pages move out from under their original \"Wikipedia:WikiProject Something/\" path. \n"},{"TagName":"a","Data":"Wikipedia:Identifying reliable sources (medicine)"},{"TagName":"a","Data":"Wikipedia:Notability (books)"},{"TagName":"p","Data":"The following templates are available to WikiProjects for clarifying the distinction between WikiProject advice and Wikipedia-wide guidelines:\n"},{"TagName":"a","Data":"WikiProject advice"},{"TagName":"a","Data":"WikiProject style advice"},{"TagName":"a","Data":"WikiProject notability advice"},{"TagName":"a","Data":"WikiProject content advice"},{"TagName":"h3","Data":"Role of the WikiProject Council"},{"TagName":"p","Data":"There may still arise situations when there is a seemingly intractable disagreement between projects. If that happens, you can ask for advice from the WikiProject Council. This group contains people who have generally shown some ability at working with and in groups. In severe cases, formal dispute resolution channels are available.\n"},{"TagName":"a","Data":"WikiProject Council"},{"TagName":"a","Data":"dispute resolution"},{"TagName":"h2","Data":"Tools for WikiProjects"},{"TagName":"p","Data":"The community has developed a broad array of tools to help WikiProjects manage the articles that they're interested in. Actively maintained tools are listed below, as well as instructions for how to utilize them:\n"},{"TagName":"h3","Data":"Recruiting editors"},{"TagName":"a","Data":"manually maintained"},{"TagName":"a","Data":"instructions"},{"TagName":"a","Data":"Category:WikiProjects"},{"TagName":"a","Data":"Category:WikiProject Birds"},{"TagName":"a","Data":"Category:Biology WikiProjects"},{"TagName":"a","Data":"Wikipedia:WikiProject Directory"},{"TagName":"a","Data":"Reports bot"},{"TagName":"a","Data":"WikiProject status"},{"TagName":"a","Data":"Category:Active WikiProjects"},{"TagName":"a","Data":"Wikipedia:WikiProject Directory"},{"TagName":"a","Data":"Reports bot"},{"TagName":"a","Data":"WikiProject Birds"},{"TagName":"h3","Data":"General"},{"TagName":"a","Data":"WP 1.0 bot"},{"TagName":"a","Data":"here"},{"TagName":"a","Data":"AlexNewArtBot"},{"TagName":"a","Data":"InceptionBot"},{"TagName":"a","Data":"example"},{"TagName":"a","Data":"here"},{"TagName":"a","Data":"the bot operator's talk page"},{"TagName":"a","Data":"watchlist"},{"TagName":"a","Data":"Special:RecentChangesLinked"},{"TagName":"a","Data":"User:SQLBot"},{"TagName":"a","Data":"User:Femto Bot"},{"TagName":"a","Data":"WikiProject Firearms/Watchlist"},{"TagName":"a","Data":"Article Alerts"},{"TagName":"a","Data":"WP:Articles for deletion"},{"TagName":"a","Data":"WP:Proposed deletions"},{"TagName":"a","Data":"WP:AALERTS"},{"TagName":"a","Data":"Wikipedia:Article alerts/Subscribing"},{"TagName":"a","Data":"Popular pages bot"},{"TagName":"a","Data":"example"},{"TagName":"a","Data":"here"},{"TagName":"a","Data":"Evad37's rater script"},{"TagName":"a","Data":"here"},{"TagName":"h3","Data":"Tracking progress"},{"TagName":"a","Data":"CleanupWorklistBot"},{"TagName":"a","Data":"example"},{"TagName":"a","Data":"here"},{"TagName":"a","Data":"JL-Bot"},{"TagName":"a","Data":"User:JL-Bot/Project content"},{"TagName":"h2","Data":"Dealing with inactive WikiProjects"},{"TagName":"a","Data":"Wikipedia:WikiProject Council/Inactive projects"},{"TagName":"a","Data":"Wikipedia:Project namespace § Deletion of project pages"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:INACTIVEWP"},{"TagName":"p","Data":"Many WikiProjects fall inactive or semi-active  because they have a lack of interested editors or they simply  have served their initial purpose. Many small scope projects fall inactive or semi-active after establishing an organizational structure, advice pages, content assessment system, layout and inclusion  standards, reliable sources, and navigational aids. These projects are retained for reference as they may be viable because they provide topic-specific considerations of the many site-wide policies and guidelines that still apply to a subset of articles.\n"},{"TagName":"a","Data":"advice pages"},{"TagName":"a","Data":"content assessment system"},{"TagName":"h3","Data":"Identifying"},{"TagName":"p","Data":"While inactive projects do no harm to the encyclopedia, it may be beneficial to tag them as inactive, in order to divert interested editors to more active projects on similar topics. Projects are generally considered inactive if the talk page has received nothing other than routine/automated announcements or unanswered queries for a year or more. To verify that a project is inactive, post on its talk page asking if anyone minds marking it as such. If there are no objections, you can add inactive to the {{WikiProject status}} template at the top of the WikiProject page. This will add the project to Category:Inactive WikiProjects and display a message at the top of the page notifying editors of the project's status.\n"},{"TagName":"a","Data":"WikiProject status"},{"TagName":"a","Data":"Category:Inactive WikiProjects"},{"TagName":"p","Data":"Alternatively, a project that has gone inactive because it has served its stated purpose, had an unrealistic scope, or is otherwise unlikely to be ever revived can be marked as \"defunct\" per the instructions at Template:WikiProject status#Usage: Defunct projects. This will generate a more discouraging message, suggesting interested editors look for related projects. Sometimes small, inactive projects are simply merged into larger, more active projects. This could be a good option if you wish for links to the smaller project to now point to the larger project. If there's still an active community at the smaller project, it could instead be merged as a task force of a larger project. Guidance on that can be found here. If an inactive project never seems to have grown beyond its founding, you may consider moving it to the founder's userspace or nominating it for deletion at MfD. In general, medium or larger projects are marked as defunct rather than deleted to preserve the project's history. For more, see Wikipedia:Project namespace#Deletion of project pages.\n"},{"TagName":"a","Data":"Template:WikiProject status#Usage: Defunct projects"},{"TagName":"a","Data":"merged"},{"TagName":"a","Data":"here"},{"TagName":"a","Data":"userspace"},{"TagName":"a","Data":"deletion"},{"TagName":"a","Data":"MfD"},{"TagName":"a","Data":"Wikipedia:Project namespace#Deletion of project pages"},{"TagName":"h3","Data":"Revival"},{"TagName":"a","Data":"Wikipedia:Wikipedia Signpost/2011-05-16/WikiProject report § Back to Life: Reviving WikiProjects"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:REVIVE"},{"TagName":"p","Data":"Any editor may revive an inactive WikiProject by changing the {{WikiProject status}} template parameter to active. The guidance for starting a new WikiProject applies here: WikiProjects are groups of editors; if you can't recruit other editors to the cause, the project will likely become inactive again. If you decide to revive a WikiProject, consider the following tips:\n"},{"TagName":"a","Data":"WikiProject status"},{"TagName":"a","Data":"guidance"},{"TagName":"a","Data":"community bulletin board"},{"TagName":"a","Data":"Signpost WikiProject desk"},{"TagName":"a","Data":"directory"},{"TagName":"a","Data":"generic WikiProject templates"},{"TagName":"a","Data":"Infobox Wikipedia WikiProject"},{"TagName":"a","Data":"to-do lists"},{"TagName":"a","Data":"tasks"},{"TagName":"a","Data":"WikiProject help"},{"TagName":"a","Data":"WikiProject guide"},{"TagName":"a","Data":"Special:RecentChangesLinked"},{"TagName":"a","Data":"Example"},{"TagName":"h2","Data":"Renaming a WikiProject"},{"TagName":"p","Data":"Renaming a WikiProject is not as simple as moving the WikiProject page itself. The steps involved would generally include:\n"},{"TagName":"a","Data":"consensus"},{"TagName":"a","Data":"administrator"},{"TagName":"a","Data":"page mover"},{"TagName":"a","Data":"Special:PageAssessments"},{"TagName":"h2","Data":"See also"},{"TagName":"a","Data":"Wikipedia:WikiProject Council/Guide/Technical notes"},{"TagName":"a","Data":"Wikipedia:Banner standardisation"},{"TagName":"a","Data":"Category:Generic WikiProject templates"},{"TagName":"a","Data":"Wikipedia:Wikipedia Signpost"},{"TagName":"a","Data":"Wikipedia:WikiProject Council/Inactive projects"},{"TagName":"a","Data":"Category:Inactive WikiProjects"},{"TagName":"a","Data":"Category:Defunct WikiProjects"},{"TagName":"h2","Data":"Notes"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"the 2007 discussion"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"large 2010 RfC"},{"TagName":"a","Data":"BLP pages"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"policies and guidelines"},{"TagName":"a","Data":"Five pillars"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"Verifiability"},{"TagName":"a","Data":"No original research"},{"TagName":"a","Data":"Neutral point of view"},{"TagName":"a","Data":"What Wikipedia is not"},{"TagName":"a","Data":"Biographies of living persons"},{"TagName":"a","Data":"Copyright"},{"TagName":"a","Data":"Copyright violations"},{"TagName":"a","Data":"Image use"},{"TagName":"a","Data":"Article titles"},{"TagName":"a","Data":"Notability"},{"TagName":"a","Data":"Autobiography"},{"TagName":"a","Data":"Citing sources"},{"TagName":"a","Data":"Reliable sources"},{"TagName":"a","Data":"Medicine"},{"TagName":"a","Data":"Do not include copies of lengthy primary sources"},{"TagName":"a","Data":"Plagiarism"},{"TagName":"a","Data":"Don't create hoaxes"},{"TagName":"a","Data":"Fringe theories"},{"TagName":"a","Data":"Patent nonsense"},{"TagName":"a","Data":"External links"},{"TagName":"a","Data":"Civility"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Harassment"},{"TagName":"a","Data":"Vandalism"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"No personal attacks"},{"TagName":"a","Data":"Ownership of content"},{"TagName":"a","Data":"Edit warring"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"No legal threats"},{"TagName":"a","Data":"Child protection"},{"TagName":"a","Data":"Paid-contribution disclosure"},{"TagName":"a","Data":"Assume good faith"},{"TagName":"a","Data":"Conflict of interest"},{"TagName":"a","Data":"Disruptive editing"},{"TagName":"a","Data":"Do not disrupt Wikipedia to illustrate a point"},{"TagName":"a","Data":"Etiquette"},{"TagName":"a","Data":"Gaming the system"},{"TagName":"a","Data":"Please do not bite the newcomers"},{"TagName":"a","Data":"Courtesy vanishing"},{"TagName":"a","Data":"Responding to threats of harm"},{"TagName":"a","Data":"Talk page guidelines"},{"TagName":"a","Data":"Signatures"},{"TagName":"a","Data":"Deletion policy"},{"TagName":"a","Data":"Proposed deletion"},{"TagName":"a","Data":"Biographies"},{"TagName":"a","Data":"Criteria for speedy deletion"},{"TagName":"a","Data":"Attack page"},{"TagName":"a","Data":"Oversight"},{"TagName":"a","Data":"Revision deletion"},{"TagName":"a","Data":"Administrators"},{"TagName":"a","Data":"Banning"},{"TagName":"a","Data":"Blocking"},{"TagName":"a","Data":"Page protection"},{"TagName":"a","Data":"Editing policy"},{"TagName":"a","Data":"Article size"},{"TagName":"a","Data":"Summary style"},{"TagName":"a","Data":"Be bold"},{"TagName":"a","Data":"Disambiguation"},{"TagName":"a","Data":"Hatnotes"},{"TagName":"a","Data":"Broad-concept article"},{"TagName":"a","Data":"Understandability"},{"TagName":"a","Data":"Manual of Style"},{"TagName":"a","Data":"Contents"},{"TagName":"a","Data":"Accessibility"},{"TagName":"a","Data":"Dates and numbers"},{"TagName":"a","Data":"Images"},{"TagName":"a","Data":"Layout"},{"TagName":"a","Data":"Lead section"},{"TagName":"a","Data":"Linking"},{"TagName":"a","Data":"Lists"},{"TagName":"a","Data":"Categories, lists, and navigation templates"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Template namespace"},{"TagName":"a","Data":"Project namespace"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"User pages"},{"TagName":"a","Data":"User boxes"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"Subpages"},{"TagName":"a","Data":"Terms of Use"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"Friendly space policy"},{"TagName":"a","Data":"Licensing and copyright"},{"TagName":"a","Data":"Privacy policy"},{"TagName":"a","Data":"List of all policies and guidelines"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"List of guidelines"},{"TagName":"a","Data":"Summaries of values and principles"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":""},{"TagName":"a","Data":"WikiProject Council"},{"TagName":"a","Data":""},{"TagName":"a","Data":"WikiProject guides"},{"TagName":"a","Data":"WikiProject Council"},{"TagName":"a","Data":"Talk"},{"TagName":"a","Data":"Guidelines/Intro"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"Task forces"},{"TagName":"a","Data":"Technical notes"},{"TagName":"a","Data":"Assessment FAQ"},{"TagName":"a","Data":"Work via WikiProjects"},{"TagName":"a","Data":""},{"TagName":"a","Data":"Directories and summaries"},{"TagName":"a","Data":"Directory"},{"TagName":"a","Data":"Proposals"},{"TagName":"a","Data":"Deletion"},{"TagName":"a","Data":"Signpost"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"Popular pages"},{"TagName":"a","Data":"Database reports"},{"TagName":"a","Data":"Watchers"},{"TagName":"a","Data":""},{"TagName":"a","Data":"Culture and the arts"},{"TagName":"a","Data":"Arts"},{"TagName":"a","Data":"Music"},{"TagName":"a","Data":"Performing"},{"TagName":"a","Data":"Plastic"},{"TagName":"a","Data":"Visual"},{"TagName":"a","Data":"Broadcasting"},{"TagName":"a","Data":"Crafts and hobbies"},{"TagName":"a","Data":"Entertainment"},{"TagName":"a","Data":"Games and toys"},{"TagName":"a","Data":"Food and drink"},{"TagName":"a","Data":"Internet culture"},{"TagName":"a","Data":"Language and literature"},{"TagName":"a","Data":"Biography"},{"TagName":"a","Data":"Linguistics"},{"TagName":"a","Data":"Media"},{"TagName":"a","Data":"Philosophy and religion"},{"TagName":"a","Data":"Sports"},{"TagName":"a","Data":""},{"TagName":"a","Data":"Geographical"},{"TagName":"a","Data":"Bodies of water"},{"TagName":"a","Data":"Cities"},{"TagName":"a","Data":"Countries"},{"TagName":"a","Data":"Africa"},{"TagName":"a","Data":"Americas"},{"TagName":"a","Data":"Asia"},{"TagName":"a","Data":"Europe"},{"TagName":"a","Data":"Oceania"},{"TagName":"a","Data":"Landforms"},{"TagName":"a","Data":"Maps"},{"TagName":"a","Data":"Parks, conservation areas and historical sites"},{"TagName":"a","Data":""},{"TagName":"a","Data":"History and society"},{"TagName":"a","Data":"History and society"},{"TagName":"a","Data":"Business and economics"},{"TagName":"a","Data":"Education"},{"TagName":"a","Data":"Military and warfare"},{"TagName":"a","Data":"Politics and government"},{"TagName":"a","Data":"Transportation"},{"TagName":"a","Data":""},{"TagName":"a","Data":"Science, technologyand engineering"},{"TagName":"a","Data":"Science"},{"TagName":"a","Data":"Biology"},{"TagName":"a","Data":"Chemistry"},{"TagName":"a","Data":"Economics"},{"TagName":"a","Data":"Geosciences"},{"TagName":"a","Data":"Information science"},{"TagName":"a","Data":"Mathematics"},{"TagName":"a","Data":"Medicine"},{"TagName":"a","Data":"Meteorology"},{"TagName":"a","Data":"Physics"},{"TagName":"a","Data":"Space"},{"TagName":"a","Data":"Technology"},{"TagName":"a","Data":"Time"},{"TagName":"a","Data":""},{"TagName":"a","Data":"Wikipedia assistanceand tasks"},{"TagName":"a","Data":"Contents systems"},{"TagName":"a","Data":"Maintenance"},{"TagName":"a","Data":"Files"},{"TagName":"a","Data":"Article improvement and grading"},{"TagName":"a","Data":"Classroom projects"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":""}]