[{"TagName":"a","Data":""},{"TagName":"a","Data":"essay"},{"TagName":"a","Data":"Wikipedia's policies or guidelines"},{"TagName":"a","Data":"thoroughly vetted by the community"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:WISDOM"},{"TagName":"h2","Data":"The universe does not revolve around you[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"WP:WORLDWIDE"},{"TagName":"a","Data":"WP:WORLDVIEW"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:WORLD"},{"TagName":"p","Data":"Wikipedia is not a forum or a soapbox.  Editors should remember that their egos are not on the line while they are here at Wikipedia. Please remember that the majority of the editors are human and are prone to mistakes, errors, flared-up emotions and stress.  Editors should remember that the goal is encyclopedic information and should attempt to set aside their egos while they are here at Wikipedia.\n"},{"TagName":"a","Data":"Wikipedia is not a forum or a soapbox"},{"TagName":"p","Data":"While editors' points of view are certainly welcomed, please remember that Wikipedia has a neutral point of view policy with regard to writing articles.  To that effect, editors should work with other editors despite their conflicting egos and points of view.  Through collaboration and presentation of either a neutral point of view or all points of view article, Wikipedia helps to illustrate good information.\n"},{"TagName":"a","Data":"Wikipedia"},{"TagName":"a","Data":"neutral point of view"},{"TagName":"h2","Data":"On Wikipedia and the Cabal[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:TINC"},{"TagName":"a","Data":""},{"TagName":"p","Data":"A common complaint in online communities is that there are groups of users, usually longtime members of the community, who have all the power, make all the decisions, police the behavior of everyone else, and disclaim any responsibility for such actions—a cabal. Cabals are denied even when they are conceded to have existed, as with the \"benevolent\" Backbone cabal at Usenet, which gave rise to the joke expression, There Is No Cabal.\n"},{"TagName":"a","Data":"have all the power"},{"TagName":"a","Data":"police the behavior of everyone else"},{"TagName":"a","Data":"cabal"},{"TagName":"a","Data":"Backbone cabal"},{"TagName":"a","Data":"Usenet"},{"TagName":"a","Data":"There Is No Cabal"},{"TagName":"p","Data":"In many cases, however, belief in a cabal involves the practice of stringing together a chain of outcomes that the accuser did not desire, and assigning a common causation to them. The outcomes may be unrelated, or related only in the sense that they are in line with generally accepted community practices (typically, policy pages) or evolving consensus. It is true that respected editors are influential in the latter; it is not true that they can bend the entire community to their will. Moreover, since such experienced editors are all fluent in the same policy pages, they may appear to be an organised unit.\n"},{"TagName":"a","Data":"policy pages"},{"TagName":"p","Data":"When a newer user starts accusing everyone of being in on a conspiracy, they are typically surprised if the more established Wikipedians band together against them. They may see this as a confirmation of their misplaced suspicions. Especially among their fellow editors and peers, is there really no cabal? A cabal works in secret and avoids claiming responsibility. Wikipedia's editors, as unlikeable and unfair as the ideas and actions of some may seem, cannot be justifiably accused of those attributes. They can call those groups that are a little too human and prominent for their taste a faction if they were into cohesion, or could consider the possibility that you're only political, and have a tendency to confront when their hostility towards all of you lumps you all together.\n"},{"TagName":"a","Data":"cabal"},{"TagName":"a","Data":"too human"},{"TagName":"a","Data":"faction"},{"TagName":"p","Data":"It's much more productive to refute the arguments of the majority through reasoned discussion than imply they are wrong because they are the majority, or implying you are being repressed because they don't agree with you. If you attack people who oppose you as if they were a collective with an agenda against you, then whether they were or not, they will certainly become one. There is no cabal conspiring against you unless you created it.\n"},{"TagName":"p","Data":"Also, consider that if many people disagree with you, it may be just because you are wrong or in violation of the site policies (such as WP:UNDUE).\n"},{"TagName":"a","Data":"WP:UNDUE"},{"TagName":"h3","Data":"There is a cabal[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:TIAC"},{"TagName":"a","Data":"Iron law of oligarchy"},{"TagName":"a","Data":"meta:Power structure"},{"TagName":"a","Data":"meta:Why a cabal is perceived"},{"TagName":"p","Data":"As Wikipedia grows, its governance mechanisms become more complex, and hierarchies of power spring up, both formal (admin, bureaucrat, etc.) and informal (policy wonks, cliques, etc.). Closed decision-making structures, like invite-only IRC channels and mailing lists are used, creating either the appearance or the reality of one or more cabals controlling Wikipedia processes. The Arbitration Committee is an official but limited-access entity on Wikipedia.\n"},{"TagName":"a","Data":"its governance mechanisms become more complex"},{"TagName":"a","Data":"hierarchies of power spring up"},{"TagName":"a","Data":"policy wonks"},{"TagName":"a","Data":"Arbitration Committee"},{"TagName":"h2","Data":"See also[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Wikipedia:Assume good faith"},{"TagName":"a","Data":"Wikipedia:Assume bad faith"},{"TagName":"a","Data":"Wikipedia:Cabals"},{"TagName":"a","Data":"Wikipedia:Conflict of interest"},{"TagName":"a","Data":"Wikipedia:List of cabals"},{"TagName":"a","Data":"Wikipedia:Neutral point of view"},{"TagName":"a","Data":"Wikipedia:Ownership of content"}]