[{"TagName":"a","Data":"Wikipedia:WikiProject Norway"},{"TagName":"a","Data":"Wikipedia:No original research/Noticeboard"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"policy"},{"TagName":"a","Data":"normally"},{"TagName":"a","Data":"consensus"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:OR"},{"TagName":"a","Data":"WP:NOR"},{"TagName":"a","Data":"WP:ORIGINAL"},{"TagName":"a","Data":"does not publish original thought"},{"TagName":"a","Data":"attributable"},{"TagName":"a","Data":"reliable, published source"},{"TagName":"a","Data":"WP:CALC"},{"TagName":"a","Data":"Content policies"},{"TagName":"a","Data":"Neutral point of view"},{"TagName":"a","Data":"No original research"},{"TagName":"a","Data":"Verifiability"},{"TagName":"a","Data":"Article titles"},{"TagName":"a","Data":"Biographies of living persons"},{"TagName":"a","Data":"Image use policy"},{"TagName":"a","Data":"What Wikipedia is not"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":""},{"TagName":"p","Data":"Wikipedia articles must not contain original research. On Wikipedia, original research means material—such as facts, allegations, and ideas—for which no reliable, published source exists.[a] This includes any analysis or synthesis of published material that  reaches or implies a conclusion not stated by the sources. To demonstrate that you are not adding original research, you must be able to cite reliable, published sources that are directly related to the topic of the article and directly support[b] the material being presented.\n"},{"TagName":"a","Data":"Wikipedia"},{"TagName":"a","Data":"reliable, published source"},{"TagName":"a","Data":"[a]"},{"TagName":"a","Data":" reaches or implies a conclusion not stated by the sources"},{"TagName":"a","Data":"[b]"},{"TagName":"p","Data":"The prohibition against original research means that all material added to articles must be verifiable in a reliable, published source, even if not already verified via an inline citation. The verifiability policy says that an inline citation to a reliable source must be provided for all quotations, and for anything challenged or likely to be challenged—but a source must exist even for material that is never challenged.[a] For example, the statement \"the capital of France is Paris\" does not require a source to be cited, nor is it original research, because it's not something you thought up and it is easily verifiable; therefore, no one is likely to object to it and we know that sources exist for it even if they are not cited. The statement is verifiable, even if not verified.\n"},{"TagName":"a","Data":"inline citation"},{"TagName":"a","Data":"verifiability policy"},{"TagName":"a","Data":"challenged or likely to be challenged"},{"TagName":"a","Data":"[a]"},{"TagName":"p","Data":"Despite the need for reliable sources, you must not plagiarize them or violate their copyrights. Rewriting source material in your own words while retaining the substance is not considered original research. \n"},{"TagName":"a","Data":"plagiarize"},{"TagName":"a","Data":"violate their copyrights"},{"TagName":"p","Data":"\"No original research\" (NOR) is one of three core content policies that, along with Neutral point of view and Verifiability, determines the type and quality of material acceptable in articles. Because these policies work in harmony, they should not be interpreted in isolation from one another, and editors should familiarize themselves with all three. For questions about whether any particular edit constitutes original research, see the No original research noticeboard.\n"},{"TagName":"a","Data":"Neutral point of view"},{"TagName":"a","Data":"Verifiability"},{"TagName":"a","Data":"No original research noticeboard"},{"TagName":"p","Data":"This policy does not apply to talk pages and other pages which evaluate article content and sources, such as deletion discussions or policy noticeboards.\n"},{"TagName":"a","Data":"talk pages"},{"TagName":"h2","Data":"Using sources"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:STICKTOSOURCE"},{"TagName":"a","Data":"WP:FOLLOWSOURCE"},{"TagName":"p","Data":"Wikipedia is fundamentally built on research that has been collected and organized from reliable sources, as described in content policies such as this one. If no reliable independent sources can be found on a topic, Wikipedia should not have an article about it. If you discover something new, Wikipedia is not the place to announce such a discovery. \n"},{"TagName":"a","Data":"reliable sources"},{"TagName":"a","Data":"independent sources"},{"TagName":"p","Data":"The best practice is to research the most reliable sources on the topic and summarize what they say in your own words, with each statement in the article being verifiable in a source that makes that statement explicitly. Source material should be carefully summarized or rephrased without changing its meaning or implication. Take care not to go beyond what the sources express or to use them in ways inconsistent with the intention of the source, such as using material out of context. In short, stick to the sources.\n"},{"TagName":"a","Data":"out of context"},{"TagName":"h3","Data":"Reliable sources"},{"TagName":"a","Data":"Wikipedia:Verifiability"},{"TagName":"a","Data":"Wikipedia:Reliable sources"},{"TagName":"p","Data":"Any material challenged or likely to be challenged must be supported by a reliable source. Material for which no reliable source can be found is considered original research. The only way you can show that your edit is not original research is to cite a reliable published source that contains the same material. Even with well-sourced material, if you use it out of context, or to reach or imply a conclusion not directly and explicitly supported by the source, you are engaging in original research; see below.\n"},{"TagName":"a","Data":"likely to be challenged"},{"TagName":"a","Data":"below"},{"TagName":"p","Data":"In general, the most reliable sources are:\n"},{"TagName":"p","Data":"However, note that higher standards than this are required for medical claims.\n"},{"TagName":"a","Data":"medical claims"},{"TagName":"p","Data":"As a rule of thumb, the more people engaged in checking facts, analyzing legal issues, and scrutinizing the writing, the more reliable the publication. Self-published material, whether on paper or online, is generally not regarded as reliable. See self-published sources for exceptions.\n"},{"TagName":"a","Data":"self-published sources"},{"TagName":"p","Data":"Information in an article must be verifiable in the references cited. In general, article statements should not rely on unclear or inconsistent passages or on passing comments. Any passages open to multiple interpretations should be precisely cited or avoided. A summary of extensive discussion should reflect the conclusions of the source. Drawing conclusions not evident in the reference is original research regardless of the type of source. References must be cited in context and on topic.\n"},{"TagName":"a","Data":"verifiable"},{"TagName":"h3","Data":"Primary, secondary and tertiary sources"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:PST"},{"TagName":"a","Data":"WP:PSTS"},{"TagName":"a","Data":"Wikipedia:Identifying and using primary sources"},{"TagName":"a","Data":"Wikipedia:Based upon"},{"TagName":"a","Data":"Wikipedia:Published"},{"TagName":"p","Data":"Wikipedia articles should be based on reliable, published secondary sources, and to a lesser extent, on tertiary sources and primary sources. Secondary or tertiary sources are needed to establish the topic's notability and avoid novel interpretations of primary sources. All analyses and interpretive or synthetic claims about primary sources must be referenced to a secondary or tertiary source and must not be an original analysis of the primary-source material by Wikipedia editors.\n"},{"TagName":"a","Data":"reliable"},{"TagName":"a","Data":"secondary sources"},{"TagName":"a","Data":"tertiary sources"},{"TagName":"a","Data":"primary sources"},{"TagName":"p","Data":"Appropriate sourcing can be a complicated issue, and these are general rules. Deciding whether primary, secondary, or tertiary sources are appropriate in any given instance is a matter of good editorial judgment and common sense, and should be discussed on article talk pages. A source may be considered primary for one statement but secondary for a different one. Even a given source can contain both primary and secondary source material for one particular statement. For the purposes of this policy, primary, secondary and tertiary sources are defined as follows:[c]\n"},{"TagName":"a","Data":"common sense"},{"TagName":"a","Data":"[c]"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:PRIMARY"},{"TagName":"a","Data":"WP:PRIMARYSOURCE"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"WP:PRIMARYTOPIC"},{"TagName":"a","Data":"Primary sources"},{"TagName":"a","Data":"independent sources"},{"TagName":"a","Data":"considered"},{"TagName":"a","Data":"[d]"},{"TagName":"a","Data":"reputably published"},{"TagName":"a","Data":"[e]"},{"TagName":"a","Data":"WP:Biographies of living persons § Avoid misuse of primary sources"},{"TagName":"p","Data":""},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:SECONDARY"},{"TagName":"a","Data":"secondary source"},{"TagName":"a","Data":"Secondary sources are not necessarily independent sources"},{"TagName":"a","Data":"[f]"},{"TagName":"a","Data":"[g]"},{"TagName":"a","Data":"[h]"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:TERTIARY"},{"TagName":"a","Data":"Tertiary sources"},{"TagName":"a","Data":"compendia"},{"TagName":"a","Data":"[i]"},{"TagName":"a","Data":"due weight"},{"TagName":"a","Data":"Category:Wikipedia"},{"TagName":"a","Data":"Category:WikiProject Wikipedia articles"},{"TagName":"h2","Data":"Synthesis of published material"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:SYNTH"},{"TagName":"a","Data":"Wikipedia:What SYNTH is not"},{"TagName":"a","Data":"Wikipedia:Citing sources § Text–source integrity"},{"TagName":"p","Data":"Do not combine material from multiple sources to reach or imply a conclusion not explicitly stated by any source. Similarly, do not combine different parts of one source to reach or imply a conclusion not explicitly stated by the source. If one reliable source says A and another reliable source says B, do not join A and B together to imply a conclusion C not mentioned by either of the sources. This would be improper editorial synthesis of published material to imply a new conclusion, which is original research.[j] \"A and B, therefore, C\" is acceptable only if a reliable source has published the same argument concerning the topic of the article. If a single source says \"A\" in one context, and \"B\" in another, without connecting them, and does not provide an argument of \"therefore C\", then \"therefore C\" cannot be used in any article.\n"},{"TagName":"a","Data":"[j]"},{"TagName":"a","Data":"reliable source"},{"TagName":"p","Data":"Here are two sentences showing simple examples of improper editorial synthesis. Both halves of the first sentence may be reliably sourced but are combined to imply that the UN has failed to maintain world peace. If no reliable source has combined the material in this way, it is original research.\n"},{"TagName":"p","Data":"N The United Nations' stated objective is to maintain international peace and security, but since its creation there have been 160 wars throughout the world.\n"},{"TagName":"p","Data":"In this second sentence, the opposite is implied using the same material, illustrating how easily such material can be manipulated when the sources are not adhered to:\n"},{"TagName":"p","Data":"N The United Nations' stated objective is to maintain international peace and security, and since its creation there have been only 160 wars throughout the world.\n"},{"TagName":"p","Data":"Here are two paragraphs showing more complex examples of editorial synthesis. They are based on an actual Wikipedia article about a dispute between two authors, here called Smith and Jones. This first paragraph is fine because each of the sentences is carefully sourced, using a source that refers to the same dispute:\n"},{"TagName":"p","Data":"Y Smith stated that Jones committed plagiarism by copying references from another author's book. Jones responded that it is acceptable scholarly practice to use other people's books to find new references.\n"},{"TagName":"p","Data":"This second paragraph demonstrates improper editorial synthesis:\n"},{"TagName":"p","Data":"N If Jones did not consult the original sources, this would be contrary to the practice recommended in the Harvard Writing with Sources manual, which requires citation of the source actually consulted. The Harvard manual does not call violating this rule \"plagiarism\". Instead, plagiarism is defined as using a source's information, ideas, words, or structure without citing them.\n"},{"TagName":"p","Data":"The second paragraph is original research because it expresses a Wikipedia editor's opinion that, given the Harvard manual's definition of plagiarism, Jones did not commit it. Making the second paragraph policy-compliant would require a reliable source specifically commenting on the Smith and Jones dispute and making the same point about the Harvard manual and plagiarism. In other words, that precise analysis must have been published by a reliable source concerning the topic before it can be published on Wikipedia.\n"},{"TagName":"h2","Data":"What is not original research"},{"TagName":"h3","Data":"Original images"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:OI"},{"TagName":"a","Data":"WP:IMAGEOR"},{"TagName":"a","Data":"WP:Manual of Style/Images § Pertinence and encyclopedic nature"},{"TagName":"a","Data":"WP:Image use policy § Image titles and file names"},{"TagName":"p","Data":"Because of copyright laws in several countries, there are relatively few images available for use on Wikipedia. Editors are therefore encouraged to upload their own images, releasing them under appropriate Creative Commons licenses or other free licenses. Original images created by a Wikipedian are not considered original research, so long as they do not illustrate or introduce unpublished ideas or arguments, the core reason behind the \"No original research\" policy. Image captions are subject to this policy no less than statements in the body of the article.\n"},{"TagName":"a","Data":"Creative Commons licenses"},{"TagName":"p","Data":"It is not acceptable for an editor to use photo manipulation to distort the facts or position illustrated by an image. Manipulated images should be prominently noted as such. Any manipulated image where the encyclopedic value is materially affected should be posted to Wikipedia:Files for discussion. Images of living persons must not present the subject in a false or disparaging light.\n"},{"TagName":"a","Data":"photo manipulation"},{"TagName":"a","Data":"Wikipedia:Files for discussion"},{"TagName":"a","Data":"Images of living persons"},{"TagName":"h3","Data":"Translations and transcriptions"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:TRANSCRIPTION"},{"TagName":"a","Data":"WP:Translation"},{"TagName":"p","Data":"Faithfully translating sourced material into English, or transcribing spoken words from audio or video sources, is not considered original research. For information on how to handle sources that require translation, see WP:Verifiability § Non-English sources.\n"},{"TagName":"a","Data":"WP:Verifiability § Non-English sources"},{"TagName":"h3","Data":"Routine calculations"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:CALC"},{"TagName":"p","Data":"Routine calculations do not count as original research, provided there is consensus among editors that the results of the calculations are correct, and a meaningful reflection of the sources. Basic arithmetic, such as adding numbers, converting units, or calculating a person's age, is almost always permissible. See also Category:Conversion templates.\n"},{"TagName":"a","Data":"consensus"},{"TagName":"a","Data":"sources"},{"TagName":"a","Data":"Basic arithmetic"},{"TagName":"a","Data":"Category:Conversion templates"},{"TagName":"p","Data":"Mathematical literacy may be necessary to follow a \"routine\" calculation, particularly for articles on mathematics or in the hard sciences. In some cases, editors may show their work in a footnote.\n"},{"TagName":"p","Data":"Comparisons of statistics present particular difficulties. Editors should not compare statistics from sources that use different methodologies.\n"},{"TagName":"h3","Data":"Acceptable media"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:ORMEDIA"},{"TagName":"p","Data":"Source information does not need to be in prose form—any form of information, such as maps, charts, graphs, and tables may be used to provide source information. Any straightforward reading of such media is not original research provided that there is consensus among editors that the techniques used are correctly applied and a meaningful reflection of the sources.\n"},{"TagName":"h2","Data":"Related policies"},{"TagName":"h3","Data":"Verifiability"},{"TagName":"a","Data":"Wikipedia:Verifiability"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:VERIFYOR"},{"TagName":"p","Data":"Wikipedia's content is determined by previously published information rather than by the personal beliefs or experiences of its editors. Even if you're sure something is true, it must be verifiable before you can add it. The policy says that all challenged or likely to be challenged material and all quotations need a reliable source; what counts as a reliable source is described at WP:Verifiability § Reliable sources.\n"},{"TagName":"a","Data":"WP:Verifiability § Reliable sources"},{"TagName":"h3","Data":"Neutral point of view"},{"TagName":"a","Data":"Wikipedia:Neutral point of view"},{"TagName":"p","Data":"The prohibition against original research limits the extent to which editors may present their own points of view in articles. By reinforcing the importance of including verifiable research produced by others, this policy promotes the inclusion of multiple points of view. Consequently, this policy reinforces our neutrality policy. In many cases, there are multiple established views of any given topic. In such cases, no single position, no matter how well researched, is authoritative. It is not the responsibility of any individual editor to research all points of view. But when incorporating research into an article, editors must provide context for this point of view by indicating how prevalent the position is and whether it is held by a majority or minority.\n"},{"TagName":"p","Data":"The inclusion of a view that is held by only a tiny minority may constitute original research. Jimbo Wales has said of this:\n"},{"TagName":"a","Data":"Jimbo Wales"},{"TagName":"a","Data":"[9]"},{"TagName":"h2","Data":"See also"},{"TagName":"a","Data":"Wikiversity"},{"TagName":"a","Data":"original research"},{"TagName":"h3","Data":"Guidelines"},{"TagName":"a","Data":"Citing sources"},{"TagName":"a","Data":"Conflict of interest § Citing yourself"},{"TagName":"a","Data":"No original research examples"},{"TagName":"a","Data":"No original research noticeboard"},{"TagName":"h3","Data":"Templates"},{"TagName":"a","Data":"Original research"},{"TagName":"a","Data":"OR"},{"TagName":"a","Data":"Synthesis"},{"TagName":"a","Data":"AEIS"},{"TagName":"a","Data":"Template messages/Disputes"},{"TagName":"h3","Data":"Supplemental pages"},{"TagName":"a","Data":"Core content policies § History"},{"TagName":"a","Data":"Identifying and using independent sources"},{"TagName":"a","Data":"Identifying and using primary sources"},{"TagName":"a","Data":"These are not original research"},{"TagName":"a","Data":"What SYNTH is not"},{"TagName":"h3","Data":"Essays"},{"TagName":"a","Data":"Cherrypicking"},{"TagName":"a","Data":"Dictionaries as sources"},{"TagName":"a","Data":"Identifying and using style guides"},{"TagName":"a","Data":"Identifying and using tertiary sources"},{"TagName":"a","Data":"Party and person"},{"TagName":"a","Data":"POV and OR from editors, sources, and fields"},{"TagName":"a","Data":"Using maps and similar sources in Wikipedia articles"},{"TagName":"a","Data":"1.5 sources"},{"TagName":"h3","Data":"Research help"},{"TagName":"a","Data":"WikiProject Resource Exchange/Resource Request"},{"TagName":"a","Data":"The Wikipedia Library"},{"TagName":"h2","Data":"Notes"},{"TagName":"a","Data":"a"},{"TagName":"a","Data":"b"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"Wikipedia:Citing sources"},{"TagName":"a","Data":"Wikipedia:Manual of Style/Lead section § Citations"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"University of Maryland Libraries"},{"TagName":"a","Data":"[1]"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"Wikipedia:Reliable sources § News organizations"},{"TagName":"a","Data":"University of Nevada, Reno"},{"TagName":"a","Data":"[2]"},{"TagName":"a","Data":"University of California, Berkeley Libraries"},{"TagName":"a","Data":"[3]"},{"TagName":"a","Data":"Duke University Libraries"},{"TagName":"a","Data":"[4]"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"exceptional sources"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"University of California, Berkeley Libraries"},{"TagName":"a","Data":"[3]"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"[5]"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"notability criteria for books"},{"TagName":"a","Data":"[6]"},{"TagName":"a","Data":"[7]"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"WP:Verifiability § Wikipedia and sources that mirror or use it"},{"TagName":"a","Data":"WP:Reliable sources § User-generated content"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"[8]"},{"TagName":"h2","Data":"References"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"Primary, Secondary and Tertiary Sources\""},{"TagName":"a","Data":"the original"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"What is a Primary Source?\""},{"TagName":"a","Data":"the original"},{"TagName":"a","Data":"a"},{"TagName":"a","Data":"b"},{"TagName":"a","Data":"\"Finding Historical Primary Sources\""},{"TagName":"a","Data":"the original"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"How to Find Primary Sources\""},{"TagName":"a","Data":"the original"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"Primary and secondary sources\""},{"TagName":"a","Data":"the original"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"book review\""},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"Book Reviews\""},{"TagName":"a","Data":"the original"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"Original research\""},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"roy_q_royce@hotmail.com: --A Request RE a WIKIArticle--\""},{"TagName":"h2","Data":"Further reading"},{"TagName":"a","Data":"Crackpot articles"},{"TagName":"a","Data":"\"NPOV and 'new physics'\""},{"TagName":"a","Data":"\"NPOV and 'new physics'\""},{"TagName":"a","Data":"\"Original research\""},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"policies and guidelines"},{"TagName":"a","Data":"Five pillars"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"Verifiability"},{"TagName":"a","Data":"No original research"},{"TagName":"a","Data":"Neutral point of view"},{"TagName":"a","Data":"What Wikipedia is not"},{"TagName":"a","Data":"Biographies of living persons"},{"TagName":"a","Data":"Copyright"},{"TagName":"a","Data":"Copyright violations"},{"TagName":"a","Data":"Image use"},{"TagName":"a","Data":"Article titles"},{"TagName":"a","Data":"Notability"},{"TagName":"a","Data":"Autobiography"},{"TagName":"a","Data":"Citing sources"},{"TagName":"a","Data":"Reliable sources"},{"TagName":"a","Data":"Medicine"},{"TagName":"a","Data":"Do not include copies of lengthy primary sources"},{"TagName":"a","Data":"Plagiarism"},{"TagName":"a","Data":"Don't create hoaxes"},{"TagName":"a","Data":"Fringe theories"},{"TagName":"a","Data":"Patent nonsense"},{"TagName":"a","Data":"External links"},{"TagName":"a","Data":"Civility"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Harassment"},{"TagName":"a","Data":"Vandalism"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"No personal attacks"},{"TagName":"a","Data":"Ownership of content"},{"TagName":"a","Data":"Edit warring"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"No legal threats"},{"TagName":"a","Data":"Child protection"},{"TagName":"a","Data":"Paid-contribution disclosure"},{"TagName":"a","Data":"Assume good faith"},{"TagName":"a","Data":"Conflict of interest"},{"TagName":"a","Data":"Disruptive editing"},{"TagName":"a","Data":"Do not disrupt Wikipedia to illustrate a point"},{"TagName":"a","Data":"Etiquette"},{"TagName":"a","Data":"Gaming the system"},{"TagName":"a","Data":"Please do not bite the newcomers"},{"TagName":"a","Data":"Courtesy vanishing"},{"TagName":"a","Data":"Responding to threats of harm"},{"TagName":"a","Data":"Talk page guidelines"},{"TagName":"a","Data":"Signatures"},{"TagName":"a","Data":"Deletion policy"},{"TagName":"a","Data":"Proposed deletion"},{"TagName":"a","Data":"Biographies"},{"TagName":"a","Data":"Criteria for speedy deletion"},{"TagName":"a","Data":"Attack page"},{"TagName":"a","Data":"Oversight"},{"TagName":"a","Data":"Revision deletion"},{"TagName":"a","Data":"Administrators"},{"TagName":"a","Data":"Banning"},{"TagName":"a","Data":"Blocking"},{"TagName":"a","Data":"Page protection"},{"TagName":"a","Data":"Editing policy"},{"TagName":"a","Data":"Article size"},{"TagName":"a","Data":"Summary style"},{"TagName":"a","Data":"Be bold"},{"TagName":"a","Data":"Disambiguation"},{"TagName":"a","Data":"Hatnotes"},{"TagName":"a","Data":"Broad-concept article"},{"TagName":"a","Data":"Understandability"},{"TagName":"a","Data":"Manual of Style"},{"TagName":"a","Data":"Contents"},{"TagName":"a","Data":"Accessibility"},{"TagName":"a","Data":"Dates and numbers"},{"TagName":"a","Data":"Images"},{"TagName":"a","Data":"Layout"},{"TagName":"a","Data":"Lead section"},{"TagName":"a","Data":"Linking"},{"TagName":"a","Data":"Lists"},{"TagName":"a","Data":"Categories, lists, and navigation templates"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Template namespace"},{"TagName":"a","Data":"Project namespace"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"User pages"},{"TagName":"a","Data":"User boxes"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"Subpages"},{"TagName":"a","Data":"Terms of Use"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"Friendly space policy"},{"TagName":"a","Data":"Licensing and copyright"},{"TagName":"a","Data":"Privacy policy"},{"TagName":"a","Data":"List of all policies and guidelines"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"List of guidelines"},{"TagName":"a","Data":"Summaries of values and principles"}]