[{"TagName":"a","Data":"Wiktionary"},{"TagName":"a","Data":"Wikipedia:Glossary"},{"TagName":"a","Data":"Wikipedia:Writing better articles § WPSLANG"},{"TagName":"a","Data":"Wikipedia:What Wikipedia is not § Wikipedia is not a democracy"},{"TagName":"a","Data":"Wikipedia:What Wikipedia is not § Wikipedia is not a directory"},{"TagName":"a","Data":"policy"},{"TagName":"a","Data":"normally"},{"TagName":"a","Data":"consensus"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:DICDEF"},{"TagName":"a","Data":"WP:NOTDICT"},{"TagName":"a","Data":"WP:WINAD"},{"TagName":"a","Data":"Content policies"},{"TagName":"a","Data":"Neutral point of view"},{"TagName":"a","Data":"No original research"},{"TagName":"a","Data":"Verifiability"},{"TagName":"a","Data":"Article titles"},{"TagName":"a","Data":"Biographies of living persons"},{"TagName":"a","Data":"Image use policy"},{"TagName":"a","Data":"What Wikipedia is not"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":""},{"TagName":"a","Data":"Wikipedia"},{"TagName":"a","Data":"encyclopedia"},{"TagName":"a","Data":"dictionary"},{"TagName":"a","Data":"Encyclopædia Britannica"},{"TagName":"p","Data":"Wikipedia is not a dictionary, phrasebook, or a slang, jargon, or usage guide. Instead, the goal of this project is to create an encyclopedia. Our sister project Wiktionary has the goal of creating a dictionary. It is the \"lexical companion to Wikipedia\", and the two often link to each other. Wiktionary welcomes all editors who wish to write a dictionary.\n"},{"TagName":"a","Data":"dictionary"},{"TagName":"a","Data":"encyclopedia"},{"TagName":"a","Data":"Wiktionary"},{"TagName":"a","Data":"lexical"},{"TagName":"p","Data":"Both dictionary entries at Wiktionary and encyclopedia articles at Wikipedia may start out as stubs, but they are works in progress, to be expanded. Wikipedia articles should begin with a good definition, but they should provide other types of information about that topic as well. The full articles that Wikipedia's stubs grow into are very different from dictionary entries.\n"},{"TagName":"a","Data":"stubs"},{"TagName":"a","Data":"good definition"},{"TagName":"p","Data":"Each article in an encyclopedia is about a person, a people, a concept, a place, an event, a thing, etc., whereas a dictionary entry is primarily about a word, an idiom, or a term and its meanings, usage and history. In some cases, a word or phrase itself may be an encyclopedic subject, such as Macedonia (terminology) or truthiness.\n"},{"TagName":"a","Data":"may be an encyclopedic subject"},{"TagName":"a","Data":"Macedonia (terminology)"},{"TagName":"a","Data":"truthiness"},{"TagName":"p","Data":"One perennial source of confusion is that a stub encyclopedia article looks very much like a dictionary entry, and stubs are often poorly written; another is that some paper dictionaries, such as \"pocket\" dictionaries, lead users to the mistaken belief that dictionary entries are short, and that short article and dictionary entry are therefore equivalent.\n"},{"TagName":"h2","Data":"Overview: encyclopedia vs dictionary[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"In this section we compare Wikipedia and Wiktionary (as a concrete example of a dictionary), but the principle is that Wikipedia is not a dictionary, not simply that it is not Wiktionary.\n"},{"TagName":"h3","Data":"Major differences[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"octopus"},{"TagName":"a","Data":"octopus"},{"TagName":"a","Data":"synonyms"},{"TagName":"a","Data":"duplicate articles"},{"TagName":"a","Data":"merged"},{"TagName":"a","Data":"petrol"},{"TagName":"a","Data":"gasoline"},{"TagName":"a","Data":"petrol"},{"TagName":"a","Data":"gasoline"},{"TagName":"a","Data":"duplicate articles"},{"TagName":"a","Data":"merged"},{"TagName":"a","Data":"colour"},{"TagName":"a","Data":"color"},{"TagName":"a","Data":"colour"},{"TagName":"a","Data":"color"},{"TagName":"a","Data":"homographs"},{"TagName":"a","Data":"rocket"},{"TagName":"a","Data":"salad rocket"},{"TagName":"a","Data":"rocket engine"},{"TagName":"a","Data":"Rocket (disambiguation)"},{"TagName":"a","Data":"rocket"},{"TagName":"p","Data":"One test is that an encyclopedia article's name can usually easily take many different equivalent forms, whereas a dictionary as a linguistic work is about the words in the title, and cannot usually be easily translated.[1]\n"},{"TagName":"a","Data":"[1]"},{"TagName":"h3","Data":"Minor differences[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Wikipedia:Naming conventions (verbs)"},{"TagName":"a","Data":"nouns"},{"TagName":"a","Data":"participles"},{"TagName":"a","Data":"gerunds"},{"TagName":"a","Data":"greengrocer"},{"TagName":"a","Data":"camping"},{"TagName":"a","Data":"Wikipedia:Naming conventions (plurals)"},{"TagName":"a","Data":"redirects"},{"TagName":"a","Data":"walk"},{"TagName":"a","Data":"walks"},{"TagName":"a","Data":"walked"},{"TagName":"a","Data":"walking"},{"TagName":"a","Data":"suffixes"},{"TagName":"a","Data":"-ed"},{"TagName":"a","Data":"-ing"},{"TagName":"a","Data":"Wikipedia:Article titles § Use nouns"},{"TagName":"a","Data":"Article titles are in the English language, with some exceptions"},{"TagName":"a","Data":"All words from all languages are accepted"},{"TagName":"a","Data":"proper noun"},{"TagName":"a","Data":"disambiguation article"},{"TagName":"a","Data":"Hastings (disambiguation)"},{"TagName":"a","Data":"Benedict"},{"TagName":"a","Data":"Bush"},{"TagName":"a","Data":"wiktionary"},{"TagName":"p","Data":"An article about a given name or a surname is an anthroponymy article that contains a list of people with this name as well as encyclopedic content about the meaning, etymology and history of the name.\n"},{"TagName":"a","Data":"given name"},{"TagName":"a","Data":"surname"},{"TagName":"a","Data":"anthroponymy article"},{"TagName":"a","Data":"proper noun"},{"TagName":"a","Data":"Hastings"},{"TagName":"a","Data":"Benedict"},{"TagName":"p","Data":"The entry will use {{Wikipedia}} or interwiki links to link to the Wikipedia articles.\n"},{"TagName":"a","Data":"Wikipedia"},{"TagName":"a","Data":"interwiki links"},{"TagName":"p","Data":"Wiktionary is also case sensitive, so entries for (English) proper nouns are separate from entries for (English) common nouns. For example: Bush, bush\n"},{"TagName":"a","Data":"Bush"},{"TagName":"a","Data":"bush"},{"TagName":"h3","Data":"Not size[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Dictionary entries and encyclopedia articles do not differ simply on grounds of length. An entry in a comprehensive dictionary (or a topical encyclopedic dictionary) would probably contain illustrative quotations for each listed meaning; etymologies; translations; inflections; links to related and derived terms; links to synonyms, antonyms, and homophones; a pronunciation guide in various dialects, including links to sound files; and usage notes; it could be very long indeed. Short dictionary articles are artifacts of paper dictionaries being space-limited, and some dictionaries being intentionally concise. Not all dictionaries are limited by the size of the paper; Wiktionary is not paper either.\n"},{"TagName":"a","Data":"encyclopedic dictionary"},{"TagName":"a","Data":"Wiktionary is not paper"},{"TagName":"h2","Data":"The dictionary definition trap[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"h3","Data":"Good definitions[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Both dictionaries and encyclopedias contain definitions. Encyclopedia articles should begin with a good definition and description of one topic (or a few largely or completely synonymous or otherwise highly related topics[2]), but the article should provide other types of information about that topic as well. An encyclopedic definition is more concerned with encyclopedic knowledge (facts) than linguistic concerns.[3] See also WP:REFERS.\n"},{"TagName":"a","Data":"[2]"},{"TagName":"a","Data":"[3]"},{"TagName":"a","Data":"WP:REFERS"},{"TagName":"p","Data":"A good definition is not circular, a synonym or a near synonym, overly broad or narrow, ambiguous, figurative, or obscure.  When a descriptive title is self-explanatory, such as history of Malta, a definition may not be needed. .mw-parser-output div.crossreference{padding-left:0}See also fallacies of definition.\n"},{"TagName":"a","Data":"circular"},{"TagName":"a","Data":"synonym"},{"TagName":"a","Data":"history of Malta"},{"TagName":"a","Data":"fallacies of definition"},{"TagName":"p","Data":"A definition aims to describe or delimit the meaning of some term (a word or a phrase) by giving a statement of essential properties or distinguishing characteristics of the concept, entity, or kind of entity, denoted by that term."},{"TagName":"a","Data":"Definition"},{"TagName":"h3","Data":"Wikipedia is not a usage guide[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Wikipedia is not in the business of saying how words, idioms, phrases etc. \"should\" be used (but it may be important in the context of an encyclopedia article to discuss how a word is used).\n"},{"TagName":"p","Data":"Articles that have been heavily cut to avoid becoming usage guides include gender-neutral pronoun and non-sexist language. Articles with information on how a word is used include singular they, homophobia, and sexism. By a simple extension of the latter, Wikipedia is not a slang and idiom guide. We aren't teaching people how to talk like a hacker or a Cockney chimney-sweep; we're writing an encyclopedia. See meta:Knocking her dead one on the nose each and every double trey for a historical example. Some articles are encyclopedic glossaries on the jargon of an industry or field; such articles must be informative, not guiding in nature, because Wikipedia is not a manual, guidebook, or textbook.\n"},{"TagName":"a","Data":"gender-neutral pronoun"},{"TagName":"a","Data":"non-sexist language"},{"TagName":"a","Data":"singular they"},{"TagName":"a","Data":"homophobia"},{"TagName":"a","Data":"sexism"},{"TagName":"a","Data":"meta:Knocking her dead one on the nose each and every double trey"},{"TagName":"a","Data":"encyclopedic glossaries"},{"TagName":"a","Data":"Wikipedia is not a manual, guidebook, or textbook"},{"TagName":"p","Data":"Note that Wiktionary is also primarily a record of how words are (or were) used rather than how they \"should\" be used, but it does aim to note when usage is slang, informal, archaic, non-standard, derogatory, offensive, etc. and how that status has changed over time.\n"},{"TagName":"h3","Data":"Wikipedia is not a genealogical dictionary[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"There are reference works known as genealogical dictionaries.[4] These tend to focus primarily on the immediate family connections (parents, spouses, children and their spouses) of the article subject. Wikipedia is an encyclopedia, and as such focuses more on the actions and contributions of an article subject. This means that many genealogical details may be omitted, for a better-flowing, more rounded article.\n"},{"TagName":"a","Data":"[4]"},{"TagName":"p","Data":"Biography articles should only be created for people with some sort of verifiable notability. A good measure of notability is whether someone has been featured in multiple, independent, reliable sources. However, minor figures may be mentioned within other articles (for example, Ronald Gay in Violence against LGBT people).\n"},{"TagName":"a","Data":"verifiable"},{"TagName":"a","Data":"notability"},{"TagName":"a","Data":"reliable sources"},{"TagName":"a","Data":"Violence against LGBT people"},{"TagName":"p","Data":"See also Wikipedia:Notability (people).\n"},{"TagName":"a","Data":"Wikipedia:Notability (people)"},{"TagName":"p","Data":"\n"},{"TagName":"h3","Data":" Neologisms[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Wikipedia:Manual of Style (words to watch) § Neologisms and new compounds"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:NEO"},{"TagName":"a","Data":"WP:NOTNEO"},{"TagName":"p","Data":"Articles on neologisms that have little or no usage in reliable sources are commonly deleted, as these articles are often created in an attempt to use Wikipedia to increase usage of the term. Care should be taken when translating text into English that a term common in the host language does not create an uncommon neologism in English. As Wiktionary's inclusion criteria differ from Wikipedia's, that project may cover neologisms that Wikipedia cannot accept. Editors may wish to contribute an entry for the neologism to Wiktionary instead.\n"},{"TagName":"a","Data":"neologisms"},{"TagName":"a","Data":"Wiktionary"},{"TagName":"a","Data":"inclusion criteria"},{"TagName":"p","Data":"Some neologisms can be in frequent use, and it may be possible to pull together many facts about a particular term and show evidence of its usage on the Internet or in larger society. To support an article about a particular term or concept, we must cite what reliable secondary sources say about the term or concept, not just sources that use the term (see use–mention distinction). An editor's personal observations and research (e.g. finding blogs, books, and articles that use the term rather than are about the term) are insufficient to support articles on neologisms because this may require analysis and synthesis of primary source material to advance a position, which is explicitly prohibited by the original research policy.\n"},{"TagName":"a","Data":"secondary sources"},{"TagName":"a","Data":"use–mention distinction"},{"TagName":"a","Data":"analysis and synthesis"},{"TagName":"a","Data":"original research policy"},{"TagName":"p","Data":"While Wikipedia is a tertiary source, Wiktionary is a secondary source, so welcomes OR of this sort.  Neologisms must at least have three independent uses for inclusion there, and additional requirements can be found on their Criteria for inclusion page.\n"},{"TagName":"a","Data":"Criteria for inclusion"},{"TagName":"p","Data":"Neologisms that are in wide use but for which there are no treatments in secondary sources are not yet ready for use and coverage in Wikipedia. The term does not need to be in Wikipedia in order to be a \"true\" term, and when secondary sources become available, it will be appropriate to create an article on the topic, or use the term within other articles.\n"},{"TagName":"p","Data":"In a few cases, there will be notable topics which are well-documented in reliable sources, but for which no accepted short-hand term exists. It can be tempting to employ a neologism in such a case. Instead, it is preferable to use a title that is a descriptive phrase in plain English if possible, even if this makes for a somewhat long or awkward title.[example  needed]\n"},{"TagName":"a","Data":"reliable sources"},{"TagName":"a","Data":"use a title that is a descriptive phrase"},{"TagName":"a","Data":"example  needed"},{"TagName":"h3","Data":" When a word or phrase itself may be an encyclopedic subject[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:WORDISSUBJECT"},{"TagName":"p","Data":"In some cases, a word or phrase itself may be an encyclopedic subject. In these cases, the word or phrase in and of itself passes Wikipedia's notability criteria as the subject of verifiable coverage by reliable sources. As with any subject, articles on words must contain encyclopedic information. That is, such articles must go beyond what would be found in a dictionary entry (definition, pronunciation, etymology, use information, etc.), and include information on the social or historical significance of the term. While published dictionaries may be useful sources for lexical information on a term, the presence of a term in a dictionary does not by itself establish notability. Examples of Wikipedia articles on words and phrases include Macedonia (terminology), Orange (word), Thou, No worries, and most articles about individual racial slurs, profanity, and obscene gestures.\n"},{"TagName":"a","Data":"notability"},{"TagName":"a","Data":"verifiable"},{"TagName":"a","Data":"reliable sources"},{"TagName":"a","Data":"Macedonia (terminology)"},{"TagName":"a","Data":"Orange (word)"},{"TagName":"a","Data":"Thou"},{"TagName":"a","Data":"No worries"},{"TagName":"a","Data":"racial slurs"},{"TagName":"a","Data":"profanity"},{"TagName":"a","Data":"obscene gestures"},{"TagName":"p","Data":"In other cases, a word or phrase is often used as a \"lens\" or concept through which another topic or closely related set of topics are grouped, seen or renamed. In such cases, coverage about a word, phrase or concept should treat it as such. The main coverage of the topics that were modified, grouped or renamed by the \"lens\" is typically elsewhere in Wikipedia. World music, Political correctness, Gay agenda and Truthiness illustrate this.\n"},{"TagName":"a","Data":"World music"},{"TagName":"a","Data":"Political correctness"},{"TagName":"a","Data":"Gay agenda"},{"TagName":"a","Data":"Truthiness"},{"TagName":"h2","Data":" Handling problems[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:ISAWORDFOR"},{"TagName":"a","Data":"WP:ISATERMFOR"},{"TagName":"h3","Data":"Fixing the introductory sentence: removing \"refers to\"[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Wikipedia:Writing better articles § Use of \"refers to\""},{"TagName":"a","Data":"Wikipedia:Manual of Style/Lead section § First sentence"},{"TagName":"p","Data":"A good encyclopedia article can and should begin with a relatively short but discrete explanation of the subject of the article (the person, place, concept, event, or 'thing' of the title).\n"},{"TagName":"p","Data":"However, sometimes articles (particularly stubs) have poorly written dictionary-style introductory sentences, such as \"Dog is a term for an animal with the binomial name Canis lupus.\", or \"Dog is a word that refers to a domesticated canine.\"\n"},{"TagName":"p","Data":"Most Wikipedia articles are not dictionary entries, and opening sentences like the above ought to be cleaned up in accordance with our Guide to writing better articles. Editors should boldly replace these cumbersome phrasings (\"is a term for\", \"is a word that means\", \"refers to\") with the more direct \"is\" construction, for example: \"A dog is an animal of the species Canis lupus.\", or \"A dog is a domesticated canine.\" (See: Writing better articles: Avoid using \"refers to\")\n"},{"TagName":"a","Data":"Guide to writing better articles"},{"TagName":"a","Data":"boldly"},{"TagName":"a","Data":"Writing better articles: Avoid using \"refers to\""},{"TagName":"p","Data":"Sometimes a Wikipedia article will also be poorly titled: its title will be an adjective or an adverb, or an inflection of a verb that isn't a noun. Such articles are dictionary articles only if they discuss the word or phrase as a word or phrase, rather than what the word or phrase denotes. If such articles should explain what the word or phrase denotes, then they should be renamed or merged to a title that adheres to our Wikipedia:Naming conventions. For example: the adjective \"supermassive\" doesn't by itself denote a subject. \"Supermassive black hole\", on the other hand, is a subject.\n"},{"TagName":"a","Data":"poorly titled"},{"TagName":"a","Data":"as a word or phrase"},{"TagName":"a","Data":"renamed"},{"TagName":"a","Data":"merged"},{"TagName":"a","Data":"Wikipedia:Naming conventions"},{"TagName":"a","Data":"Supermassive black hole"},{"TagName":"h3","Data":"Misplaced dictionary entries[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Sometimes an article really is a mis-placed stub dictionary entry, that discusses the etymology, translations, usage, inflections, multiple distinct meanings, synonyms, antonyms, homophones, spelling, pronunciation, and so forth of a word or an idiomatic phrase. \n"},{"TagName":"a","Data":"a word or an idiomatic phrase"},{"TagName":"p","Data":"If Wiktionary doesn't already have an entry for the word or idiom (which is unlikely), one can be created. Previously it could be copied to Wiktionary using the transwiki system by marking the article with the {{Copy to Wiktionary}} template, but that template was deleted by a 2021 TfD.\n"},{"TagName":"a","Data":"transwiki"},{"TagName":"a","Data":"Copy to Wiktionary"},{"TagName":"a","Data":"was deleted by a 2021 TfD"},{"TagName":"p","Data":"However, after copying, the final disposition of the article here is up to Wikipedia. If the article cannot be renamed, merged, or rewritten into a stub encyclopedia article about a subject, denoted by its title, then it should be deleted.\n"},{"TagName":"a","Data":"renamed"},{"TagName":"a","Data":"merged"},{"TagName":"a","Data":"rewritten"},{"TagName":"a","Data":"deleted"},{"TagName":"h3","Data":"Pointers to Wiktionary[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"dictionary"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:POINTWIKT"},{"TagName":"p","Data":"A template can be used to point to a Wiktionary entry from a Wikipedia article which has encyclopedic content; for example, the code {{Wiktionary|dictionary}} produces a pointer to the Wiktionary definition of dictionary as illustrated here. For Wikipedia articles which could only ever be dictionary definitions and keep being re-created and re-deleted, or which could potentially be proper articles but are dictionary-like stubs at the moment, it is possible to effectively \"salt\" them with a soft redirect to Wiktionary using code such as  {{Wiktionary redirect|dictionary}}. The general guidelines for what is acceptable as a soft redirect to Wiktionary are enumerated in that template's documentation.\n"},{"TagName":"a","Data":"Wiktionary"},{"TagName":"a","Data":"dictionary"},{"TagName":"a","Data":"salt"},{"TagName":"a","Data":"soft redirect"},{"TagName":"a","Data":"Wiktionary redirect"},{"TagName":"h2","Data":"See also[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Wikipedia:Redirects in languages other than English"},{"TagName":"a","Data":"Wikipedia:Dictionaries as sources"},{"TagName":"a","Data":"Wikipedia:You are probably not a lexicologist or a lexicographer"},{"TagName":"a","Data":"Wikipedia:Dealing with dictionary definitions"},{"TagName":"a","Data":"Wikipedia:Stand-alone lists"},{"TagName":"a","Data":"Wikipedia:What Wikipedia is not"},{"TagName":"a","Data":"Category:Phrases"},{"TagName":"a","Data":"Category:Vocabulary and usage stubs"},{"TagName":"h2","Data":"References[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"Modern Lexicography: An Introduction"},{"TagName":"a","Data":"ISBN"},{"TagName":"a","Data":"9780198299516"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"Dictionary of lexicography By R. R. K. Hartmann, Gregory James"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"p 43"},{"TagName":"h2","Data":"External links[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"\"Shallow Page\" on the MeatballWiki"},{"TagName":"a","Data":"Alemannic German Wikipedia"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"Wikipedia principles"},{"TagName":"p","Data":"Five pillarsStatement of our principles\n"},{"TagName":"a","Data":"Five pillars"},{"TagName":"p","Data":"Jimbo's statementHistoric principles\n"},{"TagName":"a","Data":"Jimbo's statement"},{"TagName":"p","Data":"Simplified rulesetSynopsis of our conventions\n"},{"TagName":"a","Data":"Simplified ruleset"},{"TagName":"p","Data":"Wikimedia principlesCommon to all projects(in Meta-Wiki)\n"},{"TagName":"a","Data":"Wikimedia principles"},{"TagName":"p","Data":"PrinciplesOther essays on Wikipedia's principles\n"},{"TagName":"a","Data":"Principles"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"policies and guidelines"},{"TagName":"a","Data":"Five pillars"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"Verifiability"},{"TagName":"a","Data":"No original research"},{"TagName":"a","Data":"Neutral point of view"},{"TagName":"a","Data":"What Wikipedia is not"},{"TagName":"a","Data":"Biographies of living persons"},{"TagName":"a","Data":"Copyright"},{"TagName":"a","Data":"Copyright violations"},{"TagName":"a","Data":"Image use"},{"TagName":"a","Data":"Article titles"},{"TagName":"a","Data":"Notability"},{"TagName":"a","Data":"Autobiography"},{"TagName":"a","Data":"Citing sources"},{"TagName":"a","Data":"Reliable sources"},{"TagName":"a","Data":"Medicine"},{"TagName":"a","Data":"Do not include copies of lengthy primary sources"},{"TagName":"a","Data":"Plagiarism"},{"TagName":"a","Data":"Don't create hoaxes"},{"TagName":"a","Data":"Fringe theories"},{"TagName":"a","Data":"Patent nonsense"},{"TagName":"a","Data":"External links"},{"TagName":"a","Data":"Civility"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Harassment"},{"TagName":"a","Data":"Vandalism"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"No personal attacks"},{"TagName":"a","Data":"Ownership of content"},{"TagName":"a","Data":"Edit warring"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"No legal threats"},{"TagName":"a","Data":"Child protection"},{"TagName":"a","Data":"Paid-contribution disclosure"},{"TagName":"a","Data":"Assume good faith"},{"TagName":"a","Data":"Conflict of interest"},{"TagName":"a","Data":"Disruptive editing"},{"TagName":"a","Data":"Do not disrupt Wikipedia to illustrate a point"},{"TagName":"a","Data":"Etiquette"},{"TagName":"a","Data":"Gaming the system"},{"TagName":"a","Data":"Please do not bite the newcomers"},{"TagName":"a","Data":"Courtesy vanishing"},{"TagName":"a","Data":"Responding to threats of harm"},{"TagName":"a","Data":"Talk page guidelines"},{"TagName":"a","Data":"Signatures"},{"TagName":"a","Data":"Deletion policy"},{"TagName":"a","Data":"Proposed deletion"},{"TagName":"a","Data":"Biographies"},{"TagName":"a","Data":"Criteria for speedy deletion"},{"TagName":"a","Data":"Attack page"},{"TagName":"a","Data":"Oversight"},{"TagName":"a","Data":"Revision deletion"},{"TagName":"a","Data":"Administrators"},{"TagName":"a","Data":"Banning"},{"TagName":"a","Data":"Blocking"},{"TagName":"a","Data":"Page protection"},{"TagName":"a","Data":"Editing policy"},{"TagName":"a","Data":"Article size"},{"TagName":"a","Data":"Summary style"},{"TagName":"a","Data":"Be bold"},{"TagName":"a","Data":"Disambiguation"},{"TagName":"a","Data":"Hatnotes"},{"TagName":"a","Data":"Broad-concept article"},{"TagName":"a","Data":"Understandability"},{"TagName":"a","Data":"Manual of Style"},{"TagName":"a","Data":"Contents"},{"TagName":"a","Data":"Accessibility"},{"TagName":"a","Data":"Dates and numbers"},{"TagName":"a","Data":"Images"},{"TagName":"a","Data":"Layout"},{"TagName":"a","Data":"Lead section"},{"TagName":"a","Data":"Linking"},{"TagName":"a","Data":"Lists"},{"TagName":"a","Data":"Categories, lists, and navigation templates"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Template namespace"},{"TagName":"a","Data":"Project namespace"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"User pages"},{"TagName":"a","Data":"User boxes"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"Subpages"},{"TagName":"a","Data":"Terms of Use"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"Friendly space policy"},{"TagName":"a","Data":"Licensing and copyright"},{"TagName":"a","Data":"Privacy policy"},{"TagName":"a","Data":"List of all policies and guidelines"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"List of guidelines"},{"TagName":"a","Data":"Summaries of values and principles"}]