[{"TagName":"a","Data":"WP:UP"},{"TagName":"a","Data":"WP:WPUN"},{"TagName":"a","Data":"WP:FUW"},{"TagName":"a","Data":"WP:Userboxes"},{"TagName":"a","Data":"policy"},{"TagName":"a","Data":"normally"},{"TagName":"a","Data":"consensus"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:U"},{"TagName":"a","Data":"WP:UN"},{"TagName":"a","Data":"WP:UPOL"},{"TagName":"a","Data":"WP:USERNAME"},{"TagName":"a","Data":"Wikipedia:Usernames for administrator attention"},{"TagName":"a","Data":"Conduct policies"},{"TagName":"a","Data":"Block evasion"},{"TagName":"a","Data":"Civility"},{"TagName":"a","Data":"Clean start"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Edit warring"},{"TagName":"a","Data":"Editing policy"},{"TagName":"a","Data":"Harassment"},{"TagName":"a","Data":"No personal attacks"},{"TagName":"a","Data":"Ownership of content"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"Username policy"},{"TagName":"a","Data":"Vandalism"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"p","Data":"This policy describes what kinds of usernames are acceptable on the English Wikipedia and how unacceptable or doubtful usernames can be dealt with. It also specifies that a user account should be used only by one person, and that in most cases one person should use only one account.\n"},{"TagName":"p","Data":"You choose your username when creating a user account. All contributions made using that account will then be attributed to the chosen username (contributions made while not logged in to any account are attributed to the user's IP address). It is also possible to request a change of username, and have your past contributions re-attributed to the new name.\n"},{"TagName":"a","Data":"creating a user account"},{"TagName":"a","Data":"logged in"},{"TagName":"a","Data":"IP address"},{"TagName":"a","Data":"change of username"},{"TagName":"p","Data":"This policy applies to usernames on English Wikipedia. However, in most cases you will be able to use the same username and password to log in to other language Wikipedias and other Wikimedia Foundation supported projects. See Wikipedia:Unified login.\n"},{"TagName":"a","Data":"Wikimedia Foundation"},{"TagName":"a","Data":"Wikipedia:Unified login"},{"TagName":"h2","Data":"Guidance for new users"},{"TagName":"a","Data":"English Wikipedia username policy"},{"TagName":"p","Data":"Usernames are not allowed on Wikipedia if they:\n"},{"TagName":"p","Data":"Usernames are not allowed on Wikipedia and will be immediately blocked upon discovery if they:\n"},{"TagName":"a","Data":"notable"},{"TagName":"a","Data":"notable"},{"TagName":"a","Data":"Wikimedia Foundation"},{"TagName":"a","Data":"bad faith"},{"TagName":"a","Data":"policies and guidelines"},{"TagName":"a","Data":"vandalize"},{"TagName":"a","Data":"disrupt"},{"TagName":"a","Data":"advertise"},{"TagName":"a","Data":"spam"},{"TagName":"a","Data":"personally attack"},{"TagName":"a","Data":"harass"},{"TagName":"a","Data":"threaten"},{"TagName":"a","Data":"not here to build an encyclopedia"},{"TagName":"a","Data":"that it is not created for"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:NAMEGUIDE"},{"TagName":"p","Data":"Your username is a nickname that will identify your account and thereby all of your contributions to Wikipedia. It can be your real name if you so choose, but you should be aware of the risks involved in editing under your real name before choosing to use or disclose your real name on Wikipedia. Wikipedia usernames are case sensitive, but the first letter is always automatically capitalized. By default, your username appears in your signature on posts to discussion pages. For further details on signatures and how to customize them, see Wikipedia:Signatures.\n"},{"TagName":"a","Data":"the risks involved"},{"TagName":"a","Data":"case sensitive"},{"TagName":"a","Data":"discussion pages"},{"TagName":"a","Data":"Wikipedia:Signatures"},{"TagName":"p","Data":"You must keep in mind that, once chosen, a username cannot be easily changed, and changing your username doesn't hide your previous username from all of the edits that you've made while using it (such as the signature of your previous username that you left on any talk pages, messages, discussions, and replies). For example, if \"Dr. Franz Schröder\" is your real name, and you choose this to be your username, your real name and doctorate will be evident on your edits, on history pages, and (unless you change your signature) on all posts, messages, and replies that you make to talk pages and discussions. It is highly recommended that you read and understand the section on using your real name as your username before you decide to do so.\n"},{"TagName":"a","Data":"using your real name"},{"TagName":"p","Data":"You will be required to specify the username that you'd like to use when you are creating a new account, and you will subsequently use it (together with your password) to log in to that account. Once you have an account, you may create a user page, titled \"User:XXXX\" (where \"XXXX\" is your username), to provide relevant information about yourself to other Wikipedians. You or any other editor may also create a user talk page, titled \"User talk:XXXX\", that people can use to contact you.\n"},{"TagName":"a","Data":"creating a new account"},{"TagName":"a","Data":"log in"},{"TagName":"a","Data":"user page"},{"TagName":"a","Data":"user talk page"},{"TagName":"p","Data":"The MediaWiki software will not allow you to register a new account with a username that is already taken by another account, nor will it allow you to register a username that is too similar to another account. This page can be used to check whether or not a username is already taken; if the username is not listed when you enter it into the username search, it means that the provided username is not taken. Please note that the page does not return usernames that are too similar; it only returns a match if the exact username you enter is already taken. You may still be able to obtain a username that is too similar to another account under certain circumstances; see § Similar usernames below.\n"},{"TagName":"a","Data":"This page"},{"TagName":"a","Data":"§ Similar usernames"},{"TagName":"p","Data":"Your username can be virtually any string of characters (subject to a few technical limitations). However, it should be a name which other users will be comfortable with and which does not interfere with the project. A controversial name may give a bad impression to other users, and avoiding this is in your own interest. This page describes certain types of usernames that are specifically disallowed, primarily because they can be considered offensive, misleading, or promotional, or imply that the account does not belong to an individual.\n"},{"TagName":"a","Data":"technical limitations"},{"TagName":"h2","Data":"Inappropriate usernames"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:IU"},{"TagName":"p","Data":"This section lists the types of usernames that are considered inappropriate. The same criteria also apply to signatures.\n"},{"TagName":"a","Data":"signatures"},{"TagName":"p","Data":"These lists are not necessarily exhaustive. Use common sense in applying these rules; a username containing a word that may seem offensive in one context may have a very different, more benign meaning in another. For guidance on how to deal with inappropriate usernames if encountered, see § Dealing with inappropriate usernames below.\n"},{"TagName":"a","Data":"Use common sense"},{"TagName":"a","Data":"§ Dealing with inappropriate usernames"},{"TagName":"h3","Data":"Disruptive or offensive usernames"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:ATTACKNAME"},{"TagName":"a","Data":"WP:DISRUPTNAME"},{"TagName":"p","Data":"The following types of usernames are not permitted, and will be immediately blocked upon discovery, because they are disruptive or offensive:\n"},{"TagName":"a","Data":"[1]"},{"TagName":"a","Data":"hate groups"},{"TagName":"a","Data":"personal attacks"},{"TagName":"a","Data":"harass"},{"TagName":"a","Data":"threaten"},{"TagName":"a","Data":"trolling"},{"TagName":"a","Data":"vandalize"},{"TagName":"a","Data":"disrupt"},{"TagName":"a","Data":"clearly not intended to help build, expand, or grow the encyclopedia"},{"TagName":"p","Data":"These accounts, upon their discovery, should be immediately blocked by administrators, and consideration should be given, with appropriate judgment, if the username should be redacted from any logs or edit revisions - especially if they're grossly offensive or destructive in nature, and likely to offend many editors. Note that usernames that are inappropriate in another language, or that represent an inappropriate name with misspellings and substitutions, or do so indirectly or by implication, are still considered inappropriate.\n"},{"TagName":"h3","Data":"Usernames with libelous, contentious, or non-public information"},{"TagName":"a","Data":"Wikipedia:Biographies of living persons § Remove contentious material"},{"TagName":"a","Data":"Wikipedia:Biographies of living persons § Usernames"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:BLPABUSE"},{"TagName":"p","Data":"The following types of usernames are not permitted, and will be immediately blocked upon discovery, because they violate highly important and serious Wikipedia policies:\n"},{"TagName":"a","Data":"living or recently deceased person"},{"TagName":"a","Data":"biographies of living people"},{"TagName":"a","Data":"[2]"},{"TagName":"a","Data":"Oversighter"},{"TagName":"p","Data":"These accounts, upon their discovery, should be immediately blocked by administrators. If such usernames are libelous or contain information that is usually suppressed (such as non-public personal identifiable information about another editor or a notable living person), the username should be suppressed from logs by Oversighters to protect Wikipedia and the subjects involved from any kind of negative fallout or harm as a result of the account or username creation. Requests for removing attack usernames from logs should be reported to the global Stewards team for evaluation and private removal from all WMF projects. This can be done either via IRC in the #wikimedia-stewards connect channel or via email to the stewards VRT queue at stewardswikimedia.org.\n"},{"TagName":"a","Data":"notable"},{"TagName":"a","Data":"suppressed from logs"},{"TagName":"a","Data":"global Stewards"},{"TagName":"a","Data":"connect"},{"TagName":"h3","Data":"Misleading usernames"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:MISLEADNAME"},{"TagName":"p","Data":"The following types of usernames are not permitted because they may be misleading in a way that disrupts the project:\n"},{"TagName":"a","Data":"§ Real names"},{"TagName":"a","Data":"§ Similar usernames"},{"TagName":"a","Data":"permissions"},{"TagName":"a","Data":"administrator"},{"TagName":"a","Data":"bureaucrat"},{"TagName":"a","Data":"steward"},{"TagName":"a","Data":"checkuser"},{"TagName":"a","Data":"oversight"},{"TagName":"a","Data":"policies and guidelines"},{"TagName":"a","Data":"bot accounts"},{"TagName":"a","Data":"Wikimedia Foundation"},{"TagName":"a","Data":"signature"},{"TagName":"a","Data":"Wikipedia:Courtesy vanishing"},{"TagName":"p","Data":"For accounts with usernames that are in this category, you should assume good faith in cases where the username could be interpreted ambiguously. For example, a new user whose career is as a sysop might include that in their username, unaware of the policy prohibiting it. An attempt to discuss the username policy and concern with the user, and a request that they change their username should typically be attempted before considering further action. In cases where the violation of policy or the user's intent is clear, or likely created in bad faith, you should exhibit the use of common sense and  fair and level-headed judgment when determining the appropriate action to take. These clear violations should be reported by following the instructions on Wikipedia:Usernames for administrator attention to file a report.\n"},{"TagName":"a","Data":"assume good faith"},{"TagName":"a","Data":"common sense"},{"TagName":"a","Data":"Wikipedia:Usernames for administrator attention"},{"TagName":"h3","Data":"Promotional usernames"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:ORGNAME"},{"TagName":"a","Data":"WP:CORPNAME"},{"TagName":"a","Data":"WP:SPAMNAME"},{"TagName":"a","Data":"WP:PROMONAME"},{"TagName":"a","Data":"Category:Wikipedians who are indefinitely blocked for promotional user names"},{"TagName":"p","Data":"The following types of usernames are not permitted because they are considered promotional:\n"},{"TagName":"a","Data":"§ Usernames implying shared use"},{"TagName":"a","Data":"§ Stage names"},{"TagName":"a","Data":"Email addresses"},{"TagName":"a","Data":"URLs"},{"TagName":"a","Data":"top-level domain"},{"TagName":"p","Data":"A user who both adopts a promotional username and who engages in inappropriate advertising or promotional edits or behaviors – especially when made to their own user space or to articles about the company, group, or product – can be blocked from editing Wikipedia, and are often blocked much sooner than users who engage in only one of the two behaviors. In such cases, administrators should examine the user's edits to decide whether or not to allow them to create a new username. If there is evidence that the user would continue to edit inappropriately under a new username, the blocking administrator should enable the \"autoblock\" and \"prevent account creation\" block settings. Otherwise, the user should be offered the opportunity to create a new account or have their current username changed. (Before blocking, disagreements as to whether a particular username is acceptable should be discussed at WP:Requests for comment/Usernames.) Users who adopt such usernames, but who are not editing problematically in related articles, should not be blocked. Instead, they should be gently encouraged to change their username.\n"},{"TagName":"a","Data":"inappropriate advertising or promotional"},{"TagName":"a","Data":"blocked"},{"TagName":"a","Data":"autoblock"},{"TagName":"a","Data":"WP:Requests for comment/Usernames"},{"TagName":"h3","Data":"Usernames implying shared use"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:ISU"},{"TagName":"a","Data":"Wikipedia:Sockpuppetry § Role accounts"},{"TagName":"p","Data":"Because Wikipedia's policy states that user accounts cannot be shared between more than one individual, the following types of usernames are not permitted because they imply shared use:\n"},{"TagName":"a","Data":"shared"},{"TagName":"a","Data":"§ Promotional usernames"},{"TagName":"p","Data":"Remember that promotional editing is not permitted, regardless of the account's chosen username. The conflict of interest guideline advises all users to exercise caution if editing articles about businesses, organizations, products, or other subjects that they are closely connected to. If you choose to edit articles that are in any way related to your company or group, you will need to carefully follow Wikipedia's advice on editing with a conflict of interest.\n"},{"TagName":"a","Data":"promotional"},{"TagName":"a","Data":"conflict of interest guideline"},{"TagName":"a","Data":"advice on editing with a conflict of interest"},{"TagName":"h3","Data":"Non-script usernames"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:NOEMOJI"},{"TagName":"a","Data":"WP:NONSCRIPT"},{"TagName":"p","Data":"The following types of usernames are not permitted due to the difficulty with some web browsers in viewing non-language unicode characters:[3]\n"},{"TagName":"a","Data":"[3]"},{"TagName":"a","Data":"emoji"},{"TagName":"a","Data":"emoticons"},{"TagName":"a","Data":"list of writing systems"},{"TagName":"a","Data":"Unicode symbols"},{"TagName":"p","Data":"Note that this restriction does not apply to signatures, which are governed by Wikipedia's policies on the use of signatures.\n"},{"TagName":"a","Data":"signatures"},{"TagName":"h3","Data":"Confusing usernames"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:UNCONF"},{"TagName":"p","Data":"Some usernames appear problematic without fitting clearly into any of the above categories. This is often the case with confusing or extremely lengthy usernames, which are highly discouraged but which are not so inappropriate on their own as to require action.\n"},{"TagName":"p","Data":"Confusing usernames can often be a red flag for other problems. An editor with a confusing username or signature may be blocked sooner than usual for other inappropriate behavior, such as disruption or vandalism, if their confusing username contributes to the disruption.\n"},{"TagName":"h3","Data":"Exceptions"},{"TagName":"p","Data":"Some usernames that appear to be in breach of this policy have been allowed to stand by consensus because they were created before a change in the policy that would now prohibit such names (see grandfather clause). If you find an apparently problematic username being used by a long-standing editor, it is likely that the matter has been discussed before. Please search that user's talk page (and archives if applicable), and the archives of the administrators' noticeboards and requests for comment on usernames, before deciding to take action as described below.\n"},{"TagName":"a","Data":"grandfather clause"},{"TagName":"a","Data":"administrators' noticeboards"},{"TagName":"a","Data":"requests for comment on usernames"},{"TagName":"a","Data":"below"},{"TagName":"h2","Data":"Dealing with inappropriate usernames"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:BADNAME"},{"TagName":"p","Data":"If you encounter an inappropriate username as described above, there are various actions you might take. Use common sense in making your choice, and avoid \"biting\" newcomers.\n"},{"TagName":"a","Data":"above"},{"TagName":"a","Data":"Use common sense"},{"TagName":"a","Data":"\"biting\" newcomers"},{"TagName":"h3","Data":"No action necessary"},{"TagName":"p","Data":"If the name is not unambiguously problematic, it may be sensible to ignore it. Assume good faith, and also note the exceptions in the section on inappropriate usernames. Also, except in extreme cases, it is probably not worth taking action unless the user has made at least one recent edit.\n"},{"TagName":"a","Data":"Assume good faith"},{"TagName":"a","Data":"exceptions"},{"TagName":"h3","Data":"Talk to the user"},{"TagName":"p","Data":"If you see a username that is problematic but was not obviously created in bad faith, politely draw the user's attention to this policy, and try to encourage them to create a new account with a different username. If you want, you can use the {{subst:uw-username}}, {{subst:uw-uall}} or {{subst:uw-coi-username}} template for this.\n"},{"TagName":"a","Data":"subst:uw-username"},{"TagName":"a","Data":"subst:uw-uall"},{"TagName":"a","Data":"subst:uw-coi-username"},{"TagName":"h3","Data":"Request for comment"},{"TagName":"p","Data":"If, following an attempt to discuss a problematic username with the user, there is still doubt or disagreement as to whether the name is appropriate, you may open a Request for comment on the username, inviting other users to discuss the issue.\n"},{"TagName":"a","Data":"Request for comment on the username"},{"TagName":"h3","Data":"Report blatant violations"},{"TagName":"p","Data":"If you believe that a username needs to be immediately blocked and is an obvious violation of policy, you can report it to Usernames for administrator attention. This page should only be used for clear and egregious username violations that merit an immediate block and without any discussion or warning beforehand.\n"},{"TagName":"a","Data":"Usernames for administrator attention"},{"TagName":"p","Data":"Do not both warn a user account or discuss the username and your concerns with a user account, and file a report against the user account at Usernames for administrator attention at the same time. A warning or discussion by another editor should be perceived as an invitation or an encouragement for the user to change their username or otherwise resolve the matter at-hand, while filing a report against the account invites a block to be immediately placed and without warning or discussion beforehand. These two actions directly counteract with one another; performing both actions can cause confusion, frustration, and the biting of newcomers where the assumption of good faith likely should have been the preferred initial response.\n"},{"TagName":"a","Data":"Usernames for administrator attention"},{"TagName":"a","Data":"biting of newcomers"},{"TagName":"a","Data":"the assumption of good faith"},{"TagName":"h3","Data":"Report other problems"},{"TagName":"p","Data":"If the user with a bad username is breaching other policies, such as those against spam or vandalism, follow up using those policies rather than reporting the username. If the user is editing in a biased or promotional way on a subject they appear to have a connection with, report them at the Conflict of Interest noticeboard.\n"},{"TagName":"a","Data":"spam"},{"TagName":"a","Data":"vandalism"},{"TagName":"a","Data":"Conflict of Interest noticeboard"},{"TagName":"h3","Data":"Usernames for administrator attention guidelines"},{"TagName":"p","Data":"Usernames for administrator attention (UAA) is a noticeboard for drawing attention to abusive usernames quickly. See Wikipedia:Usernames for administrator attention/Instructions for information on how to place or resolve UAA reports, including the options that are available to administrators.\n"},{"TagName":"a","Data":"Usernames for administrator attention"},{"TagName":"a","Data":"Wikipedia:Usernames for administrator attention/Instructions"},{"TagName":"p","Data":"Remember that blocking a new user is not actually something we want to do, it is something we do when it is needed to protect Wikipedia from harm. Generally, editors whose usernames are a technical or borderline violation of the Username policy should be given an opportunity to discuss the username and how they may register a new username. However, users who are reluctant to register a new username and are otherwise showing a positive history of contributions to Wikipedia should be allowed to continue editing in a positive fashion and the matter should be dropped. But this exemption does not apply to editors who have a clearly offensive username, disruptive or vandalizing edits, or edits that show a history of problematic bias or conflict of interest.\n"},{"TagName":"h2","Data":"Other particular types of username"},{"TagName":"h3","Data":"Real names"},{"TagName":"a","Data":"WP:Signature forgery"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:REALNAME"},{"TagName":"a","Data":"WP:IMPERSONATE"},{"TagName":"p","Data":"Minors and children are strongly discouraged from creating accounts with usernames that are their real names, or any nicknames which might be traced to them, and all editors should carefully consider the consequences before doing so. Usernames with this information significantly increase the potential for harassment, especially if these accounts edit in controversial subject areas. In some countries, editing Wikipedia can be illegal, and using your real name can put you at risk of legal consequences. While it is possible to rename your account later (see Changing your username below), a record of your previous username remains permanently.\n"},{"TagName":"a","Data":"harassment"},{"TagName":"a","Data":"Changing your username"},{"TagName":"p","Data":"Do not edit under a name that is likely to imply that you are (or are related to) a specific, identifiable person, unless it is your real name. If you have the same name as a well-known person to whom you are unrelated, and are using your real name, you should state clearly on your userpage that you are unrelated to the well-known person.\n"},{"TagName":"a","Data":"userpage"},{"TagName":"p","Data":"If a username implies that the user is, or is related to, a notable, identifiable or well-known person, the account may be blocked as a precaution against impersonation until the user's proof of identity is provided.\n"},{"TagName":"a","Data":"notable"},{"TagName":"a","Data":"blocked"},{"TagName":"p","Data":"If you have been blocked for using your real name, please do not take offense; we are trying to prevent somebody from impersonating or harassing you, or someone you may share the same real name with. You are welcome to use your real name, but in some cases, you will need to prove that you are who you say you are. You can do this by sending an email to info-enwikimedia.org. Be aware that emails are handled by a volunteer response team; it can take some time before you'll receive a reply. Do not send unsolicited scans of your passport or driver's license to the volunteer response team. Instead, you should contact them to find out the best way to prove your identity. The best way will vary, but could be by using a mail address on a domain name that belongs to you.\n"},{"TagName":"a","Data":"info-enwikimedia.org"},{"TagName":"a","Data":"volunteer response team"},{"TagName":"a","Data":"passport"},{"TagName":"a","Data":"driver's license"},{"TagName":"a","Data":"domain name"},{"TagName":"h3","Data":"Stage names"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:USERSTAGENAME"},{"TagName":"p","Data":"Users may use their stage name, pen name, or other nickname as their username, provided that it uniquely identifies a single person. This is not considered promotional, even if commercial performances or publications are made under such a name, unless the user makes promotional edits within Wikipedia about themselves, their projects, etc. However, a user may not use someone else's stage name as a username, as per the § Real names section of this page.\n"},{"TagName":"a","Data":"stage name"},{"TagName":"a","Data":"pen name"},{"TagName":"a","Data":"§ Real names"},{"TagName":"h3","Data":"Usernames with non-Latin characters"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:NONLATIN"},{"TagName":"a","Data":"WP:LATINPLEASE"},{"TagName":"a","Data":"Wikipedia:Unified login"},{"TagName":"a","Data":"Wikipedia:Signatures § Non-Latin"},{"TagName":"p","Data":"Users with usernames in non-Latin script writing systems are welcome to edit Wikipedia. There is no requirement that usernames must be in English or that Latin script characters must be used. However, such usernames may appear illegible to other contributors to the English Wikipedia, and not every user's keyboard or input device may have immediate access to non-Latin characters. In addition, sometimes certain characters may not display correctly.  As a courtesy to other contributors, and to avoid possible confusion or mis-identification, users with such usernames are encouraged to consider providing a Latin-character transliteration of their username on their userpage, and/or as their signature.\n"},{"TagName":"a","Data":"Latin script"},{"TagName":"a","Data":"writing systems"},{"TagName":"a","Data":"characters"},{"TagName":"a","Data":"keyboard"},{"TagName":"a","Data":"input device"},{"TagName":"a","Data":"transliteration"},{"TagName":"a","Data":"userpage"},{"TagName":"a","Data":"signature"},{"TagName":"p","Data":"For technical reasons, usernames containing the forbidden characters # \u003c \u003e [ ] | { }, as well as  / @ : =, are not possible.[4]\n"},{"TagName":"a","Data":"forbidden characters"},{"TagName":"a","Data":"[4]"},{"TagName":"h3","Data":"Similar usernames"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:IMPERSONATOR"},{"TagName":"a","Data":"WP:SIMILARNAME"},{"TagName":"p","Data":"Usernames that are very similar to existing ones cannot be registered normally – but if you do want to use one, you may request its creation at Wikipedia:Request an account. Usernames that are similar only to unused or inactive accounts should not be a problem. Special:CentralAuth can be used to check for such usernames. The program that checks for similarity is a bit over-sensitive—if the username is different enough as to prevent other people from confusing the two users, the request should be approved. One should not choose a username that implies a relationship with an existing editor (unless the account is actually owned or the relationship is acknowledged by the editor themselves).\n"},{"TagName":"a","Data":"Wikipedia:Request an account"},{"TagName":"a","Data":"Special:CentralAuth"},{"TagName":"p","Data":"If your username is similar to that of another contributor or an article, you may wish to provide some form of disambiguation, such as by adding {{distinguish}} to the top of your user page.\n"},{"TagName":"a","Data":"disambiguation"},{"TagName":"a","Data":"distinguish"},{"TagName":"a","Data":"user page"},{"TagName":"h3","Data":"Commonly misspelled usernames"},{"TagName":"p","Data":"If your username is commonly misspelled, consider helping people by adding redirects to your actual user page and talk page from the misspelled titles. You may wish to consider registering the misspelled username as a doppelgänger account to prevent it from being registered by someone else. The software prevents registration of certain names that are found to be too similar to existing ones; if you cannot register your doppelgänger username for this reason, you should visit Wikipedia:Request an account.\n"},{"TagName":"a","Data":"redirects"},{"TagName":"a","Data":"doppelgänger account"},{"TagName":"a","Data":"Wikipedia:Request an account"},{"TagName":"h3","Data":"UseModWiki-era anonymous users"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:USEMODDOMAIN"},{"TagName":"p","Data":"UseModWiki, the software used on Wikipedia throughout 2001 and in early 2002, treated users who edited without logging in or providing a screen name differently from modern-day MediaWiki. Anonymous users in that time were treated in one of two ways:\n"},{"TagName":"a","Data":"UseModWiki"},{"TagName":"a","Data":"office.bomis.com"},{"TagName":"a","Data":"dhcp-22-128.lclark.edu"},{"TagName":"a","Data":"cnts2p46.uwaterloo.ca"},{"TagName":"a","Data":"T2323"},{"TagName":"a","Data":"indefinitely blocked"},{"TagName":"a","Data":"Phase II software"},{"TagName":"a","Data":"209.69.30.xxx"},{"TagName":"a","Data":"62.110.183.xxx"},{"TagName":"h2","Data":"Shared accounts"},{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"Wikipedia:Sockpuppetry § Role accounts"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:NOSHARING"},{"TagName":"a","Data":"WP:SHAREDACCOUNT"},{"TagName":"p","Data":"Any user account should represent an individual and not a group (and an individual should normally only have one user account; see next section). Sharing an account – or the password to an account – with others is not permitted, and evidence of doing so will result in the user being required to stop the practice and change their password, or in sanctions (up to and including the account being blocked), depending on circumstances. For accounts being used to represent a group or organization, see § Promotional usernames and § Usernames implying shared use above.\n"},{"TagName":"a","Data":"§ Promotional usernames"},{"TagName":"a","Data":"§ Usernames implying shared use"},{"TagName":"p","Data":"Exceptions to this rule can be made for non-editing accounts approved to provide email access, accounts approved by the Wikimedia Foundation (see list), and bot accounts that are maintained by more than one contributor, provided the existence of such an arrangement is made clear and has consensus.\n"},{"TagName":"a","Data":"Wikimedia Foundation"},{"TagName":"a","Data":"list"},{"TagName":"a","Data":"bot accounts"},{"TagName":"h2","Data":"Using multiple accounts"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:MULTIPLE"},{"TagName":"a","Data":"WP:MULTIACCOUNT"},{"TagName":"a","Data":"Wikipedia:Sockpuppetry § Legitimate uses"},{"TagName":"p","Data":"It is recommended that contributors not use multiple accounts without good reason. For example, a user may wish to create an alternate account for use on public computers as a precaution to keep their primary account more secure. Contributors operating any sort of automated editing process should do so under an alternative bot account. It is recommended that multiple accounts be identified as such on their user pages; templates such as {{User alternative account}} or one of a selection of user boxes may be used for this purpose. \n"},{"TagName":"a","Data":"bot account"},{"TagName":"a","Data":"user pages"},{"TagName":"a","Data":"templates"},{"TagName":"a","Data":"User alternative account"},{"TagName":"a","Data":"one of a selection of user boxes"},{"TagName":"p","Data":"The use of multiple accounts outside of established policy for doing so is known as sockpuppetry, and is not permitted. For example, multiple accounts may not be used to comment on proposals or requests, cast votes, or engage in edit warring. Because policies apply to individuals, not accounts, blocked or banned users must not use sock puppets to circumvent a block; doing so will result in an extension of the block or ban.\n"},{"TagName":"a","Data":"sockpuppetry"},{"TagName":"a","Data":"edit warring"},{"TagName":"a","Data":"blocked"},{"TagName":"a","Data":"banned"},{"TagName":"h2","Data":"Changing your username"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:UNC"},{"TagName":"p","Data":"Usernames can be changed by global renamers; requests should be made at Wikipedia:Changing username. User accounts with few or no edits might not be renamed, as it is quicker and easier to simply create a new account.\n"},{"TagName":"a","Data":"global renamers"},{"TagName":"a","Data":"Wikipedia:Changing username"},{"TagName":"a","Data":"create a new account"},{"TagName":"p","Data":"Once a username has been changed, existing contributions will be listed under the new name in page histories, diffs, logs, and user contributions. Signatures on discussion pages will continue to use the old name; while these can be changed manually, it is not recommended unless a contributor wishes to remove as much information as possible about their former name for privacy reasons. In such situations the old name will still be available in old versions of discussion pages. Username changes are listed in the user rename log and the global rename log.\n"},{"TagName":"a","Data":"page histories"},{"TagName":"a","Data":"diffs"},{"TagName":"a","Data":"logs"},{"TagName":"a","Data":"user contributions"},{"TagName":"a","Data":"user rename log"},{"TagName":"a","Data":"global rename log"},{"TagName":"h3","Data":"Deleting and merging accounts"},{"TagName":"p","Data":"It is not possible to delete user accounts, as all contributions must be assigned to some identifier; either a username or an IP address.[5] Editors seeking privacy per courtesy vanishing / right to vanish can usually have their accounts renamed and their user pages (and in exceptional cases user talk pages) deleted.\n"},{"TagName":"a","Data":"IP address"},{"TagName":"a","Data":"[5]"},{"TagName":"a","Data":"courtesy vanishing"},{"TagName":"a","Data":"right to vanish"},{"TagName":"a","Data":"deleted"},{"TagName":"p","Data":"It is not currently possible to merge more than one user account together and combine them into one user account on the English Wikipedia.\n"},{"TagName":"h2","Data":"See also"},{"TagName":"a","Data":"Namewarning"},{"TagName":"a","Data":"Wikipedia:Identification"},{"TagName":"a","Data":"Wikipedia:Usernames for administrator attention"},{"TagName":"a","Data":"Category:Wikipedians who are indefinitely blocked for a violation of the username policy"},{"TagName":"a","Data":"Wikipedia:Naming conventions (technical restrictions) § Restrictions on usernames"},{"TagName":"a","Data":"m:Help:Unified login"},{"TagName":"h2","Data":"Notes"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"some Indian names"},{"TagName":"a","Data":"some German"},{"TagName":"a","Data":"and Thai"},{"TagName":"a","Data":"Scunthorpe problems"},{"TagName":"a","Data":"use common sense"},{"TagName":"a","Data":"assume good faith"},{"TagName":"a","Data":"User:AmandaNP/UAA/Blacklist"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"disclose non-public or personally identifiable information"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"2017 RfC"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"Quarry 74149"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"bug T34815"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"Legitimate uses"},{"TagName":"a","Data":"Inappropriate uses"},{"TagName":"a","Data":"Meat puppetry"},{"TagName":"a","Data":"Canvassing"},{"TagName":"a","Data":"Username policy"},{"TagName":"a","Data":"Clean start"},{"TagName":"a","Data":"Single-purpose account"},{"TagName":"a","Data":"Sleeper accounts"},{"TagName":"a","Data":"Outing"},{"TagName":"a","Data":"Signs"},{"TagName":"a","Data":"Motivations"},{"TagName":"a","Data":"List of signs"},{"TagName":"a","Data":"Duck test"},{"TagName":"a","Data":"An obvious sock is obvious"},{"TagName":"a","Data":"Don't be quick to assume that someone is a sockpuppet"},{"TagName":"a","Data":"Lurkers"},{"TagName":"a","Data":"Investigations"},{"TagName":"a","Data":"Triggers"},{"TagName":"a","Data":"Administrators instructions"},{"TagName":"a","Data":"Requests for checkuser"},{"TagName":"a","Data":"CheckUser criteria"},{"TagName":"a","Data":"Consequences"},{"TagName":"a","Data":"Block"},{"TagName":"a","Data":"Ban"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"accounts"},{"TagName":"a","Data":"governance"},{"TagName":"a","Data":"Unregistered (IP) users"},{"TagName":"a","Data":"Why create an account?"},{"TagName":"a","Data":"Create an account"},{"TagName":"a","Data":"Request an account"},{"TagName":"a","Data":"IPs are human too"},{"TagName":"a","Data":"IP addresses are not people"},{"TagName":"a","Data":"IP hopper"},{"TagName":"a","Data":"New account"},{"TagName":"a","Data":"Logging in"},{"TagName":"a","Data":"Reset passwords"},{"TagName":"a","Data":"Username policy"},{"TagName":"a","Data":"Changing username"},{"TagName":"a","Data":"Usernames for administrator attention"},{"TagName":"a","Data":"Unified login or SUL"},{"TagName":"a","Data":"Alternate account"},{"TagName":"a","Data":"Password strength requirements"},{"TagName":"a","Data":"User account security"},{"TagName":"a","Data":"Personal security practices"},{"TagName":"a","Data":"Two-factor authentication"},{"TagName":"a","Data":"2FA for AWB"},{"TagName":"a","Data":"Committed identity"},{"TagName":"a","Data":"On privacy, confidentiality and discretion"},{"TagName":"a","Data":"Compromised accounts"},{"TagName":"a","Data":"How to not get outed"},{"TagName":"a","Data":"Blocking policy"},{"TagName":"a","Data":"FAQ"},{"TagName":"a","Data":"Admin's guide"},{"TagName":"a","Data":"Tools"},{"TagName":"a","Data":"Autoblock"},{"TagName":"a","Data":"Appealing a block"},{"TagName":"a","Data":"Guide to appealing blocks"},{"TagName":"a","Data":"UTRS Unblock Ticket Request System"},{"TagName":"a","Data":"Blocking IP addresses"},{"TagName":"a","Data":"Range blocks"},{"TagName":"a","Data":"IPv6"},{"TagName":"a","Data":"Open proxies"},{"TagName":"a","Data":"Banning policy"},{"TagName":"a","Data":"ArbCom appeals"},{"TagName":"a","Data":"Sanctions"},{"TagName":"a","Data":"Personal sanctions"},{"TagName":"a","Data":"General sanctions"},{"TagName":"a","Data":"Contentious topics"},{"TagName":"a","Data":"Log"},{"TagName":"a","Data":"Essay"},{"TagName":"a","Data":"Long-term abuse"},{"TagName":"a","Data":"Standard offer"},{"TagName":"a","Data":"Global actions"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"Single-purpose account"},{"TagName":"a","Data":"Sleeper account"},{"TagName":"a","Data":"Vandalism-only account"},{"TagName":"a","Data":"Wikibreak"},{"TagName":"a","Data":"Enforcer"},{"TagName":"a","Data":"Retiring"},{"TagName":"a","Data":"Courtesy vanishing"},{"TagName":"a","Data":"Clean start"},{"TagName":"a","Data":"Quiet return"},{"TagName":"a","Data":"User groups"},{"TagName":"a","Data":"global user groups"},{"TagName":"a","Data":"Requests for permissions"},{"TagName":"a","Data":"Admin instructions"},{"TagName":"a","Data":"Admin guide"},{"TagName":"a","Data":"Account creator"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"(Auto) confirmed"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Autopatrolled"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"AutoWikiBrowser"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Bot"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Edit filter helper"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Event coordinator"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Extended confirmed"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"File mover"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"IP block exempt"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Mass message sender"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"New page reviewer"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Page mover"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Pending changes reviewer"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Rollback"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Template editor"},{"TagName":"a","Data":"PERM"},{"TagName":"a","Data":"Global rights policy"},{"TagName":"a","Data":"Volunteer Response Team"},{"TagName":"a","Data":"Administrator"},{"TagName":"a","Data":"RfA"},{"TagName":"a","Data":"Bureaucrat"},{"TagName":"a","Data":"RfB"},{"TagName":"a","Data":"CheckUser"},{"TagName":"a","Data":"Oversight"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Edit filter manager"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Interface administrator"},{"TagName":"a","Data":"Request"},{"TagName":"a","Data":"Founder"},{"TagName":"a","Data":"Importer"},{"TagName":"a","Data":"Researcher"},{"TagName":"a","Data":"Committees"},{"TagName":"a","Data":"Arbitration Committee"},{"TagName":"a","Data":"Bot approvals group"},{"TagName":"a","Data":"Functionaries"},{"TagName":"a","Data":"SPI clerks"},{"TagName":"a","Data":"ArbCom clerks"},{"TagName":"a","Data":"Governance"},{"TagName":"a","Data":"Administration"},{"TagName":"a","Data":"FAQ"},{"TagName":"a","Data":"Formal organization"},{"TagName":"a","Data":"Editorial oversight and control"},{"TagName":"a","Data":"Quality control"},{"TagName":"a","Data":"Wikimedia Foundation"},{"TagName":"a","Data":"Board"},{"TagName":"a","Data":"Founder's seat"},{"TagName":"a","Data":"Meta-Wiki"},{"TagName":"a","Data":"Proposals"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"Elections"},{"TagName":"a","Data":"Policies and guidelines"},{"TagName":"a","Data":"Petitions"},{"TagName":"a","Data":"Noticeboards"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Reforms"}]