[{"TagName":"p","Data":"\n"},{"TagName":"a","Data":"Wikipedia:Requested articles"},{"TagName":"a","Data":"Wikipedia:Requests for administrator attention"},{"TagName":"a","Data":"Wikipedia:Featured articles"},{"TagName":"a","Data":"Wikipedia:Arbitration/Requests"},{"TagName":"a","Data":"Wikipedia:Help desk"},{"TagName":"a","Data":"extended confirmed protection"},{"TagName":"a","Data":"comment"},{"TagName":"a","Data":"↓↓Skip to current nominations for adminship"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"search"},{"TagName":"a","Data":"Administrators"},{"TagName":"a","Data":"Requests for adminship"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"watch"},{"TagName":"a","Data":"RfA talk"},{"TagName":"a","Data":"new post"},{"TagName":"a","Data":"Archives"},{"TagName":"a","Data":"RfA nominations"},{"TagName":"a","Data":"Request a nom"},{"TagName":"a","Data":"Optional RfA candidate poll"},{"TagName":"a","Data":"Advice for RfA candidates"},{"TagName":"a","Data":"Guide"},{"TagName":"a","Data":"Miniguide"},{"TagName":"a","Data":"Advice for asking questions at RfA"},{"TagName":"a","Data":"Advice for voters"},{"TagName":"a","Data":"Arguments to avoid"},{"TagName":"a","Data":"Requests for adminship by year"},{"TagName":"a","Data":"By month"},{"TagName":"a","Data":"Alphabetical"},{"TagName":"a","Data":"Chronological"},{"TagName":"a","Data":"Alphabetical"},{"TagName":"a","Data":"Chronological"},{"TagName":"a","Data":"Bureaucrats"},{"TagName":"a","Data":"Noticeboard"},{"TagName":"a","Data":"Alphabetical"},{"TagName":"a","Data":"Chronological"},{"TagName":"a","Data":"Alphabetical"},{"TagName":"a","Data":"Chronological"},{"TagName":"a","Data":"Bureaucrat discussion"},{"TagName":"a","Data":"Bureaucrat activity"},{"TagName":"a","Data":"RFA reform"},{"TagName":"a","Data":"Adminship reform"},{"TagName":"a","Data":"RfX Report"},{"TagName":"a","Data":"Inactive administrators"},{"TagName":"a","Data":"Former administrators"},{"TagName":"a","Data":"Desysoppings by month"},{"TagName":"a","Data":"User rights log"},{"TagName":"a","Data":"Old log"},{"TagName":"a","Data":"Meta log"},{"TagName":"a","Data":"Meta old log"},{"TagName":"a","Data":"list all"},{"TagName":"a","Data":"list all"},{"TagName":"a","Data":"Purge page cache"},{"TagName":"a","Data":"adminship"},{"TagName":"a","Data":"bureaucratship"},{"TagName":"a","Data":"update"},{"TagName":"a","Data":"Recent RfAs"},{"TagName":"a","Data":"successful"},{"TagName":"a","Data":"unsuccessful"},{"TagName":"a","Data":"Purge this page"},{"TagName":"a","Data":"adminship"},{"TagName":"a","Data":"bureaucratship"},{"TagName":"a","Data":"update"},{"TagName":"a","Data":"Recent RfAs"},{"TagName":"a","Data":"successful"},{"TagName":"a","Data":"unsuccessful"},{"TagName":"a","Data":"Purge this page"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:RFA"},{"TagName":"a","Data":"WP:RFX"},{"TagName":"p","Data":"Requests for adminship (RfA) is the process by which the Wikipedia community decides who will become administrators (also known as admins), who are users with access to additional technical features that aid in maintenance.  Users can either submit their own requests for adminship (self-nomination) or may be nominated by other users. Please be familiar with the administrators' reading list, how-to guide, and guide to requests for adminship before submitting your request. Also, consider asking the community about your chances of passing an RfA.\n"},{"TagName":"a","Data":"Wikipedia community"},{"TagName":"a","Data":"administrators"},{"TagName":"a","Data":"maintenance"},{"TagName":"a","Data":"self-nomination"},{"TagName":"a","Data":"administrators' reading list"},{"TagName":"a","Data":"how-to guide"},{"TagName":"a","Data":"guide to requests for adminship"},{"TagName":"a","Data":"asking the community"},{"TagName":"p","Data":"This page also hosts requests for bureaucratship (RfB), where new bureaucrats are selected.\n"},{"TagName":"a","Data":"requests for bureaucratship"},{"TagName":"a","Data":"bureaucrats"},{"TagName":"p","Data":"If you are new to participating in a request for adminship, or are not sure how to gauge the candidate, then kindly go through this mini guide for RfA voters before you participate.\n"},{"TagName":"a","Data":"this mini guide for RfA voters"},{"TagName":"h2","Data":"About administrators"},{"TagName":"p","Data":"The additional features granted to administrators are considered to require a high level of trust from the community. While administrative actions are publicly logged and can be reverted by other administrators just as other edits can be, the actions of administrators involve features that can affect the entire site. Among other functions, administrators are responsible for blocking users from editing, controlling page protection, and deleting pages. However, they are not the final arbiters in content disputes and do not have special powers to decide on content matters, except to enforce the community consensus and the Arbitration Commitee rulings by protecting or deleting pages and applying sanctions to users.\n"},{"TagName":"a","Data":"administrators"},{"TagName":"a","Data":"publicly logged"},{"TagName":"a","Data":"content disputes"},{"TagName":"a","Data":"Arbitration Commitee"},{"TagName":"h2","Data":"About RfA"},{"TagName":"a","Data":"Recently closed RfAs and RfBs"},{"TagName":"a","Data":"update"},{"TagName":"a","Data":"Hey man im josh"},{"TagName":"a","Data":"315"},{"TagName":"a","Data":"theleekycauldron2"},{"TagName":"a","Data":"313"},{"TagName":"a","Data":"Pppery"},{"TagName":"a","Data":"195"},{"TagName":"a","Data":"Firefangledfeathers"},{"TagName":"a","Data":"197"},{"TagName":"p","Data":"The community grants administrator access to trusted users, so nominees should have been on Wikipedia long enough for people to determine whether they are trustworthy. Administrators are held to high standards of conduct because other editors often turn to them for help and advice, and because they have access to tools that can have a negative impact on users or content if carelessly applied.\n"},{"TagName":"h3","Data":"Nomination standards"},{"TagName":"p","Data":"The only formal prerequisite for adminship is having an account on Wikipedia. However, editing the RfA page is limited to extended confirmed users, so editors without an extended confirmed account may have their RfA subpage transcluded by someone who has the right. This is due to the community deeming that editors without the requisite experience (500 edits and 30 days of experience) are generally unlikely to succeed at gaining adminship.[1] The community looks for a variety of factors in candidates and discussion can be intense. To get an insight of what the community is looking for, you could review some successful and some unsuccessful RfAs, or start an RfA candidate poll.\n"},{"TagName":"a","Data":"having an account"},{"TagName":"a","Data":"extended confirmed"},{"TagName":"a","Data":"unlikely"},{"TagName":"a","Data":"[1]"},{"TagName":"a","Data":"successful"},{"TagName":"a","Data":"unsuccessful"},{"TagName":"a","Data":"RfA candidate poll"},{"TagName":"p","Data":"If you are unsure about nominating yourself or another user for adminship, you may first wish to consult a few editors you respect to get an idea of what the community might think of your request. There is also a list of editors willing to consider nominating you. Editors interested in becoming administrators might explore adoption by a more experienced user to gain experience. They may also add themselves to Category:Wikipedia administrator hopefuls; a list of names and some additional information are automatically maintained at Wikipedia:List of administrator hopefuls. The RfA guide and the miniguide might be helpful, while Advice for RfA candidates will let you evaluate whether or not you are ready to be an admin.\n"},{"TagName":"a","Data":"willing to consider"},{"TagName":"a","Data":"adoption"},{"TagName":"a","Data":"Category:Wikipedia administrator hopefuls"},{"TagName":"a","Data":"Wikipedia:List of administrator hopefuls"},{"TagName":"a","Data":"RfA guide"},{"TagName":"a","Data":"miniguide"},{"TagName":"a","Data":"Advice for RfA candidates"},{"TagName":"h3","Data":"Nominations"},{"TagName":"p","Data":"To nominate either yourself or another user for adminship, follow these instructions. If you wish to nominate someone else, check with them before making the nomination page. Nominations may only be added by the candidate or after the candidate has signed the acceptance of the nomination.\n"},{"TagName":"a","Data":"these instructions"},{"TagName":"h3","Data":"Notice of RfA"},{"TagName":"p","Data":"Some candidates display the {{RfX-notice}} on their userpages. Also, per community consensus, RfAs are to be advertised on MediaWiki:Watchlist-messages and Template:Centralized discussion. The watchlist notice will only be visible to you if your user interface language is set to (plain) en.\n"},{"TagName":"a","Data":"RfX-notice"},{"TagName":"a","Data":"community consensus"},{"TagName":"a","Data":"MediaWiki:Watchlist-messages"},{"TagName":"a","Data":"Template:Centralized discussion"},{"TagName":"h3","Data":"Expressing opinions"},{"TagName":"p","Data":"All Wikipedians—including those without an account or not logged in (\"anons\")—are welcome to comment and ask questions in an RfA, but numerical (#) \"votes\" in the Support, Oppose, and Neutral sections may only be placed by editors while logged in to their account.\n"},{"TagName":"p","Data":"If you are relatively new to contributing to Wikipedia, or if you have not yet participated on many RfAs, please consider first reading \"Advice for RfA voters\".\n"},{"TagName":"a","Data":"Advice for RfA voters"},{"TagName":"p","Data":"There is a limit of two questions per editor, with relevant follow-ups permitted. The two-question limit cannot be circumvented by asking questions that require multiple answers (e.g. asking the candidate what they would do in each of five scenarios). The candidate may respond to the comments of others. Certain comments may be discounted if there are suspicions of fraud; these may be the contributions of very new editors, sockpuppets, or meatpuppets. Please explain your opinion by including a short explanation of your reasoning. Your input (positive or negative) will carry more weight if supported by evidence. \n"},{"TagName":"a","Data":"sockpuppets"},{"TagName":"a","Data":"meatpuppets"},{"TagName":"p","Data":"To add a comment, click the \"Voice your opinion\" link for the candidate. Always be respectful towards others in your comments. Constructive criticism will help the candidate make proper adjustments and possibly fare better in a future RfA attempt. Note that bureaucrats have been authorized by the community to clerk at RfA, so they may appropriately deal with comments and !votes which they deem to be inappropriate. You may wish to review arguments to avoid in adminship discussions. Irrelevant questions may be removed or ignored, so please stay on topic. \n"},{"TagName":"a","Data":"be respectful"},{"TagName":"a","Data":"arguments to avoid in adminship discussions"},{"TagName":"p","Data":"The RfA process attracts many Wikipedians and some may routinely oppose many or most requests; other editors routinely support many or most requests. Although the community currently endorses the right of every Wikipedian with an account to participate, one-sided approaches to RfA voting have been labeled as \"trolling\" by some. Before commenting, or responding to comments, in an RfA (especially Oppose comments with uncommon rationales or which feel like \"baiting\") consider whether others are likely to treat it as influential, and whether RfA is an appropriate forum for your point. Try hard not to fan the fire. Remember, the bureaucrats who close discussions have considerable experience and give more weight to constructive comments than unproductive ones.\n"},{"TagName":"a","Data":"trolling"},{"TagName":"h3","Data":"Discussion, decision, and closing procedures"},{"TagName":"a","Data":"Wikipedia:Bureaucrats § Promotions and RfX closures"},{"TagName":"p","Data":"Most nominations will remain active for a minimum of seven days from the time the nomination is posted on this page, during which users give their opinions, ask questions, and make comments. This discussion process is not a vote (it is sometimes referred to as a !vote, using the computer science negation symbol). At the end of the discussion period, a bureaucrat will review the discussion to see whether there is a consensus for promotion. Consensus at RfA is not determined by surpassing a numerical threshold, but by the strength of rationales presented. In practice, most RfAs above 75% support pass. \n"},{"TagName":"a","Data":"negation"},{"TagName":"a","Data":"bureaucrat"},{"TagName":"a","Data":"consensus"},{"TagName":"p","Data":"In December 2015 the community determined that in general, RfAs that finish between 65 and 75% support are subject to the discretion of bureaucrats (so, therefore, almost all RfAs below 65% will fail). However, a request for adminship is first and foremost a consensus-building process.[2] In calculating an RfA's percentage, only numbered Support and Oppose comments are considered. Neutral comments are ignored for calculating an RfA's percentage, but they (and other relevant information) are considered for determining consensus by the closing bureaucrat. \n"},{"TagName":"a","Data":"determined"},{"TagName":"a","Data":"[2]"},{"TagName":"p","Data":"In nominations where consensus is unclear, detailed explanations behind Support or Oppose comments will have more impact than positions with no explanations or simple comments such as \"yep\" and \"no way\".[3] A nomination may be closed as successful only by bureaucrats. In exceptional circumstances, bureaucrats may extend RfAs beyond seven days or restart the nomination to make consensus clearer. They may also close nominations early if success is unlikely and leaving the application open has no likely benefit, and the candidate may withdraw their application at any time for any reason. \n"},{"TagName":"a","Data":"[3]"},{"TagName":"p","Data":"If uncontroversial, any user in good standing can close a request that has no chance of passing in accordance with WP:SNOW or WP:NOTNOW. Do not close any requests that you have taken part in, or those that have even a slim chance of passing, unless you are the candidate and you are withdrawing your application. In the case of vandalism, improper formatting, or a declined or withdrawn nomination, non-bureaucrats may also delist a nomination. A list of procedures to close an RfA may be found at WP:Bureaucrats. If your nomination fails, then please wait for a reasonable period of time before renominating yourself or accepting another nomination. Some candidates have tried again and succeeded within three months, but many editors prefer to wait considerably longer before reapplying.\n"},{"TagName":"a","Data":"WP:SNOW"},{"TagName":"a","Data":"WP:NOTNOW"},{"TagName":"a","Data":"WP:Bureaucrats"},{"TagName":"h2","Data":"Current nominations for adminship"},{"TagName":"p","Data":"Current time is 19:38:00, 15 October 2023 (UTC)\n"},{"TagName":"a","Data":"15 October"},{"TagName":"a","Data":"2023"},{"TagName":"a","Data":"UTC"},{"TagName":"p","Data":"Purge page cache if nominations have not updated.\n"},{"TagName":"a","Data":"Purge page cache"},{"TagName":"h2","Data":"About RfB"},{"TagName":"a","Data":"Wikipedia:Bot requests"},{"TagName":"a","Data":"Wikipedia:Referencing for beginners"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:RFB"},{"TagName":"p","Data":"Requests for bureaucratship (RfB) is the process by which the Wikipedia community decides who will become bureaucrats.  Bureaucrats can make other users administrators or bureaucrats, based on community decisions reached here, and remove administrator rights in limited circumstances. They can also grant or remove bot status on an account.\n"},{"TagName":"a","Data":"Wikipedia community"},{"TagName":"a","Data":"bureaucrats"},{"TagName":"a","Data":"limited circumstances"},{"TagName":"a","Data":"bot status"},{"TagName":"p","Data":"The process for bureaucrats is similar to that for adminship above; however the expectation for promotion to bureaucratship is significantly higher than for admin, requiring a clearer consensus. In general, the threshold for consensus is somewhere around 85%. Bureaucrats are expected to determine consensus in difficult cases and be ready to explain their decisions.\n"},{"TagName":"p","Data":"\nCreate a new RfB page as you would for an RfA, and insert .mw-parser-output .pre-borderless{border:none}"},{"TagName":"a","Data":"subst:RfB"},{"TagName":"p","Data":" into it, then answer the questions. New bureaucrats are recorded at Wikipedia:Successful bureaucratship candidacies. Failed nominations are at Wikipedia:Unsuccessful bureaucratship candidacies.\n"},{"TagName":"a","Data":"Wikipedia:Successful bureaucratship candidacies"},{"TagName":"a","Data":"Wikipedia:Unsuccessful bureaucratship candidacies"},{"TagName":"p","Data":"At minimum, study what is expected of a bureaucrat by reading discussions at Wikipedia talk:Requests for adminship including the recent archives, before seeking this position.\n"},{"TagName":"a","Data":"Wikipedia talk:Requests for adminship"},{"TagName":"p","Data":"While canvassing for support is often viewed negatively by the community, some users find it helpful to place the neutrally worded {{RfX-notice|b}} on their userpages – this is generally not seen as canvassing. Like requests for adminship, requests for bureaucratship are advertised on the watchlist and on Template:Centralized discussion.\n"},{"TagName":"a","Data":"canvassing"},{"TagName":"a","Data":"RfX-notice"},{"TagName":"a","Data":"Template:Centralized discussion"},{"TagName":"p","Data":"Please add new requests at the top of the section immediately below this line.\n"},{"TagName":"h2","Data":"Current nominations for bureaucratship"},{"TagName":"h2","Data":"Related pages"},{"TagName":"a","Data":"Wikipedia:Requests for adminship/Debriefs"},{"TagName":"a","Data":"Wikipedia:Successful requests for adminship"},{"TagName":"a","Data":"Wikipedia:Unsuccessful adminship candidacies"},{"TagName":"a","Data":"Wikipedia:Bureaucrats' noticeboard"},{"TagName":"a","Data":"Wikipedia:Bots/Requests for approval"},{"TagName":"a","Data":"Wikipedia:Arbitration/Requests/Case"},{"TagName":"a","Data":"Wikipedia:Administrators § Grievances by users (\"administrator abuse\")"},{"TagName":"a","Data":"Wikipedia:Requests for de-adminship"},{"TagName":"a","Data":"Wikipedia:Miniguide to requests for adminship"},{"TagName":"a","Data":"Wikipedia:Guide to requests for adminship"},{"TagName":"a","Data":"Wikipedia:Advice for RfA candidates"},{"TagName":"a","Data":"Nominator's guide"},{"TagName":"a","Data":"Wikipedia:Request an RfA nomination"},{"TagName":"a","Data":"Wikipedia:Requests for permissions"},{"TagName":"h2","Data":"Footnotes"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"Wikipedia talk:Requests for adminship/Archive 248#Extended confirmed?"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"May 2019 RfC"},{"TagName":"a","Data":"^"}]