[{"TagName":"a","Data":"policy"},{"TagName":"a","Data":"normally"},{"TagName":"a","Data":"consensus"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:IUP"},{"TagName":"a","Data":"WP:IMAGEPOL"},{"TagName":"a","Data":"copyrighted"},{"TagName":"a","Data":"Content policies"},{"TagName":"a","Data":"Neutral point of view"},{"TagName":"a","Data":"No original research"},{"TagName":"a","Data":"Verifiability"},{"TagName":"a","Data":"Article titles"},{"TagName":"a","Data":"Biographies of living persons"},{"TagName":"a","Data":"Image use policy"},{"TagName":"a","Data":"What Wikipedia is not"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"p","Data":"This page sets out the policies towards images—including format, content, and copyright issues—applicable on the English-language Wikipedia.\n"},{"TagName":"a","Data":"copyright"},{"TagName":"a","Data":"Wikipedia"},{"TagName":"p","Data":"For information on media in general (images, sound files, etc.), see Help:Creation and usage of media files. For information on uploading, see Wikipedia:Uploading images, or go directly to Special:Upload.\nFor other legal and copyright policies, see Wikipedia:List of policies § Legal.\n"},{"TagName":"a","Data":"Help:Creation and usage of media files"},{"TagName":"a","Data":"Wikipedia:Uploading images"},{"TagName":"a","Data":"Special:Upload"},{"TagName":"a","Data":"Wikipedia:List of policies § Legal"},{"TagName":"p","Data":"\n"},{"TagName":"h2","Data":"Identifying usable images"},{"TagName":"h3","Data":"Copyright and licensing"},{"TagName":"p","Data":""},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:IUP#COPYRIGHT"},{"TagName":"a","Data":"WP:IUPC"},{"TagName":"p","Data":"Before you upload an image, make sure that the image falls in one of the four categories:\n"},{"TagName":"a","Data":"screenshot"},{"TagName":"a","Data":"example"},{"TagName":"a","Data":"see below for details"},{"TagName":"a","Data":"acceptable free license"},{"TagName":"a","Data":"example"},{"TagName":"a","Data":"see below for details"},{"TagName":"a","Data":"public domain"},{"TagName":"a","Data":"example"},{"TagName":"a","Data":"see below for details"},{"TagName":"a","Data":"conditions for non-free content"},{"TagName":"a","Data":"non-free use rationale"},{"TagName":"a","Data":"example"},{"TagName":"a","Data":"see below for details"},{"TagName":"h4","Data":"User-created images"},{"TagName":"p","Data":"Wikipedia encourages users to upload their own images. All user-created images must be licensed under a free license, such as a Creative Commons license, or released into the public domain, which removes all copyright and licensing restrictions. When licensing an image, it is common practice to multi-license under both GFDL and a Creative Commons license.\n"},{"TagName":"a","Data":"Creative Commons"},{"TagName":"a","Data":"public domain"},{"TagName":"p","Data":"Such images can include photographs which you yourself took. The legal rights for images generally lie with the photographer, not the subject. Simply re-tracing a copyrighted image or diagram does not necessarily create a new copyright—copyright is generated only by instances of \"creativity\", and not by the amount of labor which went into the creation of the work.  \n"},{"TagName":"a","Data":"diagram"},{"TagName":"p","Data":"Photographs of two-dimensional objects such as paintings in a museum often do not create a new copyright (see the section on the public domain below), as, within the United States, these are considered \"slavish copies\" without any creativity (see Bridgeman Art Library v. Corel Corp.).\n"},{"TagName":"a","Data":"public domain"},{"TagName":"a","Data":"Bridgeman Art Library v. Corel Corp."},{"TagName":"p","Data":"Photographs of three-dimensional objects almost always generate a new copyright, though others may continue to hold copyright in items depicted in such photographs. Whether the photo carries the copyright of the object photographed depends on numerous factors. For three-dimensional art and architecture such as buildings in public spaces, each country has unique freedom of panorama allowances that consider if such photographs are treated as derivative works of the object and thus copyrighted; Commons:Freedom of panorama outlines these clauses per jurisdiction. The shape and design of utilitarian objects, such as cars, furniture, and tools, are generally considered uncopyrightable, allowing such photos to be put into the public domain or freely licensed; however this does not extend to decorative features such as artistic elements on the object's surfaces like an artistic painting on a car's hood. If you have questions in respect to this, please ask the regulars at Wikipedia talk:Copyrights.\n"},{"TagName":"a","Data":"freedom of panorama"},{"TagName":"a","Data":"derivative works"},{"TagName":"a","Data":"Commons:Freedom of panorama"},{"TagName":"a","Data":"Wikipedia talk:Copyrights"},{"TagName":"p","Data":"Images with you, friends or family prominently featured in a way that distracts from the image topic are not recommended for the main namespace. These images are considered self-promotion and the Wikipedia community has repeatedly reached consensus to delete such images. Using such images on user pages is allowed.\n"},{"TagName":"p","Data":"Some images may contain trademarked logos incidentally (or purposely if the image is either freely licensed, covered under freedom of panorama, or being too simple to be copyrightable). If this is the case, please tag it with {{trademark}}. Copyrighted elements may also be present in de minimis in photographs, where the copyrighted element is visible but not the focus of the photograph. In such cases, de minimis copyrighted elements do not affect the copyright of the photograph; such a photo may still be licensed freely. For example, a photograph of Times Square can be considered free despite the numerous advertising signs in sight, as these ads are considered to be de minimis.\n"},{"TagName":"a","Data":"trademarked"},{"TagName":"a","Data":"trademark"},{"TagName":"a","Data":"de minimis"},{"TagName":"a","Data":"a photograph of Times Square"},{"TagName":"p","Data":"User-made images can also include the recreation of graphs, charts, drawings, and maps directly from available data, as long as the user-created format does not mimic the exact style of the original work. Technical data is uncopyrightable, lacking creativity, but the presentation of data in a graph or chart can be copyrighted, so a user-made version should be sufficiently different in presentation from the original to remain free. In such cases, it is required to include verification of the source(s) of the original data when uploading such images. See, for example File:Painted Turtle Distribution alternate.svg, File:Conventional 18-wheeler truck diagram.svg.\n"},{"TagName":"a","Data":"Technical data is uncopyrightable"},{"TagName":"a","Data":"verification"},{"TagName":"a","Data":"File:Painted Turtle Distribution alternate.svg"},{"TagName":"a","Data":"File:Conventional 18-wheeler truck diagram.svg"},{"TagName":"p","Data":"Additionally, user-made images may be wholly original. In such cases, the image should be primarily serving an educational purpose, and not as a means of self-promotion of the user's artistic skills. The subject to be illustrated should be clearly identifiable in context, and should not be overly stylized. See for example File:Checker shadow illusion.svg. \n"},{"TagName":"a","Data":"File:Checker shadow illusion.svg"},{"TagName":"p","Data":"When making user-made diagrams or similar images, try not to use color alone to convey information, as it is inaccessible in many situations.\n"},{"TagName":"a","Data":"try not to use color alone"},{"TagName":"a","Data":"inaccessible in many situations."},{"TagName":"h4","Data":"AI-generated images"},{"TagName":"p","Data":"With new processes like Stable Diffusion that can generate high-quality art from a large database of art, the question of copyright remains open, and at the present time, such images should not be used on Wikipedia unless there is assurance that all images used in the AI system are from free or public domain sources. The U.S. Copyright Office has ruled that AI-generated images cannot be copyrighted,[1] but there remain questions if these are potentially derivative works of the images used in the AI's database.[2][3]\n"},{"TagName":"a","Data":"Stable Diffusion"},{"TagName":"a","Data":"[1]"},{"TagName":"a","Data":"[2]"},{"TagName":"a","Data":"[3]"},{"TagName":"h4","Data":"Free licenses"},{"TagName":"p","Data":"There are several licenses that meet the definition of \"free\" here. Several Creative Commons (CC) license alternatives are available. Licenses which restrict the use of the media to non-profit or educational purposes only (i.e. non-commercial use only), or which are given permission to appear only on Wikipedia, are not free enough for Wikipedia's usages or goals and will be deleted.[4] In short, Wikipedia media (with the exception of \"fair use\" media—see below) should be as \"free\" as Wikipedia's content—both to keep Wikipedia's own legal status secure and to allow as much re-use of Wikipedia content as possible. For example, Wikipedia can accept images under CC-BY-SA (Attribution-Share Alike) as a free license, but not CC-BY-SA-NC (Attribution-Share Alike-Non-Commercial). A list of possible licenses which are considered \"free enough\" for Wikipedia are listed at Wikipedia:Image copyright tags.  \n"},{"TagName":"a","Data":"here"},{"TagName":"a","Data":"Creative Commons"},{"TagName":"a","Data":"[4]"},{"TagName":"a","Data":"below"},{"TagName":"a","Data":"Wikipedia:Image copyright tags"},{"TagName":"p","Data":"A list of websites that offer free images can be found at Wikipedia:Free image resources. If the place where you found the image does not declare a pre-existing free license, yet allows use of its content under terms commonly instituted by them, it must explicitly declare that commercial use and modification is permitted. If it does not so declare, you must assume that you may not use the image unless you obtain verification or permission from the copyright holder.\n"},{"TagName":"a","Data":"Wikipedia:Free image resources"},{"TagName":"a","Data":"verification or permission from the copyright holder"},{"TagName":"p","Data":"The GNU Free Documentation License (GFDL) is not permitted as the only acceptable license where all of the following are true:[5]\n"},{"TagName":"a","Data":"GNU Free Documentation License"},{"TagName":"a","Data":"[5]"},{"TagName":"p","Data":"GFDL content may still be usable under the non-free content policy. If a work that is not a derivative work with a GFDL license is used under a non-free rationale it does not have to be scaled down, but other non-free limitations will still apply.\n"},{"TagName":"a","Data":"derivative work"},{"TagName":"h4","Data":"Public domain"},{"TagName":"a","Data":"Wikipedia:Public domain"},{"TagName":"a","Data":"Wikipedia:Public domain image resources"},{"TagName":"p","Data":"Public domain images are not copyrighted, and copyright law does not restrict their use in any way. Wikipedia pages, including non-English language pages, are hosted on a server in the United States, so US law governs whether a Wikipedia image is in the public domain.\n"},{"TagName":"p","Data":"Images may be placed into the public domain by their creators, or they may be public domain because they are ineligible for copyright or because their copyright expired. In the US as of January 1, 2023, copyright has expired on any work published anywhere before January 1, 1928. Although US copyrights have also expired for many works published since then, the rules for determining expiration are complex; see When does copyright expire? for details.\n"},{"TagName":"a","Data":"copyright has expired"},{"TagName":"a","Data":"When does copyright expire?"},{"TagName":"p","Data":"In the US, reproductions of two-dimensional public domain artwork do not generate a new copyright; see Bridgeman v. Corel. Scans of images alone do not generate new copyrights—they merely inherit the copyright status of the image they are reproducing. For example, a straight-on photograph of the Mona Lisa is ineligible for copyright.\n"},{"TagName":"a","Data":"Bridgeman v. Corel"},{"TagName":"a","Data":"Mona Lisa"},{"TagName":"p","Data":"Works must usually entail a minimum amount of creativity to be copyrightable. Those that fail to meet this threshold of originality and are therefore not copyrightable, fall instead into the public domain. For instance, images that consist only of simple typeface are generally public domain (though they may yet be trademarked). Editors must be aware of the origin country of the image, as the threshold of originality may vary significantly among jurisdictions. The US has a high threshold, whereas the UK has a lower one, following a \"sweat of the brow\" standard. In such cases, an image that is copyrighted in its home country, but ineligible for copyright in the US may be uploaded locally on the English Wikipedia as a public domain image using a tag such as {{PD-USonly}}. This will help to prevent copying to Commons, where media must be free both in the source country and the US.\n"},{"TagName":"a","Data":"threshold of originality"},{"TagName":"a","Data":"may vary significantly among jurisdictions"},{"TagName":"a","Data":"PD-USonly"},{"TagName":"p","Data":"If you strongly suspect an image is a copyright infringement, you should list it for deletion; see § Deleting images below. For example, an image with no copyright status on its file page and published elsewhere with a copyright notice should be listed for deletion.\n"},{"TagName":"a","Data":"§ Deleting images"},{"TagName":"a","Data":"file page"},{"TagName":"h4","Data":"Fair-use/Non-free images"},{"TagName":"a","Data":"Wikipedia:Non-free content"},{"TagName":"p","Data":"Some usage of copyrighted materials without permission of the copyright holder can qualify as fair use in the United States (but not in most other jurisdictions). However, since Wikipedia aims to be a free-content encyclopedia, not every image that qualifies as fair-use may be appropriate. As required by the Wikimedia Foundation to meet the goals of a free content work, the English Wikipedia has adopted a purposely-stricter standard for fair-use of copyrighted images and other works, called the non-free content criteria. In general, if the image cannot be reused (including with redistribution and modification rights) by any entity, including commercial users, then the image must be considered non-free.\n"},{"TagName":"a","Data":"fair use"},{"TagName":"a","Data":"jurisdictions"},{"TagName":"a","Data":"required by the Wikimedia Foundation"},{"TagName":"a","Data":"non-free content criteria"},{"TagName":"p","Data":"Use of copyrighted material under an invalid claim of a non-free rationale constitutes copyright infringement and is illegal. Media which are mistagged as non-free or are a flagrant copyright violation can be removed on sight. Editors who notice correctable errors in non-free tags or rationales are urged to fix them, if able. Voluntarily fixing such problems is helpful to Wikipedia, though many errors may be impossible to fix, such as the original source or copyright owner. A user may be banned for repeatedly uploading material which is neither free nor follows the required for non-free images.\n"},{"TagName":"a","Data":"copyright infringement"},{"TagName":"p","Data":"See also:\n"},{"TagName":"a","Data":"Wikipedia:Copyrights § Image guidelines"},{"TagName":"a","Data":"Wikipedia:File copyright tags"},{"TagName":"a","Data":"Wikipedia:Logos"},{"TagName":"h4","Data":"Watermarks, credits, titles, and distortions"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:WATERMARK"},{"TagName":"a","Data":"Wikipedia:Manual of Style/Captions § Credits"},{"TagName":"p","Data":"Free images should not be watermarked, distorted, have any credits or titles in the image itself or anything else that would hamper their free use, unless, of course, the image is intended to demonstrate watermarking, distortion, titles, etc. and is used in the related article. Exceptions may be made for historic images when the credit or title forms an integral part of the composition. Historical images in the public domain sometimes are out of focus, display dye dropouts, dust or scratches or evidence of the printing process used. All photo credits should be in a summary on the image description page. Images with watermarks may be tagged {{imagewatermark}}.\n"},{"TagName":"a","Data":"watermarked"},{"TagName":"a","Data":"image description page"},{"TagName":"a","Data":"imagewatermark"},{"TagName":"h3","Data":"Privacy rights"},{"TagName":"a","Data":"Commons:Commons:Photographs of identifiable people"},{"TagName":"a","Data":"Foundation:Resolution:Images of identifiable people"},{"TagName":"p","Data":"When taking pictures of identifiable people, the subject's consent is not usually needed for straightforward photographs taken in a public place, but is often needed for photographs taken in a private place. This type of consent is sometimes called a model release, and it is unrelated to the photographer's copyright.\n"},{"TagName":"a","Data":"model release"},{"TagName":"p","Data":"Because of the expectation of privacy, the consent of the subject should normally be sought before uploading any photograph featuring an identifiable individual that has been taken in a private place, whether or not the subject is named. Even in countries that have no law on privacy, there is a moral obligation on us not to upload photographs which infringe the subject's reasonable expectation of privacy. If you upload a self-portrait, your consent is presumed.\n"},{"TagName":"a","Data":"expectation of privacy"},{"TagName":"a","Data":"law on privacy"},{"TagName":"p","Data":"Bear in mind that EXIF metadata in uploaded images – such as time data and the make, model, and location of the device capturing the image – is publicly visible.\n"},{"TagName":"a","Data":"EXIF"},{"TagName":"p","Data":"Be aware that just because a freely licensed image may be available at Commons, it may still be inappropriate to use on the English Wikipedia due to our policy on living persons. Commons is a shared media repository for Wikimedia Foundation projects, each of which may have its own content policies, and many of which differ significantly from those of the English Wikipedia.\n"},{"TagName":"a","Data":"policy on living persons"},{"TagName":"a","Data":"Wikimedia Foundation"},{"TagName":"h4","Data":"What are public and private places?"},{"TagName":"p","Data":"For the purposes of this policy, a private place is a place where people have a reasonable expectation of privacy, while a public place is a place where people have no such expectation.\n"},{"TagName":"p","Data":" \n"},{"TagName":"h4","Data":"Legal issues"},{"TagName":"p","Data":"There are a variety of non-copyright laws which may affect the photographer, the uploader and/or the Wikimedia Foundation, including defamation, personality rights, trademark and privacy rights. Because of this, certain uses of such images may still be prohibited without the agreement of the depicted person, or the holder of other non-copyright related rights.\n"},{"TagName":"a","Data":"Wikimedia Foundation"},{"TagName":"a","Data":"defamation"},{"TagName":"a","Data":"personality rights"},{"TagName":"a","Data":"trademark"},{"TagName":"a","Data":"privacy"},{"TagName":"p","Data":"Defamation may arise not only from the content of the image itself but also from its description and title when uploaded. An image of an identified unknown individual may be unexceptional on its own, but with the title \"A drug-dealer\" there may be potential defamation issues in at least some countries.\n"},{"TagName":"p","Data":"Another factor to consider is the established reliability and past respect for copyright of the source of publication of a photo. Some tabloid newspapers and magazines have had legal issues with respect of original copyright for sake of getting their stories out, and images from such sources may be problematic to use on Wikipedia for both legal and moral reasons.\n"},{"TagName":"p","Data":"There are a limited number of types of images that are illegal as they are not considered protected speech within the United States' First Amendment, such as child pornography. These images are unacceptable under the Wikimedia Foundation's terms of use, and may never be uploaded to any Wikimedia server. Users who attempt to upload such images will likely be banned from use of any Wikimedia Foundation server.\n"},{"TagName":"a","Data":"the Wikimedia Foundation's terms of use"},{"TagName":"a","Data":"banned from use of any Wikimedia Foundation server."},{"TagName":"h4","Data":"Moral issues"},{"TagName":"p","Data":"Not all legally obtained photographs of individuals are acceptable. The following types of image are normally considered unacceptable:\n"},{"TagName":"p","Data":"These are categories which are matters of common decency rather than law. They find a reflection in the wording of the Universal Declaration of Human Rights, Article 12: \"No one shall be subjected to arbitrary interference with his privacy, family, home or correspondence, nor to attacks upon his honour and reputation\".\n"},{"TagName":"a","Data":"Universal Declaration of Human Rights, Article 12"},{"TagName":"p","Data":"The extent to which a particular photograph is \"unfair\" or \"intrusive\" will depend on the nature of the shot, whether it was taken in a public or private place, the title/description, and on the type of subject (e.g. a celebrity, a non-famous person, etc.). This is all a matter of degree. A secretly taken shot of a celebrity caught in an embarrassing position in a public place may well be acceptable to the community; a similar shot of an anonymous member of the public may or may not be acceptable, depending on what is shown and how it is presented.\n"},{"TagName":"h4","Data":"Examples"},{"TagName":"h4","Data":"Alternatives"},{"TagName":"p","Data":"If an image requires consent, but consent cannot be obtained, there are several options. For example, identifying features can be blurred, pixelated, or obscured so that the person is no longer identifiable. Also, the picture may be re-taken at a different angle, perhaps so that the subject's face is not visible.\n"},{"TagName":"h2","Data":"Uploading images"},{"TagName":"p","Data":"Privacy disclosure statement: for image file formats JPG and PNG all EXIF metadata in the uploaded image is publicly visible on all Wikipedia and associated websites. This includes your location, the date and time the image was recorded and the make and model of your camera or smartphone.\n"},{"TagName":"h3","Data":"Format"},{"TagName":"p","Data":""},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:IUP#FORMAT"},{"TagName":"a","Data":"Wikipedia:Preparing images for upload"},{"TagName":"p","Data":"Generally:\n"},{"TagName":"a","Data":"icons"},{"TagName":"a","Data":"logos"},{"TagName":"a","Data":"SVG"},{"TagName":"a","Data":"format"},{"TagName":"a","Data":"vector images"},{"TagName":"a","Data":"PNG"},{"TagName":"a","Data":"screenshots"},{"TagName":"a","Data":"PNG"},{"TagName":"a","Data":"scanned"},{"TagName":"a","Data":"JPEG"},{"TagName":"a","Data":"PNG"},{"TagName":"a","Data":"JPEG"},{"TagName":"a","Data":"GIF"},{"TagName":"a","Data":"Ogg"},{"TagName":"a","Data":"Theora"},{"TagName":"a","Data":"WebM"},{"TagName":"p","Data":"Generally speaking, you should not contribute images consisting solely of formatted or unformatted text, tables, or mathematical formulas.  In most cases these can instead be typed directly into an article in wiki markup (possibly using MediaWiki's special syntax for tables, math).  This will make the information easier to edit, as well as make it accessible to users of screen readers and text-based browsers.\n"},{"TagName":"a","Data":"wiki markup"},{"TagName":"a","Data":"tables"},{"TagName":"a","Data":"math"},{"TagName":"a","Data":"accessible"},{"TagName":"a","Data":"browsers"},{"TagName":"p","Data":"In general, if you have a good image that is in the wrong format, convert it to the correct format before uploading. However, if you find a map, flag, etc. in JPEG format, only convert it to PNG if this reduces the file size. For further advice on converting JPEG to PNG, see Wikipedia:How to reduce colors for saving a JPEG as PNG.\n"},{"TagName":"a","Data":"Wikipedia:How to reduce colors for saving a JPEG as PNG"},{"TagName":"p","Data":"Most of the maps on the CIA World Factbook website were coded as JPEG, but are now coded as GIF. To update these photos, download the GIF picture from the CIA Factbook, resave it in PNG format, and upload it to Wikipedia.\n"},{"TagName":"a","Data":"CIA World Factbook"},{"TagName":"p","Data":"Try to avoid editing JPEGs too frequently—each edit creates more loss of quality. If you can find an original of a photograph in 16-bit or 24-bit PNG or TIFF, edit that, and save as JPEG before you upload. A limited variety of edits (crops, rotation, flips) can be performed losslessly using jpegcrop (Windows) or jpegtran  (other); try to use this where possible.\n"},{"TagName":"a","Data":"TIFF"},{"TagName":"a","Data":"losslessly"},{"TagName":"a","Data":"jpegcrop"},{"TagName":"a","Data":"jpegtran"},{"TagName":"p","Data":"JPEG files should not use arithmetic coding due to limited browser support. Please prefer Huffman coding for JPEG files instead.\n"},{"TagName":"a","Data":"arithmetic coding"},{"TagName":"a","Data":"Huffman coding"},{"TagName":"p","Data":"Avoid images that mix photographic and iconic content.\nThough CSS makes it easy to use a PNG overlay on top of a JPEG image, the Wikipedia software does not allow such a technique. Thus, both parts must be in the same file, and either the quality of one part will suffer, or the file size will be unnecessarily large.\n"},{"TagName":"a","Data":"CSS"},{"TagName":"p","Data":"SVG support is implemented as of September 2005 (see meta:SVG image support). The SVG is not directly given to the browser; instead, the SVG file is dynamically rendered as a PNG at a given size, and that PNG is given to the browser.\n"},{"TagName":"a","Data":"meta:SVG image support"},{"TagName":"h4","Data":"Images containing text"},{"TagName":"p","Data":"If you create an image that contains text, please also upload a version without any text. It will help Wikipedians translate your image into other languages.\n"},{"TagName":"p","Data":"SVG images can contain text in multiple languages in a single file (using a switch element). See Commons:Help:Translation tutorial § SVG files.\n"},{"TagName":"a","Data":"Commons:Help:Translation tutorial § SVG files"},{"TagName":"h4","Data":"Cropping"},{"TagName":"p","Data":"Within reason, crop an image to remove irrelevant areas. But do not \"throw away information\"; for example, if a photograph shows George Washington and Abraham Lincoln together at a birthday party, and the article you're working on requires only Lincoln, consider uploading both the original image and the crop of Lincoln. Also, if an image has captions as an inherent part of the artwork (as with book illustrations, early cartoons, many lithographs, etc.), don't crop them, or upload the original uncropped version as well.\n"},{"TagName":"h4","Data":"Animated images"},{"TagName":"p","Data":""},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:IUP#ANIM"},{"TagName":"p","Data":"It may be preferable to convert a long or color-rich animation to Ogg/Theora format instead of GIF. Ogg does not allow an animation to play automatically on page loading, but it can contain audio and has generally better resolution.\n"},{"TagName":"a","Data":"Ogg"},{"TagName":"a","Data":"Theora"},{"TagName":"p","Data":"Inline animations should be used sparingly; a static image with a link to the animation is preferred unless the animation has a very small file size. Keep in mind the problems with print compatibility mentioned elsewhere on this page.\n"},{"TagName":"h4","Data":"Uploaded image size"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:FILESIZE"},{"TagName":"a","Data":"Displayed image size"},{"TagName":"p","Data":"Wikipedia and its sister projects are repositories of knowledge, so images should be uploaded at high resolution whether or not this seems \"necessary\" for the use immediately contemplated‍—‌\"saving server space\" is not a valid consideration in general, though there is a 1,000 MB (1 GB) limit.\nException: If the image is copyrighted and used under fair use, the uploaded image must be as low-resolution as possible consistent with its fair-use rationale, to prevent use of Wikipedia's copy as a substitute for the original work.\n"},{"TagName":"a","Data":"copyrighted"},{"TagName":"p","Data":"The servers automatically handle the scaling of images (whatever their original size) to the sizes called for in particular articles, so it is neither necessary nor desirable to upload separate reduced-size or reduced-quality \"thumbnail\" versions, although compressing PNGs may be useful.\n"},{"TagName":"a","Data":"PNGs"},{"TagName":"h3","Data":"Image titles and file names"},{"TagName":"p","Data":""},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:IUP#NAME"},{"TagName":"p","Data":"Descriptive file names are also useful. A map of Africa could be called \"Africa.png\", but quite likely more maps of Africa will be useful in Wikipedia, so it is good to be more specific in a meaningful way, e.g. \"Africa political map Jan. 2012.png\", or \"Africa political map with red borders.png\". Check whether there are already maps of Africa in Wikipedia. Then decide whether your map should replace one (in each article that uses it) or be additional. In the first case give it exactly the same name, otherwise a suitable other name. Avoid special characters in filenames or excessively long filenames, though, as that might make it difficult for some users to download the files onto their machines. Every letter of a file name – including the extension – is case sensitive: \"Africa.png\" is considered distinct from \"Africa.PNG\". For uniformity, lower case file name extensions are recommended.\n"},{"TagName":"p","Data":"You may use the same name in the case of a different image that replaces the old one, and also if you make an improved version of the same image – perhaps a scanned image that you scanned again with a better quality scanner, or you used a better way of reducing the original in scale – then upload it with the same title as the old one. This allows people to easily compare the two images, and avoids the need to delete images or change articles. However, this is not possible if the format is changed, since then at least the extension part of the name has to be changed.\n"},{"TagName":"p","Data":"\n"},{"TagName":"h3","Data":"Required information"},{"TagName":"p","Data":""},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:IUP#RI"},{"TagName":"a","Data":"Image copyright tag"},{"TagName":"a","Data":"self"},{"TagName":"a","Data":"PD-self"},{"TagName":"a","Data":"non-free images"},{"TagName":"a","Data":"on the non-free content page"},{"TagName":"h2","Data":"Adding images to articles"},{"TagName":"h3","Data":"Image content and selection"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:IMGCONTENT"},{"TagName":"a","Data":"Wikipedia:Manual of Style/Images"},{"TagName":"p","Data":"The purpose of an image is to increase readers' understanding of the article's subject matter, usually by directly depicting people, things, activities, and concepts described in the article.\nThe relevant aspect of the image should be clear and central. Guidance for selecting images when multiple potential images are available can be found at Wikipedia:Manual of Style/Images, keeping in mind that Wikipedia desires freely licensed images over non-free ones when they otherwise serve the same educational purpose.\n"},{"TagName":"a","Data":"Wikipedia:Manual of Style/Images"},{"TagName":"a","Data":"Wikipedia desires freely licensed images over non-free ones"},{"TagName":"p","Data":"Wikipedia is not censored, and explicit or even shocking pictures may serve an encyclopedic purpose, but editors should take care not to use such images simply to bring attention to an article.\n"},{"TagName":"a","Data":"Wikipedia is not censored"},{"TagName":"h3","Data":"Placement"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:IMGPLACEMENT"},{"TagName":"p","Data":"See Wikipedia:Extended image syntax for recommendations on the best markup to use. Images should be placed in articles following Wikipedia:Manual of Style/Images. For ideas and examples of how to place images, see Help:Pictures.\n"},{"TagName":"a","Data":"Wikipedia:Extended image syntax"},{"TagName":"a","Data":"Wikipedia:Manual of Style/Images"},{"TagName":"a","Data":"Help:Pictures"},{"TagName":"h4","Data":"Image galleries"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:IG"},{"TagName":"a","Data":"WP:GALLERY"},{"TagName":"a","Data":"Help:Gallery tag"},{"TagName":"a","Data":"Template:Cleanup-gallery"},{"TagName":"a","Data":"MOS:PEOPLEGALLERY"},{"TagName":"p","Data":"In articles that have several images, they are typically placed individually near the relevant text (see MOS:IMAGELOCATION). Wikipedia is not an image repository. A gallery is not a tool to shoehorn images into an article, and a gallery consisting of an indiscriminate collection of images of the article subject should generally either be improved in accordance with the below paragraphs or moved to Wikimedia Commons.\n"},{"TagName":"a","Data":"MOS:IMAGELOCATION"},{"TagName":"a","Data":"is not an image repository"},{"TagName":"a","Data":"moved"},{"TagName":"a","Data":"Wikimedia Commons"},{"TagName":"p","Data":"Generally, a gallery or cluster of images  should not be added so long as there is space for images to be effectively presented adjacent to text. A gallery section may be appropriate in some Wikipedia articles if a collection of images can illustrate aspects of a subject that cannot be easily or adequately described by text or individual images. Just as we seek to ensure that the prose of an article is clear, precise and engaging, galleries should be similarly well-crafted.  Gallery images must collectively add to the reader's understanding of the subject without causing  unbalance to an article or section within an article while avoiding similar or repetitive images, unless a point of contrast or comparison is being made. \n"},{"TagName":"a","Data":"gallery section"},{"TagName":"a","Data":"clear, precise and engaging"},{"TagName":"a","Data":"unbalance"},{"TagName":"p","Data":"Articles consisting entirely or primarily of galleries are discouraged, as the Commons is intended for such collections of images. One rule of thumb to consider: if, due to its content, such a gallery would only lend itself to a title along the lines of \"Gallery\" or \"Images of [insert article title]\", as opposed to a more descriptive title, the gallery should either be revamped or moved to the Commons.  However, a few Wikipedia gallery-only articles, including Gallery of sovereign-state flags, Gallery of passport stamps by country or territory, Gallery of named graphs, and Gallery of curves, have been upheld at AfD.  Links to Commons categories (or even Commons galleries) can be added to the Wikipedia article using the {{Commons category}}, {{Commons}}, or {{Commons-inline}} templates. \n"},{"TagName":"a","Data":"rule of thumb"},{"TagName":"a","Data":"Gallery of sovereign-state flags"},{"TagName":"a","Data":"Gallery of passport stamps by country or territory"},{"TagName":"a","Data":"Gallery of named graphs"},{"TagName":"a","Data":"Gallery of curves"},{"TagName":"a","Data":"Commons category"},{"TagName":"a","Data":"Commons"},{"TagName":"a","Data":"Commons-inline"},{"TagName":"p","Data":"Images should be captioned to explain their relevance to the article subject and to the theme of the gallery, and the gallery itself should be appropriately titled (unless its theme is clear from context).  See Women's suffrage in New Zealand for an example of an informative and well-crafted gallery. Be aware different screen size and browsers may affect accessibility for some readers even with a well-crafted gallery.\n"},{"TagName":"a","Data":"Women's suffrage in New Zealand"},{"TagName":"a","Data":"accessibility"},{"TagName":"p","Data":"Using animated GIFs to display multiple photos is discouraged. The method is not suitable for printing and also is not user-friendly (users cannot save individual images and have to wait before being able to view images while other images cycle round).\n"},{"TagName":"a","Data":"GIFs"},{"TagName":"p","Data":"Fair-use images should almost never be included as part of a general image gallery, because their \"fair use\" status depends on their proper use in the context of an article (as part of analysis or criticism). See Wikipedia:Fair use for details. An example of an exception might be a gallery of comparable screenshots from a video game as it appears on two different platforms, provided that the differences are relevant (e.g., if the article discusses a controversy in the gaming press about the matter).\n"},{"TagName":"a","Data":"Wikipedia:Fair use"},{"TagName":"p","Data":"Some subjects easily lend themselves to image-heavy articles for which image galleries are suitable, such as plants (e.g., Lily), fashion (e.g., Wedding dress), and the visual arts (e.g., Oil painting).  Others do not.  There is consensus not to use a gallery of group members as the lead image for articles about large groups of people such as ethnicities.\n"},{"TagName":"a","Data":"Lily"},{"TagName":"a","Data":"Wedding dress"},{"TagName":"a","Data":"Oil painting"},{"TagName":"a","Data":"is consensus"},{"TagName":"p","Data":"The default size of a gallery should be understood as simply the size that images are presented at if nothing else is specified, not as the preferred size of the images. Disagreements about gallery image sizes should be settled like any other editing dispute, by discussion on the article talk page.\n"},{"TagName":"h4","Data":"Collages and montages"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:COLLAGE"},{"TagName":"a","Data":"WP:MONTAGE"},{"TagName":"a","Data":"Wikipedia:Collage tips"},{"TagName":"p","Data":"Collages and montages are single images that illustrate multiple closely related concepts, where overlapping or similar careful placement of component images is necessary to illustrate a point in an encyclopedic way. (See File:Phoebian Explorers 2 PIA06118.jpg for an example montage.) The components of a collage or montage, as well as the collage or montage itself, must be properly licensed; and (as with galleries) fair-use components are rarely appropriate, as each non-free image used in the creation of the montage contributes towards consideration of minimal use of non-free images. If a gallery would serve as well as a collage or montage, the gallery should be preferred, as galleries are easier to maintain and adjust better to user preferences.\n"},{"TagName":"a","Data":"Collages"},{"TagName":"a","Data":"montages"},{"TagName":"a","Data":"File:Phoebian Explorers 2 PIA06118.jpg"},{"TagName":"a","Data":"minimal use of non-free images"},{"TagName":"h4","Data":"Image queuing"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:IQUEUE"},{"TagName":"p","Data":"If an article seems to have too many images for its present text, consider moving some of them temporarily to the talk page, possibly using the \u003cgallery\u003e. However, fair-use images should not be moved to talk pages, for two reasons:\n"},{"TagName":"a","Data":"\u003cgallery\u003e"},{"TagName":"a","Data":"fair-use"},{"TagName":"a","Data":"Wikipedia:Fair use § Policy"},{"TagName":"a","Data":"Wikipedia:Criteria for speedy deletion § Images/Media"},{"TagName":"h3","Data":"Displayed image size"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"WP:THUMBSIZE"},{"TagName":"a","Data":"WP:IMGSIZE"},{"TagName":"a","Data":"WP:IMAGESIZE"},{"TagName":"a","Data":"Wikipedia:Manual of Style/Images § Size"},{"TagName":"a","Data":"Wikipedia:Manual of Style/Accessibility § Images"},{"TagName":"a","Data":"Uploaded image size"},{"TagName":"p","Data":"Images adjacent to text should generally carry a caption and use the \"thumb\" (thumbnail) option, which displays the image at a width determined as follows:\n"},{"TagName":"a","Data":"caption"},{"TagName":"a","Data":"thumb"},{"TagName":"a","Data":"defaulted"},{"TagName":"a","Data":"pixels"},{"TagName":"a","Data":"user preferences"},{"TagName":"a","Data":"upright"},{"TagName":"p","Data":"Notes:\n"},{"TagName":"p","Data":"See the Wikipedia:Manual of Style/Images § Size for further guidance on expanded or reduced image sizes.\nExcept with very good reason, do not use px (e.g. |thumb|300px), which forces a fixed image width measured in pixels, disregarding the user's image size preference setting. In most cases upright=scaling_factor should be used, thereby respecting the user's base preference (which may have been selected for that user's particular devices). If px is used, the resulting image should usually be no more than 500 pixels tall and no more than 400 pixels wide, for comfortable display on the smallest devices \"in common use\" (though this may still cause viewing difficulties on some unusual displays). To convert a px value to scaling_factor, divide it by 220 and round the result as desired. For example, |150px is roughly equivalent to |upright=0.7 (150 / 220 ≃ 0.6818).\n"},{"TagName":"a","Data":"Wikipedia:Manual of Style/Images § Size"},{"TagName":"h4","Data":"Infobox and lead images"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:IMGSIZELEAD"},{"TagName":"p","Data":"The lead image in an infobox should not impinge on the default size of the infobox. Therefore, it should be no wider than upright=1.35 (equivalent to 300px at the default preference selection of \"220px\"). Images in infoboxes are generated by many different means. The most common method used to implement upright is Module:InfoboxImage (see documentation there).  Alternatively, infoboxes can use standard image syntax in the form of:\n"},{"TagName":"a","Data":"infobox"},{"TagName":"a","Data":"Module:InfoboxImage"},{"TagName":"a","Data":"image syntax"},{"TagName":"p","Data":"Stand-alone lead images (not in an infobox) should also be no wider than upright=1.35.\n"},{"TagName":"h2","Data":"Deleting images"},{"TagName":"a","Data":"Wikipedia:Guide to image deletion"},{"TagName":"a","Data":"db-f9"},{"TagName":"a","Data":"db-filecopyvio"},{"TagName":"a","Data":"WP:CSD#Files"},{"TagName":"a","Data":"subst:nsd"},{"TagName":"a","Data":"subst:nld"},{"TagName":"a","Data":"subst:nsdnld"},{"TagName":"a","Data":"subst:npd"},{"TagName":"a","Data":"non-free content policy"},{"TagName":"a","Data":"subst:orfud"},{"TagName":"a","Data":"subst:rfud"},{"TagName":"a","Data":"subst:nrd"},{"TagName":"a","Data":"subst:dfu"},{"TagName":"a","Data":"subst:prod"},{"TagName":"a","Data":"files for discussion"},{"TagName":"a","Data":"ffd"},{"TagName":"a","Data":"Wikipedia:Files for discussion"},{"TagName":"a","Data":"files for discussion"},{"TagName":"a","Data":"ffd"},{"TagName":"a","Data":"Wikipedia:Files for discussion"},{"TagName":"p","Data":"To actually delete an image after following the above procedure, you must be an administrator. To do so, go to the image description page and click the (del) or Delete this page links. Administrators can also restore deleted images.\n"},{"TagName":"a","Data":"administrator"},{"TagName":"h2","Data":"See also"},{"TagName":"a","Data":"Wikipedia:Arguments to avoid in image deletion discussions"},{"TagName":"a","Data":"Wikipedia:Finding images tutorial"},{"TagName":"a","Data":"Wikipedia:Graphics tutorials"},{"TagName":"a","Data":"Wikipedia:How to create charts for Wikipedia articles"},{"TagName":"a","Data":"Wikipedia:How to upload a photo"},{"TagName":"a","Data":"Wikipedia:Image dos and don'ts"},{"TagName":"a","Data":"Wikipedia:Manual of Style/Music samples"},{"TagName":"a","Data":"Wikipedia talk:What Wikipedia is not/galleries"},{"TagName":"a","Data":"Wikipedia:WikiProject Images and Media/Illustration taskforce"},{"TagName":"a","Data":"Meta:Help:Redirect § Images linking to a specific page"},{"TagName":"a","Data":"Category:Images requiring maintenance"},{"TagName":"h2","Data":"References"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"AI-created images lose U.S. copyrights in test for new technology\""},{"TagName":"a","Data":"Reuters"},{"TagName":"a","Data":"Archived"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"Getty Images bans AI-generated content over fears of legal challenges\""},{"TagName":"a","Data":"The Verge"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"US judge finds flaws in artists' lawsuit against AI companies\""},{"TagName":"a","Data":"Reuters"},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"\"[WikiEN-l] Non-commercial only and By Permission Only Images to be deleted\""},{"TagName":"a","Data":"^"},{"TagName":"a","Data":"Wikipedia:Village pump (proposals)/Archive 182#Restricting GFDL-licensed uploads"},{"TagName":"a","Data":"v"},{"TagName":"a","Data":"t"},{"TagName":"a","Data":"e"},{"TagName":"a","Data":"policies and guidelines"},{"TagName":"a","Data":"Five pillars"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"Verifiability"},{"TagName":"a","Data":"No original research"},{"TagName":"a","Data":"Neutral point of view"},{"TagName":"a","Data":"What Wikipedia is not"},{"TagName":"a","Data":"Biographies of living persons"},{"TagName":"a","Data":"Copyright"},{"TagName":"a","Data":"Copyright violations"},{"TagName":"a","Data":"Image use"},{"TagName":"a","Data":"Article titles"},{"TagName":"a","Data":"Notability"},{"TagName":"a","Data":"Autobiography"},{"TagName":"a","Data":"Citing sources"},{"TagName":"a","Data":"Reliable sources"},{"TagName":"a","Data":"Medicine"},{"TagName":"a","Data":"Do not include copies of lengthy primary sources"},{"TagName":"a","Data":"Plagiarism"},{"TagName":"a","Data":"Don't create hoaxes"},{"TagName":"a","Data":"Fringe theories"},{"TagName":"a","Data":"Patent nonsense"},{"TagName":"a","Data":"External links"},{"TagName":"a","Data":"Civility"},{"TagName":"a","Data":"Consensus"},{"TagName":"a","Data":"Harassment"},{"TagName":"a","Data":"Vandalism"},{"TagName":"a","Data":"Ignore all rules"},{"TagName":"a","Data":"No personal attacks"},{"TagName":"a","Data":"Ownership of content"},{"TagName":"a","Data":"Edit warring"},{"TagName":"a","Data":"Dispute resolution"},{"TagName":"a","Data":"Sockpuppetry"},{"TagName":"a","Data":"No legal threats"},{"TagName":"a","Data":"Child protection"},{"TagName":"a","Data":"Paid-contribution disclosure"},{"TagName":"a","Data":"Assume good faith"},{"TagName":"a","Data":"Conflict of interest"},{"TagName":"a","Data":"Disruptive editing"},{"TagName":"a","Data":"Do not disrupt Wikipedia to illustrate a point"},{"TagName":"a","Data":"Etiquette"},{"TagName":"a","Data":"Gaming the system"},{"TagName":"a","Data":"Please do not bite the newcomers"},{"TagName":"a","Data":"Courtesy vanishing"},{"TagName":"a","Data":"Responding to threats of harm"},{"TagName":"a","Data":"Talk page guidelines"},{"TagName":"a","Data":"Signatures"},{"TagName":"a","Data":"Deletion policy"},{"TagName":"a","Data":"Proposed deletion"},{"TagName":"a","Data":"Biographies"},{"TagName":"a","Data":"Criteria for speedy deletion"},{"TagName":"a","Data":"Attack page"},{"TagName":"a","Data":"Oversight"},{"TagName":"a","Data":"Revision deletion"},{"TagName":"a","Data":"Administrators"},{"TagName":"a","Data":"Banning"},{"TagName":"a","Data":"Blocking"},{"TagName":"a","Data":"Page protection"},{"TagName":"a","Data":"Editing policy"},{"TagName":"a","Data":"Article size"},{"TagName":"a","Data":"Summary style"},{"TagName":"a","Data":"Be bold"},{"TagName":"a","Data":"Disambiguation"},{"TagName":"a","Data":"Hatnotes"},{"TagName":"a","Data":"Broad-concept article"},{"TagName":"a","Data":"Understandability"},{"TagName":"a","Data":"Manual of Style"},{"TagName":"a","Data":"Contents"},{"TagName":"a","Data":"Accessibility"},{"TagName":"a","Data":"Dates and numbers"},{"TagName":"a","Data":"Images"},{"TagName":"a","Data":"Layout"},{"TagName":"a","Data":"Lead section"},{"TagName":"a","Data":"Linking"},{"TagName":"a","Data":"Lists"},{"TagName":"a","Data":"Categories, lists, and navigation templates"},{"TagName":"a","Data":"Categorization"},{"TagName":"a","Data":"Template namespace"},{"TagName":"a","Data":"Project namespace"},{"TagName":"a","Data":"WikiProjects"},{"TagName":"a","Data":"User pages"},{"TagName":"a","Data":"User boxes"},{"TagName":"a","Data":"Shortcuts"},{"TagName":"a","Data":"Subpages"},{"TagName":"a","Data":"Terms of Use"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"Friendly space policy"},{"TagName":"a","Data":"Licensing and copyright"},{"TagName":"a","Data":"Privacy policy"},{"TagName":"a","Data":"List of all policies and guidelines"},{"TagName":"a","Data":"List of policies"},{"TagName":"a","Data":"List of guidelines"},{"TagName":"a","Data":"Summaries of values and principles"}]