[{"TagName":"a","Data":""},{"TagName":"a","Data":"essay"},{"TagName":"a","Data":"Wikipedia:Reliable sources"},{"TagName":"a","Data":"Wikipedia's policies or guidelines"},{"TagName":"a","Data":"thoroughly vetted by the community"},{"TagName":"a","Data":"Shortcut"},{"TagName":"a","Data":"WP:P\u0026P"},{"TagName":"p","Data":"Different content policies and guidelines use slightly different standards.  One of the commonly misunderstood distinctions is between \"secondary source\" and \"third party\".\n"},{"TagName":"p","Data":"\"Secondary\" does not mean \"independent\" or \"uninvolved\".  Most independent sources are not secondary sources.\n"},{"TagName":"a","Data":"independent sources"},{"TagName":"p","Data":"Exploring the mysteries of deep space; A cosmic journey \nOverview\nDeep space , often referred to as the final frontier , encompasses the regions of the universe beyond our solar system .It is a realm filled with countless galaxies , stars , planets, and celestial phenomena waiting to be explored and understood .Here we delve into the enigmatic aspects of deep space that continue to captivate astronomers and space enthusiast alike.\nMysteries of deep space \nDark matter\n"},{"TagName":"p","Data":"•\tWhat is dark matter?\nDark matter is an elusive substance that makes up a significant portion of the universe mass, yet remains inverses mass, yet it remains invisible and undetable by conventional means.\n"},{"TagName":"p","Data":"•\tWhat is mysterious?\nThe existence of dark matter is inferred from its gravitational effects on visible matter, but its exact nature and composition remain unknown.\n"},{"TagName":"p","Data":"Black holes\n"},{"TagName":"p","Data":"\n"},{"TagName":"p","Data":"•\tFormation and characteristics\nBlack holes are regions in space where gravity is so instance that nothing, not even light, can escape their gravitational pull.\n"},{"TagName":"p","Data":"•\tHawking radiation\nThese cosmic behemoths emit hawking radiation, leading to the paradox of black hole evaporation and the loss of information. \nCosmic expansion\n•\tThe big bang theory\nThe universe is believed to have originated from a hot and dense state known as the big bang, and it has been expanding ever since.\n"},{"TagName":"p","Data":"•\tDark energy\nThe mysterious force known as dark energy is driving the accelerated expansion of the universe, challenging our understanding of its ultimate fate.\n"},{"TagName":"h2","Data":"What is a third-party source?[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Wikipedia:Third-party sources"},{"TagName":"p","Data":"A third-party source is a source that isn't involved in the event.  The third party is generally expected to be an independent, outside observer.  It is common for the third party to be neutral and even-handed, but, in some instances, the third party may have strong opinions about the event.  However, they take no direct part in the event.\n"},{"TagName":"a","Data":"subject-matter expert"},{"TagName":"a","Data":"consumer organization"},{"TagName":"p","Data":"For some subjects, there are no first-party sources.  For example, no one is an \"involved\" party in simple arithmetic or basic anatomy, so any reliable source supporting a statement like \"two plus two equals four\" or \"the human hand typically has four fingers and one thumb\" will be a third-party source.\n"},{"TagName":"p","Data":"For other subjects, no third-party sources exist, because the only people who have published information are the people involved in it.  Wikipedia should not have articles on any topic that third-party sources have never written about, or have published only trivial, routine, or passing mentions; they are not notable.\n"},{"TagName":"a","Data":"not"},{"TagName":"a","Data":"notable"},{"TagName":"p","Data":"Some sources combine first-party and third-party material.  For example, journalist Rose Kushner's first book, Breast Cancer: A Personal History and Investigative Report, presents both the author's personal experiences with having breast cancer in the 1970s (first-party material) and information that she researched from academic and professional sources (third-party material).\n"},{"TagName":"a","Data":"Rose Kushner"},{"TagName":"h2","Data":"Combinatorics[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"p","Data":"Here's how this combines:\n"},{"TagName":"a","Data":"meta-analysis"},{"TagName":"a","Data":"popular science"},{"TagName":"h2","Data":"Doesn't \"third party\" mean \"independent\"?[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":""},{"TagName":"a","Data":"Wikipedia:Independent sources"},{"TagName":"p","Data":"Although third-party sources are often also independent (that is, without a conflict of interest), it is not always the case.  An independent source is a source that has no vested interest in a written topic and therefore it is commonly expected to describe the topic from a disinterested perspective. \n"},{"TagName":"p","Data":"Imagine that two large companies are involved in a lawsuit.  An investor who is not part of the dispute may still have a conflict of interest, because of plans to profit from the stock market's response to the lawsuit.  This investor is a third party, but is not financially independent.  They may have a vested interest in the dispute being seen in a particular light, or being prolonged, even though the investor is not directly involved in the lawsuit.\n"},{"TagName":"p","Data":"Consider an election with multiple candidates.  Candidate Smith gives a speech attacking Candidate Jones.  A third candidate, Roberts, publishes an advertisement decrying the attack.  Roberts is a third party—he is not attacking or being attacked—but he is not independent, because he has a vested interest in the situation.\n"},{"TagName":"h2","Data":"Doesn't \"third party\" mean \"third person\"?[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Grammatical person"},{"TagName":"p","Data":"Whether a source is first-person, second-person, or third-person is strictly a matter of grammar, not factual content.\n"},{"TagName":"h2","Data":"See also[edit]"},{"TagName":"a","Data":"edit"},{"TagName":"a","Data":"Third-party inline"},{"TagName":"a","Data":"Third-party"},{"TagName":"a","Data":"Wikipedia:Identifying and using primary and secondary sources"}]